Repository: AsherBond/api-site
Catalog: api-guide/locale/*.po
Languages: fr, hu, nl_nl, pt, ru

source: OpenStack API Guide
fr: Guide de l'API OpenStack
hu: OpenStack API Útmutató
nl_nl: OpenStack API gids
pt: Guia OpenStack API
ru: Справочник по OpenStack API

source: API Guide
fr: Guide de l'API
hu: API Útmutató
nl_nl: API gids
pt: Guia API
ru: Справочник по API

source: OpenStack Foundation
fr: Fondation OpenStack
hu: OpenStack Alapítvány
pt: Fundação OpenStack

source: Copyright details are filled in by the template.
fr: Les détails sur les droits d'auteurs sont remplis par le modèle.
hu: Copyright adatok kitöltése a sablonból
nl_nl: Details van het auteursrecht worden ingevuld door de template
pt: Os detalhes dos direitos de autor são preenchidos pelo modelo.
ru: Сведения об авторском праве заполнены по шаблону.

source: OpenStack is an open source cloud computing platform for public and private clouds. A series of interrelated projects deliver a cloud infrastructure solution. This guide is for developers who want to extend the OpenStack APIs or write applications that run on an OpenStack cloud. This guide introduces developers to OpenStack API concepts, common tasks, and ways of interacting with the APIs.
fr: OpenStack est une plate-forme informatique cloud open source pour les cloud publics et privés. Une série de projets interdépendants fournie une solution d'infrastructure cloud. Ce guide est pour les développeurs qui veulent étendre les APIs OpenStack ou écrire des applications qui s'exécutent dans le cloud OpenStack. Ce guide présente aux développeurs les concepts d'API OpenStack, tâches communes et les manières d'interagir avec les APIs.
hu: Az OpenStack egy nyílt forráskódú felhő platform, publikus és privát felhők létrehozására. Több, egymáshoz kapcsolódó projekt biztosítja a megoldást a felhő infrastruktúra megvalósítására. Ez az útmutató fejlesztőknek szól, akik az OpenStack API-kat szeretnék bővíteni vagy OpenStack felhőn futó alkalmazásokat írnak. Ez az útmutató bemutatja az OpenStack API koncepciókat, közös feladatokat és az API-kkal történő interakciókat.
nl_nl: OpenStack is een openbroncode cloudcomputing-platform voor publieke en private clouds. Een reeks van samenhangende projecten leveren een cloud-infrastructuur oplossing. Deze gids is voor ontwikkelaars die de OpenStack API's willen uitbreiden of applicaties willen schrijven die op een OpenStack cloud draaien. Deze gids introduceert ontwikkelaars met API-concepten, algemene taken, en manieren van interactie met de API's.
ru: OpenStack это платформа для облычных вычислений с открытым исходным кодом для общественных и личных облаков. Ряд связанных проектов составляют решение для облачной инфраструктуры. Это руководство для разработчиков, которые хотят расширить API OpenStack или писать приложения, работающие в облаке OpenStack. Это руководство знакомить разработчиков с концепциями API OpenStack, общими задачами и путями взаимодействия с API.

source: First edition of this book.
fr: Première édition de cet ouvrage.
hu: Első kiadás.
nl_nl: Eerste editie van dit boek.
pt: Primeira edição deste livro.
ru: Первая редакция этой книги.

source: API limits
fr: Limites de l'API
hu: API korlátok
nl_nl: API beperkingen
pt: Limites API
ru: Ограничения API

source: API concepts
fr: Concepts de l'API
hu: API koncepciók
nl_nl: API concepten
pt: Conceitos de API
ru: Понятия API

source: API overview
fr: Aperçu de l'API
hu: API áttenkintés
nl_nl: API overzicht
pt: Sumário de API
ru: Обзор API

source: Use the APIs
fr: Utiliser les APIs
hu: API-k felhasználása
nl_nl: Gebruik de APIs
pt: Use os APIs
ru: Используйте API

source: Provide tutorials, examples, interspersed with specific API concepts?
fr: Tutoriaux, exemples et concepts tournants autour de l'API ?
nl_nl: Verstrek tutorials, voorbeelden, afgewisseld met specifieke API concepten?
ru: Предоставьте учебники, примеры, с перемежающимися специфичными API концепциями?

source: translator-credits
fr: Communauté des traducteurs FR, https://wiki.openstack.org/wiki/I18nTeam/fr, 2014, 2015
nl_nl: Roeltje, 2015
pt: Manuela Silva - manuela.silva@sky.com
ru: Ainur Shakirov <shakirov.aynur@cg.ru>, 2014 Aleksey Rusetskiy <fenuks@fenuks.ru>, 2015

source: local
hu: helyi
nl_nl: lokaal
ru: локальный
