Repository: AsherBond/api-site
Catalog: api-ref/locale/*.po
Languages: fr

source: Use virtual networking services among devices that are managed by the OpenStack Compute service. The Networking (neutron) API v2.0 combines the API v1.1 functionality with some essential Internet Protocol Address Management (IPAM) functionality. Enables users to associate IP address blocks and other network configuration settings with an OpenStack Networking network. You can choose a specific IP address from the block or let OpenStack Networking choose the first available IP address.
fr: Utilisez les services de réseau virtuels parmi les périphériques qui sont gérés par le service de Calcul OpenStack. L'API de Gestion Réseau (neutron) v2.0 combine la fonctionnalité de l'API v1.1 avec quelques-unes des fonctionnalités de Gestion d'Adresse de Protocole Internet (IPAM) essentielles. Permet aux utilisateurs d'associer des blocs d'adresses IP et d'autres réglages de configuration réseau avec un réseau OpenStack Networking. Vous pouvez choisir une adresse IP spécifique à partir du bloc ou laisser la couche Réseau d'OpenStack choisir la première adresse IP disponible.

source: List information for all Networking API versions and show details about API v2.
fr: Liste les informations pour toutes les versions de l'API de Gestion Réseau et affiche les détails de l'API v2.

source: Networks
fr: Réseaux

source: List, show information for, create, update, and delete networks.
fr: Liste, affiche les informations, crée, modifie, et supprime les réseaux.

source: Subnets
fr: Sous-réseaux

source: List, show information for, create, update, and delete subnet resources.
fr: Liste, affiche les informations, crée, modifie, et supprime les ressources de sous-réseau.

source: List, show information for, create, update, and delete ports.
fr: Liste, affiche les informations, crée, modifie, et supprime les ports.

source: Get an authentication token that permits access to the OpenStack services REST API.
fr: Obtenir un jeton d'authentification permettant l'accès aux services de l'API REST d'OpenStack.

source: OS-KSADM admin extension
fr: Extension d'administration OS-KSADM

source: OS-KSCATALOG admin extension
fr: Extension d'administration OS-KSCATALOG

source: OS-KSEC2 admin extension
fr: Extension d'administration OS-KSEC2

source: OS-KSS3 admin extension
fr: Extension d'administration OS-KSS3

source: OS-KSVALIDATE admin extension
fr: Extension d'administration OS-KSVALIDATE

source: Manage volumes and snapshots for use with the Block Storage API, also known as cinder services.
fr: Gère les volumes et les instantanés à utiliser avec l'API de Stockage par Bloc, aussi connu en tant que services cinder.

source: API extensions
fr: Extensions de l'API

source: A volume is a detachable block storage device. You can think of it as a USB hard drive. You can attach a volume to one instance at a time.
fr: Un volume est un périphérique de stockage par bloc amovible. Vous pouvez le voir comme un disque dur USB. Vous pouvez attacher un volume à une instance à un moment.

source: Volume statuses
fr: États des volumes

source: creating
fr: création

source: The volume is being created.
fr: Le volume est en train d'être créer.

source: available
fr: disponible

source: The volume is ready to be attached to an instance.
fr: Le volume est prêt à être attaché à une instance.

source: attaching
fr: attachement

source: The volume is attaching to an instance.
fr: Le volume est attaché à une instance.

source: in-use
fr: en cours d'utilisation

source: The volume is attached to an instance.
fr: Le volume est attaché à une instance.

source: deleting
fr: suppression

source: The volume is being deleted.
fr: Le volume est en train d'être supprimer.

source: error
fr: erreur

source: An error occurred during volume creation.
fr: Une erreur est survenue durant la création du volume.

source: error_deleting
fr: erreur_suppression

source: An error occurred during volume deletion.
fr: Une erreur est survenue durant la suppression du volume.

source: backing-up
fr: sauvegarde en cours

source: The volume is being backed up.
fr: Le volume est en train d'être sauvegardé.

source: restoring-backup
fr: restauration de sauvegarde

source: A backup is being restored to the volume.
fr: Une sauvegarde est en train de restaurer un volume.

source: error_restoring
fr: erreur_restauration

source: An error occurred during backup restoration to a volume.
fr: Une erreur est survenue durant la sauvegarde de restauration d'un volume.

source: Volume types
fr: Types de volume

source: Snapshots
fr: Instantanés

source: A snapshot is a point in time copy of the data that a volume contains.
fr: Un instantané est à un moment précis une copie des données qu'un volume contient.

source: When you create, list, or delete snapshots, these status values are possible:
fr: Quand vous créez, listez ou supprimez des instantanés, ces valeurs de statuts sont possibles :

source: Snapshot statuses
fr: États des instantanés

source: The snapshot is being created.
fr: L'instantané est en train d'être créé.

source: The snapshot is ready to be used.
fr: L'instantané est prêt à être utilisé.

source: The snapshot is being deleted.
fr: L'instantané est en train d'être supprimer.

source: An error occurred during snapshot creation.
fr: Une erreur est survenue durant la création d'un instantané.

source: An error occurred during snapshot deletion.
fr: Une erreur est survenue durant la suppression d'un instantané.

source: Quality of service (QoS) specifications (qos-specs)
fr: Spécifications de qualité de service (QoS) (qos-specs)

source: Administrators only, depending on policy settings. Create, list, show details for, associate, disassociate, and delete quality of service (QoS) specifications.
fr: Pour administrateurs seulement, en fonction des réglages de la police. Crée, liste, affiche les informations, associe, désassocie, et supprime les spécifications de qualité de service (QoS).

source: Quota sets extension (os-quota-sets)
fr: Extension de jeux de quotas (os-quota-sets)

source: Administrators only, depending on policy settings. View, update, and delete quotas for a tenant.
fr: Pour administrateurs seulement, en fonction des réglages de police. Affiche, modifie, et supprime les quotas pour un client.

source: Limits extension (limits)
fr: Extension de Limites (limits)

source: Show absolute limits for a tenant.
fr: Affiche les limites absolues pour un client.

source: Backups
fr: Sauvegardes

source: A backup is a full copy of a volume stored in an external service. The service can be configured. The only supported service for now is Object Storage. A backup can subsequently be restored from the external service to either the same volume that the backup was originally taken from, or to a new volume. backup and restore operations can only be carried out on volumes which are in an unattached and available state.
fr: Une sauvegarde est une copie complète d'un volume stocké dans un service externe. Ce service peut être configuré. Le seul service supporté aujourd'hui est Object Storage. Une sauvegarde peut ensuite être restaurée depuis un service externe dans au choix le même volume où la sauvegarde a été prise ou dans un nouveau volume. Les opérations de sauvegarde et de restauration ne peuvent être uniquement effectuées sur des volumes qui sont dans des états libres et disponibles.

source: When you create, list, or delete backups, these status values are possible:
fr: Quand vous créez, listez ou supprimez des sauvegardes, ces valeurs de statuts sont possibles :

source: Backup statuses
fr: États des sauvegardes

source: The backup is being created.
fr: La sauvegarde est en train d'être créée.

source: The backup is ready to be restored to a volume.
fr: La sauvegarde est prête à être restaurer dans un volume.

source: The backup is being deleted.
fr: La sauvegarde est en train d'être supprimer.

source: An error has occurred with the backup.
fr: Une erreur est survenue avec la sauvegarde.

source: restoring
fr: restauration en cours

source: The backup is being restored to a volume.
fr: La sauvegarde va être restaurée dans un volume.

source: In the event of an error, more information about the error can be found in the <literal>fail_reason</literal> field for the backup.
fr: Dans l'éventualité d'une erreur, plus d'information sur celle-ci peut être trouvé dans le champ <literal>fail_reason</literal> pour la sauvegarde.

source: Volume manage extension (os-volume-manage)
fr: Gestion de l'extension de volume (os-volume-manage)

source: Create new volumes using existing storage, rather than allocating new storage.
fr: Créer de nouveaux volumes en utilisant le stockage existant, plutôt qu'en allouant un nouvel espace.

source: Use a template language to orchestrate OpenStack services.
fr: Utilise un modèle de language pour orchestrer les services OpenStack.

source: Stacks
fr: Piles

source: Stack actions
fr: Actions de pile.

source: Performs non-lifecycle operations on the stack. Specify the action in the request body.
fr: Exécute les opérations hors cycle de vie sur la pile. Spécifie l'action dans le corps de la requête.

source: Stack resources
fr: Ressources de pile

source: Stack events
fr: Evénements de pile

source: Templates
fr: Modèles

source: Build info
fr: Information de version

source: Software configuration
fr: Configuration du logiciel

source: Image Service API v2.0, API v2.1, and API v2.2.
fr: API du Service d'Images v2.0, API v2.1, et API v2.2

source: Image data
fr: Données d'image

source: Upload and download raw image data.
fr: Envoyer et télécharger des données brutes d'image.

source: Image tags
fr: Etiquettes d'image

source: Add and delete image tags.
fr: Ajoute et supprime des étiquettes d'image.

source: Image schemas
fr: Schémas d'images

source: Get a JSON-schema document that represents an images or image entity.
fr: Obtient un document schéma-JSON qui représente une image ou une entité d'image.

source: Database instances (instances)
fr: Instances de base de données (instances)

source: Database instance actions (action)
fr: Actions d'instance de base de données (action)

source: Databases (databases)
fr: Bases de données (databases)

source: Users (users)
fr: Utilisateurs (users)

source: Flavors (flavors)
fr: Types d'instance (flavors)

source: Manage tokens.
fr: Gestion des jetons.

source: Service catalog
fr: Catalogue de services

source: Manage the catalog of services.
fr: Gestion du catalogue de services.

source: Endpoints
fr: Points de terminaison

source: Manage endpoints.
fr: Gestion des points de terminaison.

source: Domains
fr: Domaines

source: Manage domains.
fr: Gestion des domaines.

source: Domains represent collections of users, groups, and projects. Each is owned by exactly one domain. Users, however, can be associated with multiple projects by granting roles to the user on a project, including projects owned by other domains.
fr: Les domaines représentent des collections d'utilisateurs, de groupes, et de projets. Chacun d'entre eux est possédé par exactement un domaine. Les utilisateurs, cependant, peuvent être associés avec des projets multiples en accordant des rôles à un utilisateur sur un projet, incluant les projets possédés par d'autres domaines.

source: Each domain defines a namespace where certain API-visible name attributes exist, which affects whether those names must be globally unique or unique within that domain. In the Identity API, the uniqueness of the following attributes is as follows:
fr: Chaque domaine défini un espace de nommage où certains attributs de nom visibles de l'API existent, ce qui affecte le fait que ces noms doivent être globallement uniques ou uniques à l'intérieur de ce domaine. Dans l'API de Gestion des Identités, la caractère unique des attributs suivants est représenté comme suit:

source: <emphasis role="italic">Domain Name</emphasis>. Globally unique across all domains.
fr: <emphasis role="italic">Nom de Domain</emphasis>. Globallement unique à travers tous les domaines.

source: <emphasis role="italic">Role Name</emphasis>. Globally unique across all domains.
fr: <emphasis role="italic">Nom de Rôle</emphasis>. Globallement unique à travers tous les domaines.

source: <emphasis role="italic">User Name</emphasis>. Unique within the owning domain.
fr: <emphasis role="italic">Nom d'Utilisateur</emphasis>. Unique à l'intérieur du domaine dont il est issu.

source: <emphasis role="italic">Project Name</emphasis>. Unique within the owning domain.
fr: <emphasis role="italic">Nom de Projet</emphasis>. Unique à l'intérieur du domaine dont il est issu.

source: <emphasis role="italic">Group Name</emphasis>. Unique within the owning domain.
fr: <emphasis role="italic">Nom de Groupe</emphasis>. Unique à l'intérieur du domaine dont il est issu.

source: Projects
fr: Projets

source: Manage projects.
fr: Gestion des projets.

source: Manage users.
fr: Gestion des utilisateurs.

source: Groups
fr: Groupes

source: Manage groups.
fr: Gestion des groupes.

source: Credentials
fr: Information d'Authentification

source: Manage credentials.
fr: Gestion des informations d'authentification.

source: Roles
fr: Rôles

source: Manage roles.
fr: Gestion des rôles.

source: Policies
fr: Politiques

source: Manage policies.
fr: Gestion des polices.

source: Manage the accounts, containers, and objects in the Object Storage system.
fr: Gestion des comptes, conteneurs, et objets dans le système de Stockage des Objets.

source: To run the cURL command examples for these requests, set these environment variables:
fr: Pour exécuter les exemples de commande cURL pour ces requêtes, configurer ces variables d'environnement:

source: <code>publicURL</code>. The public URL that is the HTTP endpoint from where you can access Object Storage. It includes the Object Storage API version number and your account name. For example, <code>https://23.253.72.207/v1/my_account</code>.
fr: <code>publicURL</code>. l'URL publique est le point de terminaison HTTP à partir duquel vous pouvez acéder le Stockage d'Objets. Il inclut le numéro de version de l'API de Stockage d'Objets et votre nom de compte. Par exemple, <code>https://23.253.72.207/v1/my_account</code>.

source: <code>token</code>. The authentication token for Object Storage.
fr: <code>token</code>. Le jeton d'authentification pour le Stockage d'Objet.

source: To obtain these values, run the <placeholder-1/> command.
fr: Pour obtenir ces valeurs, exécutez la commande <placeholder-1/>.

source: As shown in this example, the public URL appears in the <code>StorageURL</code> field, and the token appears in the <code>Auth Token</code> field:
fr: Comme montré dans cet exemple, l'URL publique apparaît dans le champ <code>StorageURL</code>, et le jeton apparaît dans le champ <code>Auth Token</code>:

source: For a complete description of HTTP 1.1 header definitions, see <link href="http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html#sec14">Header Field Definitions</link>.
fr: Pour une description complète des définitions des headers HTTP 1.1, reportez-vous à la documentation <link href="http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html#sec14">Définitions des Champs de Header</link>.

source: Accounts
fr: Comptes

source: List containers for a specified account. Create, update, show, and delete account metadata.
fr: Liste les conteneurs pour un compte spécifié. Crée, modifie, affiche, et supprime les métadonnées de compte.

source: Containers
fr: Conteneurs

source: List objects in a specified container. Create, show details for, and delete containers. Create, update, show, and delete container metadata.
fr: Liste les objets dans un conteneur spécifié. Crée, affiche les ifnormations, et supprime les conteneurs. Crée, modifie, montre, et supprime les métadonnées de conteneur.

source: Objects
fr: Objets

source: Create, replace, show details for, and delete objects. Copy objects from another object with a new or different name. Update object metadata.
fr: Crée, remplace, montre les informations, et supprime les objets. Copie les objets à partir d'un autre objet avec un nouveau nom ou un nom différent. Met à jour les métadonnées d'objet.

source: Alarms
fr: Alarmes

source: Meters
fr: Mètres

source: Get information for meters.
fr: Obtient les informations des métriques.

source: Resources
fr: Ressources

source: Get information for resources.
fr: Obtenir les informations pour les resources.

source: OS-OAUTH1 extension
fr: Extension OS-OAUTH1

source: Enable users to delegate roles to third-party consumers through the <link href="http://oauth.net/core/1.0a/">OAuth 1.0a specification</link>.
fr: Permet aux utilisateurs de déléguer les rôles à des consommateurs tierce-partie au moyen de la <link href="http://oauth.net/core/1.0a/">spécification OAuth 1.0a</link>.

source: A user is an Identity API user who delegates its roles and who authorizes request tokens. A consumer is a third-party application that uses OAuth to access a protected resource. An OAuth-derived token enables admin users to act on behalf of the authorizing user. A request token is a token that the consumer uses to get authorization from the user and exchanges with an OAuth verifier for an access token. The OAuth verifier is a required string that is provided with the corresponding request token in exchange for an access token. An access token is a token that the consumer uses to request Identity API tokens on behalf of the authorizing user instead of using the credentials for the user.
fr: Un utilisateur est un utilisateur de l'API de Gestion des Identités qui délègue ses rôles et qui authorise les jetons de requête. un consommateur est une application tierce-partie qui utilise OAuth pour accéder à une ressource protégée. Un jeton dérivé OAuth permet aux utilisateurs administrateurs de se faire passer pour un utilisateur l'ayant autorisé. Un jeton de requête est un jeton que le consommateur utilise pour obtenir une autorisation de l'utilisateur et les échanges avec un vérificateur OAuth pour un jeton d'accès. Le vérificateur OAuth est une chaine de caractères requise qui est fournie avec le jeton de requête correspondant en échange d'un jeton d'accès. un jeton d'accès est un jeton que le consommateur utilise pour demander des jetons de l'API de Gestion des Identités de la part d'un utilisateur l'ayant autorisé au lieu d'utiliser les informations d'authentification pour l'utilisateur.

source: Request and access tokens use token keys to identify themselves. For OpenStack purposes, the token key is the token ID. The consumer uses a token secret to establish ownership of a specified token. Both request and access tokens have token secrets.
fr: Les jetons de requête et d'accès utilisent des jetons de clés pour s'identifier eux-même. Dans le but d'OpenStack, le jeton de clé est le jeton d'ID. Le consommateur utilise un secret de jeton afin d'établir la propriété d'un jeton spécifié. A la fois les jetons de requête et d'accès ont des secrets de jeton.

source: Delegated authentication through OAuth occurs as follows:
fr: La délégation de l'authentification à travers OAuth est réalisée comme suit:

source: A user creates a consumer.
fr: Un utilisateur crée un consommateur.

source: The consumer gets an unauthorized request token. Then, the consumer uses the request token to initiate user authorization.
fr: Le consommateur obtient un jeton de requête non autorisé. Ensuite, le consommateur utilise le jeton de requête pour initier l'autorisation de l'utilisateur.

source: The user authorizes the request token.
fr: L'utilisateur autorise le jeton de requête.

source: The consumer exchanges the authorized request token and the OAuth verifier for an access token.
fr: Le consommateur échange le jeton de requête autorisé et le vérificateur OAuth pour un jeton d'accès.

source: The authorizing user receives the request token key from the consumer out-of-band.
fr: L'utilisateur l'ayant autorisé reçoit la clé du jeton de requête du consommateur hors bande.

source: The consumer uses the access token to request an Identity API token.
fr: Le consommateur utilise le jeton d'accès pour demander un jeton de l'API de Gestion des Identités.

source: translator-credits
fr: Olivier Buisson <olivier@obn.me>, 2012
