Repository: AsherBond/api-site
Catalog: api-ref/locale/*.po
Languages: fr

source: List available Networking API v2.0 extensions and show details for a specified extension.
fr: Liste les extensions de l'API de gestion de Réseau v2.0 et indique les informations détaillées d'une extension spécifique.

source: Quotas extension (quotas)
fr: Extension de gestion des Quotas (quotas)

source: List, show information for, update, and reset quotas.
fr: Liste, affiche des informations, met à jour, et réinitialise les quotas.

source: Networks provider extended attributes (networks)
fr: Attibuts étendus de fournisseur de réseaux (réseaux)

source: List, create, show information for, update, and delete networks.
fr: Liste, crée, affiche les informations, met à jour, et supprime les réseaux.

source: Networks multiple provider extension (networks)
fr: Extension de fournisseur de réseaux multiple (réseaux)

source: Enables administrative users to define multiple physical bindings for an OpenStack Networking network and list or show details for networks with multiple physical bindings.
fr: Permet aux utilisateurs administrateurs de définir des liaisons physiques pour un réseau OpenStack Networking et liste ou montre les détails des réseaux avec de multiples liaisons physiques.

source: You cannot update any <literal>provider</literal> attributes. If you try to do so, an error occurs.
fr: Vous ne pouvez modifier aucun des attributs de <literal>fournisseur</literal>. Si vous essayez de le faire, une erreur sera provoquée.

source: To delete a network with multiple physical bindings, issue a normal delete network request.
fr: Pour supprimer un réseau avec des liaisons physiques multiples, utilisez une demande de suppression de réseau normale.

source: To define multiple physical bindings for a network, include a <literal>segments</literal> list in the request body of a <code>POST /v2.0/networks</code> request. Each element in the <literal>segments</literal> list has the same structure as the provider network attributes. These attributes are <literal>provider:network_type</literal>, <literal>provider:physical_network</literal>, and <literal>provider:segmentation_id</literal>. The validation rules for these attributes are the same as for the <link href="http://developer.openstack.org/api-ref-networking-v2.html#network_provider-ext">Networks provider extended attributes</link>. You cannot use both extensions at the same time.
fr: Pour définir de multiples connexions physiques pour un réseau, inclure une liste <literal>segments</literal> dans le corps de la requête <code>POST /v2.0/networks</code>.Chaque élément dans la liste <literal>segments</literal> a la même structure que les attributs du réseau fournisseur. Ces attributs sont <literal>provider:network_type</literal>, <literal>provider:physical_network</literal>, et <literal>provider:segmentation_id</literal>. Les règles de validation pour ces attributs sont les mêmes que pour <link href="http://developer.openstack.org/api-ref-networking-v2.html#network_provider-ext">Networks provider extended attributes</link>. Vous ne pouvez pas utiliser les deux extensions en même temps..

source: The NSX and ML2 plug-ins support this extension. With the ML2 plug-in, you can specify multiple VLANs for a specified network, a VXLAN tunnel ID, and a VLAN.
fr: Les plugins NSX et ML2 supportent cette extension. Avec le plugin ML2, vous pouvez spécifier de multiples VLANs pour un réseau donné, un ID de tunnel VXLAN, et un VLAN.

source: Ports binding extended attributes (ports)
fr: Attributs étendus de liaison de ports (ports)

source: List, create, show information for, and update ports.
fr: Liste, crée, affiche les informations, et met à jour les ports.

source: Security groups and rules (security-groups)
fr: Groupes et règles de sécurité (security-groups)

source: List, create, show information for, and delete security groups and security group rules.
fr: Liste, crée, affiche les informations, et supprime les groupes de sécurité et les les règles des groupes de sécurité.

source: Layer-3 networking
fr: Gestion de réseau: couche 3 du modèle OSI

source: Route packets between subnets, forward packets from internal networks to external ones, and access instances from external networks through floating IPs.
fr: Effectue le routage des paquets entre les sous-réseaux, transfère les paquets des réseaux internes aux réseaux externes, et accède aux instances à partir des réseaux externes au moyen d'addresses IP flottantes.

source: This extension introduces these resources:
fr: Cette extension introduit ces ressources:

source: <emphasis role="bold">router</emphasis>. A logical entity for forwarding packets across internal subnets and NATting them on external networks through an appropriate external gateway.
fr: <emphasis role="bold">router</emphasis>. Une entité logique permettant de transférer les paquets entre les sous-réseaux internes, et de les NATter sur les réseaux externes au moyen d'une passerelle externe appropriée.

source: <emphasis role="bold">floatingip</emphasis>. An external IP address that is mapped to a port that is attached to an internal network.
fr: <emphasis role="bold">floatingip</emphasis>. Une addresse IP externe qui est mappée sur un port, lui-même attaché à un réseau interne.

source: Metering labels and rules
fr: Libellés et règles de comptage

source: Create, modify, and delete OpenStack Layer3 Metering labels and rules.
fr: Créer, modifier, et supprimer des libellés et des règles de comptage OpenStack Layer3

source: The LBaaS version 1.0 extension pairs with the Networking 2.0 API to enable OpenStack tenants to manage load balancers for their VMs. With this extension you can load-balance client traffic from one network to application services, such as VMs, on the same network.
fr: L'extension LBaaS version 1.0 se couple avec l'API Networking 2.0 permettant les projets OpenStack de gérer les équilibreurs de charge pour leurs VM. Avec cette extension vous pouvez gérer la charge du trafic client d'un réseau vers les services d'application, comme les VM, sur un même réseau.

source: Use this extension to create and manage virtual IP addresses (VIPs), pools, members of a pool, health monitors associated with a pool, and view status of a resource.
fr: Utiliser cette extension pour créer et gérer des adresses IP virtuelles (VIPs), pools, membres de pool, moniteurs de suivi associés à un pool et voir le status d'une ressource.

source: Load balancer statuses
fr: Etats des load-balancers

source: Status
fr: Statut

source: Resource is ready and active.
fr: La ressource est prête et active.

source: Resource is being created.
fr: La ressource est en train d'être créée.

source: Resource is being updated.
fr: La ressource est en train d'être mise à jour.

source: Resource is going to be deleted.
fr: La ressource va être supprimer.

source: Resource is created but not active.
fr: La ressource est crée mais n'est pas active.

source: Object within the service is not working. Look for an extra attribute called <placeholder-1/> for a textual explanation on the error, its cause, and possibly a solution.
fr: L'objet à l'intérieur du service de fonctionne pas. Chercher un attribut supplémentaire appelé <placeholder-1/> pour une explication complète de l'erreur, sa cause et probablement sa solution..

source: Get an authentication token that permits access to the Compute API.
fr: Obtenir un jeton d'authentification permettant l'accès à l'API de Calcul.

source: Tokens
fr: Jetons

source: Users
fr: Utilisateurs

source: Tenants
fr: Clients

source: OpenStack API Complete Reference
fr: Référence Complète de l'API OpenStack

source: Use the OpenStack APIs and extensions to launch server instances, create images, assign metadata to instances and images, create containers and objects, and complete other actions in your OpenStack cloud.
fr: Utilisez les autres APIs et extensions pour démarrer des instances de serveur, créer des images, assigner des métadonnées aux instances et images, créer des conteneurs et des objets, et mener à bien d'autres actions dans votre cloud OpenStack.

source: The API <emphasis role="bold">status</emphasis> reflects the state of the endpoint on the service. <emphasis role="bold">CURRENT</emphasis> is a stable version that is up-to-date, recent, and might receive future versions. This endpoint should be prioritized over all others. <emphasis role="bold">SUPPORTED</emphasis> is a stable version that is available on the server. However, it is not likely the most recent available and might not be updated or might be deprecated at some time in the future. <emphasis role="bold">DEPRECATED</emphasis> is a stable version that is still available but is being deprecated and might be removed in the future. <emphasis role="bold">EXPERIMENTAL</emphasis> is not a stable version. This version is under development or contains features that are otherwise subject to change. For more information about API <emphasis role="bold">status</emphasis> values and version information, see <link href="https://wiki.openstack.org/wiki/VersionDiscovery">Version Discovery</link>.
fr: L'API <emphasis role="bold">status</emphasis> reflète l'état d'aboutissement du service. <emphasis role="bold">ACTUEL</emphasis> est une version stable qui est à jour, récente, et qui pourrait bénéficier de futures versions. Cette version aboutie devrait être prioritaire par rapport à toutes les autres. <emphasis role="bold">SUPPORTÉ</emphasis> est une version stable qui est disponible sur le serveur. Cependant, ce n'est pas forcément la versions la plus récente disponible et elle pourrait ne pas être mise à jour ou elle pourrait être abandonnée relativement rapidement. <emphasis role="bold">ABANDONNÉ</emphasis> est une version stable qui est toujours disponible mais qui est abandonnée et qui pourrait être supprimée dans le futur. <emphasis role="bold">EXPÉRIMENTAL</emphasis> n'est pas une version stable. Cette version est en cours de développement ou contient des fonctionnalités qui peuvent être sujettes à modification. Pour obtenir plus d'informations sur les paramètres de l'API <emphasis role="bold">status</emphasis> et les informations de version, reportez-vous à la documentation <link href="https://wiki.openstack.org/wiki/VersionDiscovery">Découverte des Versions</link>.

source: You must install the packages for each API separately. You can use the APIs and extensions after you authenticate through the <link href="api-ref-identity.html">Identity API</link>:
fr: Vous devez installer les packages de chaque API séparément. Vous pouvez utiliser les APIs et extensions après vous être authentifié par l'intermédiaire de <link href="api-ref-identity.html">l'API de Gestion des Identités</link>:

source: To get started with the APIs, see the <link href="http://docs.openstack.org/api/quick-start/content/">OpenStack API Quick Start</link>.
fr: Pour débuter avec les APIs, reportez-vous à la documentation <link href="http://docs.openstack.org/api/quick-start/content/">API d'OpenStack: démarrage rapide</link>.

source: Image Service API v1 (SUPPORTED)
fr: API du Service d'Image v1 (SUPPORTÉ)

source: Load images for use at launch time by the Compute API. Also, assign metadata to images.
fr: Charge les images à utiliser lors du démarrage par l'intermédiaire de l'API de Calcul. De plus, assigne les métadonnées aux images.

source: Some cloud implementations do not expose this API and offer pretested images only.
fr: Quelques implémentations de cloud n'exposent pas cette API et offrent des images pré-testées seulement.

source: Cloud providers can configure property protections that prevent non-administrative users from updating and deleting protected properties. For more information, see <link href="http://docs.openstack.org/admin-guide-cloud/content/glance-property-protection.html">Image property protection</link> in the <citetitle>OpenStack Cloud Administrator Guide</citetitle>.
fr: Les fournisseurs du cloud peuvent configurer des propriétés de protection qui éviteront que des utilisateurs non administrateurs ne modifient ou n'effacent des propriétés protégées. Pour plus d'informations, reportez-vous à la section <link href="http://docs.openstack.org/admin-guide-cloud/content/glance-property-protection.html">Protection d'une propriété d'image</link> dans le <citetitle>Guide de l'Administrateur du Cloud OpenStack</citetitle>.

source: API versions
fr: Versions de l'API

source: Members
fr: Membres

source: Shared images
fr: Images partagées

source: Data sources
fr: Sources de données

source: Job binaries
fr: binaires de Tâche

source: Jobs
fr: Tâches

source: Job executions
fr: Exécution des tâches

source: Block Storage API v2 (CURRENT)
fr: API de Stockage par Bloc v2 (ACTUELLE)

source: Database Service API v1.0 (CURRENT)
fr: API de Service de Base de données v1.0 (ACTUELLE)

source: Networking API v2.0 (CURRENT)
fr: API de Gestion Réseau v2.0 (ACTUELLE)

source: Object Storage API v1 (SUPPORTED)
fr: API de Stockage d'Objet v1 (SUPPORTÉ)

source: Orchestration API v1 (CURRENT)
fr: API d'Orchestration v1 (ACTUELLE)

source: Telemetry API v2 (CURRENT)
fr: API de Télémétrie v2 (ACTUELLE)

source: OpenStack API Reference
fr: Références des APIs Openstack

source: Extensions add features, MIME types, actions, states, headers, parameters, and resources to the core Compute API without requiring a version change.
fr: Les extensions ajoutent des fonctionnalités, types MIME, actions, états, en-têtes, paramètres et ressources au coeur de l'API de Calcul sans requérir un changement de version.

source: XML support in requests and responses has been deprecated for the Compute API v2.
fr: Le support d'XML dans les requêtes et les réponses a été abandonné pour l'API de Calcul v2.

source: Server admin actions (action)
fr: Actions de l'administrateur du serveur (action)

source: Administrator only. Perform actions on a server. Specify the action in the request body.
fr: Pour Administrateur seulement. Effectue des actions sur un serveur. Spécifiez l'action dans le corps de la requête.

source: Server diagnostics (diagnostics)
fr: Diagnostics de serveur (diagnostics)

source: Get the usage data for a server.
fr: Obtenir les statistiques d'utilisation d'un serveur.

source: Flavor access (flavors)
fr: Accès aux instances (flavors)

source: Create and get details for private flavors. Also, list, add, and remove tenants' access to private flavors.
fr: Créez et obtenez les détails des types d'instances privés. En plus, listez, ajoutez, et enlevez l'accès des clients aux types d'instances privés.

source: Flavors with FlavorDisabled attribute (flavors)
fr: Instances avec l'attribut FlavorDisabled (flavors)

source: Get details for a flavor, and list details for available flavors. Includes the <literal>OS-FLV-DISABLED:disabled</literal> extended attribute.
fr: Obtenir les informations concernant une instance, et lister les détails des instances disponibles. Inclut l'attribut étendu <literal>OS-FLV-DISABLED:disabled</literal>.

source: Flavor extra-specs (os-extra-specs)
fr: Spécifications supplémentaires d'instance (os-extra-specs)

source: List, create, and update the extra-specs or keys for a flavor.
fr: Liste, crée, et modifie les spécifications supplémentaires ou clés d'une instance.

source: Flavors with rxtx_factor extended attribute (flavors)
fr: Instances avec l'attribut étendu rxtx_factor (flavors)

source: Create, get details for, and list details for flavors. Includes the <literal>rxtx_factor</literal> extended attribute, related to configured bandwidth cap values.
fr: Crée, obtient et liste les informations des instances. Inclut l'attribut étendu <literal>rxtx_factor</literal>, qui est en relation avec les valeurs butoires de bande passante configurées.

source: Flavors with extended attributes (flavors)
fr: Instances avec des attributs étendus (flavors)

source: Create, get details for, and list details for flavors. Includes the <literal>rxtx_factor</literal>, <literal>OS-FLV-EXT-DATA:ephemeral</literal>, and <literal>swap</literal> extended attributes.
fr: Crée, obtient et liste les informations des instances. Inclut les attributs étendus <literal>rxtx_factor</literal>, <literal>OS-FLV-EXT-DATA:ephemeral</literal>, et <literal>swap</literal>.

source: Flavors create or delete (flavors)
fr: Création et suppression d'instances (flavors)

source: Create or delete flavors.
fr: Créer ou supprimer des types d'instances.

source: Images with size attribute (images)
fr: Images avec l'attribut de taille (images)

source: List details for available images or get details for a specified image. Includes the <code>OS-EXT-IMG-SIZE:size</code> extended attribute, which shows the image size.
fr: Liste les informations sur les images disponibles ou obtient les informations pour une image spécifique. Inclut l'attribut étendu <code>OS-EXT-IMG-SIZE:size</code>, qui montre la taille de l'image.

source: Limits with project usage (limits)
fr: Limites avec l'utilisation du projet (limits)

source: Extend limits to show the project usage. Show information such as RAM or instance quotas usage.
fr: Etend les limites pour montrer l'utilisation du projet. Affiche des informations comme la RAM ou l'utilisation des quotas de l'instance.

source: Limits with project usage for administrators (limits)
fr: Limites avec l'utilisation du projet pour les administrateurs (limits)

source: Extend limits to enable administrators to show the project usage for a specified customer project ID. Show information such as RAM or instance quotas usage.
fr: Etend les limites de façon à permettre aux administrateurs d'afficher l'utilisation du projet pour un ID de projet client spécifié. Affiche des informations comme la RAM ou l'utilisation des quotas de l'instance.

source: Guest agents (os-agents)
fr: Agents invités (os-agents)

source: Create, update, and delete guest agents. Use guest agents to access files on the disk, configure networking, or run other applications or scripts in the guest while it runs. This hypervisor-specific extension is not currently enabled for KVM. Use of guest agents is possible only if the underlying service provider uses the Xen driver.
fr: Crée, modifie, et supprime des agents invités. Utilisez les agents invités pour accéder aux fichiers du disque, configurer le réseau, ou exécuter d'autres applications ou scripts dans l'invité pendant qu'il est exécuté. Cette extension hyperviseur spécifique n'est pas actuellement active pour KVM. L'utilisation des agents invités est possible seulement si le fournisseur de service sous-jacent utilise le driver Xen.

source: Host aggregates (os-aggregates)
fr: Agrégats hôtes (os-aggregates)

source: Create and manage host aggregates. An aggregate assigns metadata to groups of compute nodes. Aggregates are only visible to the cloud provider.
fr: Crée et gère les agrégats hôtes. Un agrégat assigne des métadonnées à des groupes de noeuds de calcul. Les agrégats sont visibles seulement au fournisseur du cloud.

source: Attach interfaces (os-interface)
fr: Attacher des interfaces (os-interface)

source: Create, list, get details for, and delete port interfaces.
fr: Crée, liste, obtient des informations, et supprime les interfaces de port.

source: Root certificates (os-certificates)
fr: Certificats racines (os-certificates)

source: Create and show details for a root certificate.
fr: Crée et montre les informations d'un certificat racine.

source: Manage virtual VPNs for projects.
fr: Gère les VPNs virtuels des projets.

source: Server console output (os-console-output)
fr: Résultat de la console du serveur (os-console-output)

source: Get console output for a server instance.
fr: Obtenir la sortie de la console pour une instance de serveur.

source: Server console (os-consoles)
fr: Console du serveur (os-consoles)

source: Get a console for a server instance.
fr: Obtenir une console pour une instance de serveur.

source: Coverage reports (os-coverage)
fr: Rapports de couverture (os-coverage)

source: Server deferred delete (os-deferred-delete)
fr: Suppression différée de serveur (os-deferred-delete)

source: Force-delete a server or restore a deleted server.
fr: Forcer la suppression d'un serveur ou restaurer un serveur supprimé.

source: Fixed IPs (os-fixed-ips)
fr: IPs fixes (os-fixed-ips)

source: Show data for a specified fixed IP, such as host name, CIDR, and address. Also, reserve or free a fixed IP.
fr: Affiche les informations d'une adresse IP fixe, comme le nom d'hôte, le CIDR, et l'adresse. De plus, réserve ou libère une adresse IP fixe.

source: Floating IP DNS records (os-floating-ip-dns)
fr: Enregistrements DNS d'adresse IP flottante (os-floating-ip-dns)

source: Manage DNS records associated with IP addresses allocated by the floating IPs extension. Requests are dispatched to a DNS driver selected at startup.
fr: Gère les enregistrements DNS associés avec les adresses IP allouées par l'extension d'adresses IP flottantes. Les requêtes sont distribuées à un driver DNS sélectionné lors du démarrage.

source: Floating IP pools (os-floating-ip-pools)
fr: Espaces d'adresses IP flottantes (os-floating-ip-pools)

source: Manage groups of floating IPs.
fr: Gérer les groupes d'adresses IP flottantes.

source: Floating IPs (os-floating-ips)
fr: Adresses IP flottantes (os-floating-ips)

source: Assign and allocate floating IP addresses to instances that run in an OpenStack cloud.
fr: Assigner et allouer des adresses IP flottantes aux instances qui fonctionnent dans un cloud OpenStack.

source: Floating IPs bulk (os-floating-ips-bulk)
fr: Adresses IP flottantes en masse (os-floating-ips-bulk)

source: Bulk-create, delete, and list floating IPs. By default, the pool is named nova. Use the <literal>os-floating-ip-pools</literal> extension to view available pools.
fr: Crée, supprime, et liste des adresses IP flottantes en masse. Par défaut, l'espace est nommé nova. Utilisez l'extension <literal>os-floating-ip-pools</literal> pour voir les jeux disponibles.

source: Hosts (os-hosts)
fr: Hôtes (os-hosts)

source: Manage physical hosts.
fr: Gérez les hôtes physiques.

source: Hypervisors (os-hypervisors)
fr: Hyperviseurs (os-hypervisors)

source: Display extra statistical information from the machine that hosts the hypervisor through the API for the hypervisor (XenAPI or KVM/libvirt).
fr: Affiche des informations statistiques additionnelles à partir de la machine qui héberge l'hyperviseur, au moyen de l'API pour l'hyperviseur (XenAPI ou KVM/libvirt).

source: Server actions (os-instance-actions)
fr: Actions du serveur (os-instance-actions)

source: List available actions for a specified server. Administrators can get details for a specified action for a specified server.
fr: Liste les actions disponibles pour un serveur spécifié. Les administrateurs peuvent obtenir des informations pour une action spécifiée, pour un serveur spécifié.

source: Keypairs (os-keypairs)
fr: Paires de clés (os-keypairs)

source: Generate, import, and delete SSH keys.
fr: Génère, importe, et supprime des clés SSH.

source: Administrators only. Fetch in-progress migrations for a region or a specified cell in a region.
fr: Pour Administrateurs seulement. Va chercher les migrations en cours pour une région ou une cellule d'une région spécifiée.

source: Networks (os-networks)
fr: Réseaux (os-networks)

source: Show network information for or delete networks. Also, disassociate a network from a project if you use vlan mode.
fr: Affiche les informations de réseau pour les réseaux ou supprime des réseaux. De plus, casse le lien d'un réseau avec un projet si le mode vlan est utilisé.

source: Quota class (os-quota-class-sets)
fr: Classe de quota (os-quota-class-sets)

source: Quota classes management support.
fr: Support de la gestion des classes de quota.

source: Quota sets (os-quota-sets)
fr: Jeux de quotas (os-quota-sets)
