Repository: AsherBond/api-site
Catalog: api-ref/locale/*.po
Languages: fr

source: Administrators only, depending on policy settings. View quotas for a tenant and view and update default quotas.
fr: Pour Administrateurs seulement, en fonction des réglages de la police. Permet de voir les quotas pour un client et permet de voir ou de modifier les quotas par défaut.

source: Rules for default security group (os-security-group-default-rules)
fr: Règles pour le groupe de sécurité par défaut (os-security-group-default-rules)

source: List, show information for, and create default security group rules.
fr: Liste, montre les informations, et crée les règles du groupe de sécurité par défaut.

source: Security groups (os-security-groups)
fr: Groupes de sécutiré (os-security-groups)

source: List, show information for, create, and delete security groups.
fr: Liste, montre les informations, crée, et supprime les groupes de sécurité.

source: Server groups (os-server-groups)
fr: Groupes de serveur (os-server-groups)

source: List, show information for, create, and delete server groups.
fr: Liste, montre les informations, crée, et supprime les groupes de serveur.

source: Server password (os-server-password)
fr: Mot de passe du serveur (os-server-password)

source: Get and reset the encrypted administrative password set through the metadata service.
fr: Obtient et réinitialise le mot de passe crypté administratif configuré au moyen du service de métadonnées.

source: Server shelve (servers)
fr: Mise en sommeil du serveur (servers)

source: Shelve running servers, restore shelved servers, and remove shelved servers.
fr: Mettre en sommeil des serveurs en fonctionnement, réveiller des serveurs en veille, et enlever des serveurs en veille.

source: Shelving is useful when you have an instance that you are not using but would like retain in your list of servers. For example, you can stop an instance at the end of a work week and resume work at the start of the next week. Use the <code>shelve</code> action to shelve a server. All associated data and resources are kept; however, anything still in memory is not retained. You can restore a shelved instance by using the <code>unshelve</code> action. If a shelved instance is no longer needed, you can remove it by using the <code>shelveOffload</code> action.
fr: Mettre en sommeil est utile lorsque vous avez une instance que vou sn'utilisez pas, mais que vous souhaitez la conserver dans votre liste de serveurs. Par exemple, vous pouvez arrêter une instanceà la fin d'une semaine de travail, et la réveiller lorsque la semaine suivante commence. Utilisez l'action <code>suspendre</code> pour mettre un serveur en sommeil. Toutes les données et ressources associées sont conservées; cependant, tout ce qui est toujours en mémoire ne l'est pas. Vous pouvez réveiller une instance suspendue en utilisant l'action <code>réveiller</code>. Si une instance suspendue n'est plus nécessaire, vous pouvez l'enlever en utilisant l'action <code>suspendre et décharger</code>.

source: Server start and stop (servers)
fr: Démarrage et arrêt du serveur (servers)

source: Start a stopped server or stop a running server.
fr: Démarrer un serveur arrêté ou stopper un serveur en fonctionnement.

source: Manage services (os-services)
fr: Gérer les services (os-services)

source: List, enable, and disable Compute services in all hosts.
fr: Liste, active, et désactive les services Calcul dans tous les hôtes.

source: Usage reports (os-simple-tenant-usage)
fr: Rapports d'utilisation (os-simple-tenant-usage)

source: Report usage statistics on compute and storage resources.
fr: Rapporter les statistiques d'utilisation des ressources de stockage et de calcul.

source: Virtual interfaces (os-virtual-interfaces)
fr: Interfaces virtuelles (os-virtual-interfaces)

source: List the virtual interfaces for a specified server instance.
fr: Liste les interfaces virtuelles pour une instance de serveur spécifiée.

source: Volume extension (os-volumes, os-snapshots)
fr: Extension Volume (os-volumes, os-snapshots)

source: Manage volumes and snapshots for use with the Compute API.
fr: Gestion des volumes et des snapshots à utiliser avec l'API de Calcul.

source: Volume attachments (os-volume_attachments)
fr: Distribution des volumes (os-volume_attachments)

source: Attach volumes created through the volume API to server instances. Also, list volume attachments for a server instance, get volume details for a volume attachment, and delete a volume attachment.
fr: Attache les volumes créés au moyen de l'API Volume aux instances de serveur. De plus, liste les volumes attachés pour une instance de serveur, obtient les informations pour un volume attaché, et détache un volume.

source: Servers with block device mapping format (servers)
fr: Serveurs avec un format périphérique en mode bloc mappé (servers)

source: Create a server with a block device mapping.
fr: Créer un serveur avec un périphérique de bloc mappé.

source: Server OS-EXT-IPS-MAC:mac_addr extended attribute (servers)
fr: Attribut étendu de serveur OS-EXT-IPS-MAC:mac_addr (servers)

source: Add OS-EXT-IPS-MAC:mac_addr extended attribute when you create, show information for, or list servers.
fr: Ajoute l'attribut étendu OS-EXT-IPS-MAC:mac_addr lorsque vous créez, affichez les informations, ou listez les serveurs.

source: Configuration drive (servers)
fr: Lecteur de configuration (servers)

source: Extend servers and images with a configuration drive.
fr: Etendre les serveurs et images avec un lecteur de configuration.

source: Servers with extended availability zones (servers)
fr: Serveurs avec zones de disponibilité étendues (servers)

source: Show the instance availability zone for compute nodes (nova-compute). Internal services appear in their own <emphasis role="italic">internal</emphasis> availability zone.
fr: Affiche la zone de disponibilité d'instance pour les noeuds de calcul (nova-compute). Les services internes apparaissent dans leur propre zone de disponiblité <emphasis role="italic">interne</emphasis>.

source: Servers and images with disk config (servers, images)
fr: Serveurs et images avec configuration disque (servers, images)

source: Extend servers with the diskConfig attribute.
fr: Etendre les serveurs avec l'attribut diskConfig.

source: Server IP type (servers)
fr: Type d'adresse IP de serveur (servers)

source: Show the type of the IP addresses assigned to an instance. Type is either fixed or floating.
fr: Affiche le type des adresses IP assignées à une instance. Le type est soit fixe soit flottant.

source: Server extended attributes (servers)
fr: Attributs étendus de serveur (servers)

source: Show metadata for servers.
fr: Affiche les métadonnées des serveurs.

source: Server extended status (servers)
fr: Status étendu de serveur (servers)

source: Show extended status information, vm_state, task_state, and power_state, in detailed server responses.
fr: Affiche les informations de status étendues, vm_state, task_state, et power_state, dans les réponses détaillées du serveur.

source: Servers multiple create (servers)
fr: Création multiple de serveurs (servers)

source: Create one or more servers with an optional reservation ID. The request and response examples show how to create multiple servers with or without a reservation ID.
fr: Crée un ou plusieurs serveurs avec un ID de réservation optionnel. Les exemples de requêtes et de réponses montrent comment créer des serveurs multiples avec ou sans ID de réservation.

source: Server rescue and unrescue (servers)
fr: Faire entrer et sortir un serveur du mode rescue (servers)

source: Put a server into rescue mode or unrescue a server in rescue mode.
fr: Mettre un serveur en mode rescue ou sortir un serveur du mode rescue.

source: Servers with scheduler hints (servers)
fr: Serveurs avec conseils d'ordonnancement (servers)

source: Create a server with scheduler hints.
fr: Créer un serveur avec suggestions d'ordonnancement.

source: List information for all API versions.
fr: Liste les informations pour toutes les versions de l'API.

source: Server admin actions (servers)
fr: Actions de l'administration de serveur (servers)

source: Administrators only. Perform actions on a server. Specify the action in the request body.
fr: Pour administrateurs seulement. Exécute des actions sur un serveur. Spécifie l'action dans le corps de la requête.

source: Creates and manages host aggregates. An aggregate assigns metadata to groups of compute nodes. Aggregates are only visible to the cloud provider.
fr: Crée et gère les agrégats d'hôtes. Un agrégat assigne des métadonnées à des groupes de noeuds de calcul. Les agrégats sont seulement visibles au fournisseur du cloud.

source: Cells (os-cells)
fr: Cellules (os-cells)

source: Enables cells-related functionality such as adding neighbor cells, listing neighbor cells, and getting the capabilities of the local cell.
fr: Autorise les fonctionnalités relatives aux cellules comme l'ajout de cellules voisines, le listage des cellules voisines, et l'obtention des capacités de la cellule locale.

source: Creates and shows details for a root certificate.
fr: Crée et affiche les détails d'un certificat racine.

source: Configuration drive (os-config-drive)
fr: Lecteur de configuration (os-config-drive)

source: Returns server details for a specific service ID or user.
fr: Retourne les informations de serveur pour un ID de service spécifique ou un utilisateur.

source: Force-deletes a server or restores a deleted server.
fr: Force la suppression d'un serveur ou restaure un serveur supprimé.

source: Evacuate (os-evacuate)
fr: Evacuer (os-evacuate)

source: Enables server evacuation.
fr: Active l'évacuation du serveur.

source: Servers with extended availability zones (os-extended-availability-zone)
fr: Serveurs avec zones de disponibilité étendues (os-extended-availability-zone)

source: Shows the instance availability zone for compute nodes (nova-compute). Internal services appear in their own internal availability zone.
fr: Affiche la zone de disponibilité de l'instance pour les noeuds de calcul (nova-compute). Les services internes apparaissent dans leur propre zone de disponibilité.

source: Server extended attributes (os-extended-server-attributes)
fr: Attributs de serveur étendus (os-extended-server-attributes)

source: Shows metadata for servers.
fr: Affiche les métadonnées des serveurs.

source: Server extended status (os-extended-status)
fr: Status étendu de serveur (os-extended-status)

source: Shows extended status information, vm_state, task_state, and power_state, in detailed server responses.
fr: Affiche les information de status étendues, vm_state, task_state, et power_state, dans les réponses détaillées de serveur.

source: Flavor access support.
fr: Support de l'accès aux types d'instance.

source: Flavor extra-specs (flavor-extra-specs)
fr: Spécifications additionnelles de type d'instance (flavor-extra-specs)

source: Lists, creates, deletes, and updates the extra-specs or keys for a flavor.
fr: Liste, crée, supprime, et modifie les spécifications additionnelles ou clés pour un type d'instance.

source: Flavors manage (flavor-manage)
fr: Gestion des types d'instance (flavor-manage)

source: Support for creating and deleting flavor.
fr: Support pour la création et suppression du type d'instance.

source: Flavors with rxtx_factor extended attribute (os-flavor-rxtx)
fr: Types d'instance avec l'attribut étendu rxtx_factor (os-flavor-rxtx)

source: Support to show the rxtx status of a flavor.
fr: Support pour afficher le status rxtx d'un type d'instance.

source: Returns information about Flavors.
fr: Retourne des informations sur les types d'instances.

source: Manages physical hosts.
fr: Gère les hôtes physiques.

source: Displays extra statistical information from the machine that hosts the hypervisor through the API for the hypervisor (XenAPI or KVM/libvirt).
fr: Affiche des informations statistiques additionnelles à partir de la machine qui héberge l'hyperviseur au moyen de l'API pour l'hyperviseur (XenAPI ou KVM/libvirt).

source: Server actions (servers)
fr: Actions de serveur (servers)

source: Permits all users to list available actions for a specified server. Permits administrators to get details for a specified action for a specified server.
fr: Autorise les utilisateurs à lister les actions disponibles pour un serveur spécifié. Permet aux administrateurs d'obtenir les détails d'une action spécifiée pour un serveur spécifié.

source: Instance usage audit log (os-instance-usage-audit-log)
fr: Journal d'audit de l'utilisation de l'instance (os-instance-usage-audit-log)

source: Admin-only task log monitoring.
fr: Surveillance du journal de tâche de l'administrateur seulement.

source: Limits (limits)
fr: Limites (limits)

source: Provide all global and rate limit information.
fr: Donne toutes les informations de limite de débit et limite globale.

source: Provide data on migrations.
fr: Fournit des données sur les migrations.

source: Multiple network support.
fr: Support de réseau multiple.

source: Permits administrators, depending on policy settings, to view quotas for a tenant and view and update default quotas.
fr: Permet aux administrateurs, en fonction des réglages de la police, de voir les quotas pour un client et de voir et modifier les quotas par défaut.

source: Server remote console (os-remote-consoles)
fr: Console du serveur distant (os-remote-consoles)

source: Interactive console support.
fr: Support de la console interactive.

source: Server usage (os-server-usage)
fr: Utilisation du serveur (os-server-usage)

source: Adds launched_at and terminated_at to servers.
fr: Ajoute launched_at et terminated_at aux serveurs.

source: Provide simple tenant usage for tenant.
fr: Donne l'utilisation du client simple pour le client.

source: Launch virtual machines from images or images stored on persistent volumes. API v1.1 is identical to API v2.
fr: Démarrer des machines virtuelles à partir d'images ou d'images stockées sur des volumes persistents. l'API v1.1 est identique à l'API v2.

source: List information for all API versions and show details about API v2.
fr: Liste les informations pour toutes les versions de l'API et affiche les détails à propos de l'API v2.

source: Limits
fr: Limites

source: Get rate and absolute limits.
fr: Obtenir les limites de débit et absolue.

source: List available Compute API v2 extensions and show details for a specified extension.
fr: Liste les extensions de l'API de Calcul v2 disponibles et affiche les informations d'une extension spécifiée.

source: Servers
fr: Serveurs

source: List, create, get details for, update, and delete servers.
fr: Liste, crée, obtient les informations, modifie, et supprime les serveurs.

source: Passwords
fr: Mots de passe

source: When you create a server, you can specify a password through the optional <property>adminPass</property> attribute. The specified password must meet the complexity requirements set by your OpenStack Compute provider. The server might enter an <code>ERROR</code> state if the complexity requirements are not met. In this case, a client might issue a change password action to reset the server password.
fr: Lorsque vous créez un serveur, vous pouvez indiquer un mot de passe au moyen de l'attribut optionnel <property>adminPass</property>. Le mot de passe indiqué doit correspondre aux réglages de complexité donnés par votre fournisseur de Calcul OpenStack. Le serveur pourrait provoquer un état d'<code>ERREUR</code> si les critères de complexité ne sont pas remplis. Dans ce cas, un client peut éventuellement déclencher une action de changement de mot de passe pour réinitialiser le mot de passe du serveur.

source: If you do not specify a password, a randomly generated password is assigned and returned in the response object. This password is guaranteed to meet the security requirements set by the compute provider. For security reasons, the password is not returned in subsequent calls.
fr: Si vous n'indiquez pas de mot de passe, un mot de passe généré de façon aléatoire est configuré et retourné dans l'objet réponse. Ce mot de passe obéira aux règles de complexité réglés par le fournisseur de calcul. Pour des raisons de sécurité, le mot de passe n'est pas retourné dans les appels ultérieurs.

source: Server metadata
fr: Métadonnées de serveur

source: You can specify custom server metadata at server launch time. The maximum size for each metadata key-value pair is 255 bytes. The maximum number of key-value pairs that can be supplied per server is determined by the compute provider. You can query this value through the <code>maxServerMeta</code> absolute limit.
fr: Vous pouvez indiquer des métadonnées de serveur customisées au lancement de celui-ci. La taille maximale pour chaque clé-valeur de métadonnée est de 255 octets. Le nombre maximal de paires clé-valeur qui peuvent être fournies par serveur est déterminé par le fournisseur de calcul. Vous pouvez obtenir cette valeur au moyen de la limite absolue <code>maxServerMeta</code>.

source: Server networks
fr: Réseaux du serveur

source: You can specify networks to which the server connects at launch time. You can specify one or more networks. Users can also specify a specific port on the network or the fixed IP address to assign to the server interface.
fr: Vous pouvez spécifier les réseaux auxquels le serveur se connecte lors du lancement. Vous pouvez spécifier un ou plusieurs réseaux. Les utilisateurs peuvent aussi indiquer un port spécifique sur le réseau ou une adresse IP fixe à assigner à l'interface du serveur.

source: You can use both IPv4 and IPv6 addresses as access addresses and you can assign both addresses simultaneously. You can update access addresses after you create a server.
fr: Vous pouvez utiliser à la fois des adresses IPv4 et IPv6 en tant qu'adresses d'accès et vous pouvez configurer ces deux adresses simultanément. Vous pouvez mettre à jour les adresses d'accès après avoir créé un serveur.

source: Server personality
fr: Personnalité du serveur.

source: You can customize the personality of a server instance by injecting data into its file system. For example, you might want to insert ssh keys, set configuration files, or store data that you want to retrieve from inside the instance. This feature provides a minimal amount of launch-time personalization. If you require significant customization, create a custom image.
fr: Vous pouvez personnaliser la personnalité d'une instance de serveur en injectant des données dans son système de fichiers. Par exemple, vous pourriez insérer des clés ssh, écrire des fichiers de configuration, ou stocker des données que vous souhaiteriez retrouver depuis l'intérieur de l'instance. Cette fonctionnalité donne une personnalisation du démarrage minimale. Si vous avez besoin de plus de personnalisation, créez une image personnalisée.

source: Follow these guidelines when you inject files:
fr: Suivez ces recommandations lorsque vous injectez des fichiers:

source: The maximum size of the file path data is 255 bytes.
fr: La taille maximum des données de chemin de fichier est de 255 octets.

source: Encode the file contents as a Base64 string. The compute providers determines the maximum size of the file contents. This value can vary based on the image that is used to create the server.
fr: Encodez le contenu des fichiers en tant que chaine de caractères en Base64. Les fournisseurs de calcul déterminent la taille maximum du contenu des fichiers. Cette valeur peut varier en fonction de l'image qui est utilisée pour créer le serveur.

source: The maximum limit refers to the number of bytes in the decoded data and not to the number of characters in the encoded data.
fr: La limite maximum fait référence au nombre d'octets dans les données décodées et pas au nombre de caractères dans les données encodées.

source: You can inject text files only. You cannot inject binary or ZIP files into a new build.
fr: Vous pouvez injecter des fichiers texte seulement. Vous ne pouvez pas injecter de fichiers binaires ou au format ZIP dans une nouvelle version.

source: The maximum number of file path/content pairs that you can supply is also determined by the compute provider and is defined by the maxPersonality absolute limit.
fr: Le nombre maximum de paires chemin de fichier/contenu que vous pouvez fournir est aussi déterminé par le fournisseur de calcul et est défini parla limite absolue maxPersonality.

source: The absolute limit, <code>maxPersonalitySize</code>, is a byte limit that is guaranteed to apply to all images in the deployment. Providers can set additional per-image personality limits.
fr: La limite absolue, <code>maxPersonalitySize</code>, est une limite en octets qui est garantie s'appliquer à toutes les images dans le déploiement. Les fournisseurs peuvent configurer des limites de personnalité par image.

source: The file injection might not occur until after the server is built and booted.
fr: L'injection de fichier ne devrait pas pouvoir survenir avant que le serveur n'est été construit et n'ait booté.

source: After file injection, personality files are accessible by only system administrators. For example, on Linux, all files have root and the root group as the owner and group owner, respectively, and allow user and group read access only ( ).
fr: Après l'injection du fichier, les fichiers de personnalité sont accessibles uniquement par les administrateurs système. Par exemple, sous Linux, tous les fichiers ont l'utilisateur propriétaire root et le groupe root, respectivement, et permettent seulement des accès en lecture seule au propriétaire et au groupe ( ).

source: Server access addresses
fr: Adresses d'accès au serveur.

source: Show details for, set, update, and delete server metadata or metadata items.
fr: Affiche les informations, configure, modifie, et supprime les métadonnées du serveur ou des objets.

source: Server addresses
fr: Adresses du serveur

source: List addresses for a specified server or a specified server and network.
fr: Liste les adresses d'un serveur spécifié ou d'un serveur et d'un réseau spécifiés.

source: Server actions
fr: Actions de serveur

source: Perform actions for a specified server, including change administrator password, reboot, rebuild, resize, and create image from server.
fr: Met en oeuvre les actions pour un serveur spécifié, incluant le changement du mot de passe administrateur, le reboot, la reconstruction, le re-dimensionnement, et crée une image à partir d'un serveur.

source: Flavors
fr: Types d'instance

source: List available flavors and get details for a specified flavor. A flavor is a hardware configuration for a server. Each flavor is a unique combination of disk space and memory capacity.
fr: Liste les types d'instances disponibles et obtient les informations d'un type d'instance spécifié. Un type d'instance est une configuration typique de matériel pour un serveur. Chaque type d'instance est une combinaison unique d'espace disque et de capacité mémoire.

source: List available images, get details for a specified image, and delete an image.
fr: Liste les images disponibles, obtient les informations pour une image spécifiée, et supprime une image.

source: Also, set, list, get details for, and delete image metadata.
fr: De plus, configure, liste, obtient les informations, et supprime les métadonnées d'une image.

source: Image metadata
fr: Métadonnées d'image

source: Show details for, set, update, and delete image metadata or metadata items.
fr: Affiche les informations, configure, modifie, et supprime les métadonnées d'image ou objets de métadonnées.
