Repository: AsherBond/api-site
Catalog: api-quick-start/source/locale/*/LC_MESSAGES/api-quick-start.po
Languages: fi_fi

source: 'Deprecated' is a stable version that is still available but is being deprecated and might be removed in the future.
fi_fi: 'Vanhentunut' on vakaa versio joka on vielä saatavilla mutta on vanhentunut ja joka saatetaan poistaa tulevaisuudessa.

source: 'Experimental' is not a stable version. This version is under development or contains features that are otherwise subject to change.
fi_fi: 'Kokeellinen' ei ole vakaa versio. Tätä versiota kehitetään parhaillaan tai sisältää ominaisuuksia jotka tulevat muuttumaan.

source: **OpenStack Python Software Development Kit (SDK)**
fi_fi: **OpenStack Python Ohjelmistokehityspakkaus (SDK)**

source: **OpenStack command-line client**
fi_fi: **OpenStack komentoriviasiakas**

source: **REST clients**
fi_fi: **REST asiakkaat**

source: *Project Domain* (optional)
fi_fi: *Project Domain* (valinnainen)

source: *Project ID* (optional)
fi_fi: *Project ID* (valinnainen)

source: *Project Name* (optional)
fi_fi: *Project Name* (valinnainen)

source: *User Domain* (required)
fi_fi: *User Domain* (pakollinen)

source: A command-line tool that lets you send HTTP requests and receive responses. See the section called :ref:`openstack_API_quick_guide`.
fi_fi: Komentorivityökalu jolla voit lähettää HTTP-pyyntöjä ja vastaanottaa vastauksia. Katso osasta nimeltä :ref:`openstack_API_quick_guide`.

source: API quick-start examples
fi_fi: API pika-aloitus esimerkkejä

source: After you authenticate through Identity, you can use the other OpenStack APIs to create and manage resources in your OpenStack cloud. You can launch instances from images and assign metadata to instances through the Compute API or the **openstack** command-line client.
fi_fi: Kun olet tunnistautunut Identityn kautta, voit käyttää muita OpenStack API-rajapintoja luodaksesi ja hoitaaksesi resursseja OpenStack pilvessä. Voit käynnistää instansseja näköistiedostoista ja määrätä metatietoja instansseille Compute API:n kautta tai **openstack** komentoriviltä.

source: Authenticate
fi_fi: Todennus

source: Authentication and API request workflow
fi_fi: Todennus ja API-pyynnön työnkulku

source: Before you can issue client commands, you must download and source the ``openrc`` file to set environment variables.
fi_fi: Ennen kuin voit suorittaa asiakaskomentoja tulee sinun ladata ja lähteistää ``openrc``tiedosto asettaaksesi muuttujat käyttöympäristöösi.

source: Both Mozilla and Google provide browser-based graphical interfaces for REST. For Firefox, see `RESTClient <https://addons.mozilla.org/en-US/firefox/addon/restclient/>`__. For Chrome, see `rest-client <http://code.google.com/p/rest-client/>`__.
fi_fi: Mozilla sekä Google tarjoavat selainpohjaisia graafisia käyttöliittymiä REST-rajapinnalle. Katso Firefoxille `RESTClient <https://addons.mozilla.org/en-US/firefox/addon/restclient/>`__. Chromelle, katso `rest-client <http://code.google.com/p/rest-client/>`__.

source: Credentials are usually a combination of your user name and password, and optionally, the name or ID of the project of your cloud. Ask your cloud administrator for your user name, password, and project so that you can generate authentication tokens. Alternatively, you can supply a token rather than a user name and password.
fi_fi: Pääsytiedot ovat tyypillisesti yhdistelmästä käyttäjänimi ja salasana, sekä valinnaisesti projektin nimi tai sen ID. Kysy pilvipalvelusi ylläpitäjältä käyttäjänimeäsi, salasanaa, sekä projektin nimeä jotta voit luoda tunnistautumiseen tarvittavia tunnisteita. Vaihtoehtoisesti voit antaa tunnisteen ilman käyttäjänimeä ja salasanaa.

source: Current API versions
fi_fi: Nykyiset API versiot

source: Deprecated API versions
fi_fi: Vanhentuneet API versiot

source: Description
fi_fi: Kuvaus

source: Export the $OS_PROJECT_ID from the token call, and then use the Compute API to list images:
fi_fi: Vie $OS_PROJECT_ID tunnuskutsusta ja käytä Compute API:a listataksesi näköistiedostot:

source: Export the $OS_PROJECT_ID from the token call, and then use the Compute API to list servers:
fi_fi: Vie $OS_PROJECT_ID tunnuskutsusta ja käytä Compute API:a listataksesi palvelimet:

source: Export the project name to the ``OS_PROJECT_NAME`` environment variable. For example:
fi_fi: Vie projektin nimi ``OS_PROJECT_NAME`` ympäristömuuttujalle. Esimerkiksi:

source: Export the token ID to the ``OS_TOKEN`` environment variable. For example:
fi_fi: Vie tunnus ID ``OS_TOKEN`` ympäristömuuttujaan. Esimerkiksi:

source: For complete information about the OpenStack clients, including how to source the ``openrc`` file, see `OpenStack End User Guide <https://docs.openstack.org/user-guide/>`__, `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`__, and `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__.
fi_fi: Täydelliset tiedot OpenStack asiakkaista, mukaan lukien kuinka lähteistää ``openrc`` tiedosto, katso `OpenStack käyttöoppaasta <https://docs.openstack.org/user-guide/>`__, `OpenStack ylläpitäjän opas <https://docs.openstack.org/admin-guide/>`__, ja `OpenStack komentorivi käyttöliittymän viite <https://docs.openstack.org/cli-reference/>`__.

source: For example, install the ``openstack`` client:
fi_fi: Esimerkiksi asenna ``openstack`` asiakas:

source: For more information about API status values and version information, see `Version Discovery <https://wiki.openstack.org/wiki/VersionDiscovery>`__.
fi_fi: Lisätietoja API:n tilasta sekä sen versiosta, katso `Version Discovery <https://wiki.openstack.org/wiki/VersionDiscovery>`__.

source: If the Unauthorized (401) error occurs, request another token.
fi_fi: Mikäli luvaton virhe (401) tapahtuu, pyydä uusi tunnus.

source: Install or update a client package:
fi_fi: Asenna tai päivitä asiakas paketti:

source: Install the clients
fi_fi: Asenna asiakkaat

source: Launch an instance
fi_fi: Käynnistä instanssi

source: OpenStack API Documentation
fi_fi: OpenStack API dokumentaatio

source: OpenStack APIs
fi_fi: OpenStack API:t

source: OpenStack command-line clients
fi_fi: OpenStack komentoriviasiakkaat

source: Parameter
fi_fi: Parametri

source: Send API requests
fi_fi: Lähetä API-pyynnöt

source: Supported API versions
fi_fi: Tuetut API versiot

source: The Block Storage API v3 is functionally identical to the Block Storage API v2. Subsequent API v3 microversions, such as v3.1, differ from API v2.
fi_fi: Block Storage API v3 on toiminnallisesti identtinen Block Storage API v2:een. Myöhemmät API v3 mikroversiot, kuten v3.1, eroavat versiosta API v2.

source: The OpenStack project provides a command-line client that enables you to access APIs through easy-to-use commands. See the section called :ref:`client-intro`.
fi_fi: OpenStack projekti tarjoaa asiakasohjelman komentoriville joka mahdollistaa API:n käytön helppokäyttöisillä komennoilla. Katso osasta nimeltä :ref:`client-intro`.

source: The Shared File Systems API v1 is functionally identical to the Shared File Systems API v2. Subsequent API v2 microversions, such as v2.1, differ from API v1.
fi_fi: Jaetut tiedostojärjestelmät API v1 on toiminnallisesti identtinen Jaetut tiedostojärjestelmät API v2 kanssa. Myöhemmät API v2 mikroversiot, kuten versio v2.1, eroavat versiosta API v1.

source: The following example shows a successful response:
fi_fi: Oheinen esimerkki näyttää onnistuneen vastauksen:

source: The password for the user.
fi_fi: Käyttäjän salasana.

source: The project name. Both the *Project ID* and *Project Name* are optional.
fi_fi: Projektin nimi. Molemmat *Project ID* ja *Project Name* ovat valinnaisia.

source: The user name. If you do not provide a user name and password, you must provide a token.
fi_fi: Käyttäjänimi. Jos et anna käyttäjänimeä ja salasanaa sinun tulee antaa tunnus.

source: To authenticate access to OpenStack services, you must first issue an authentication request with a payload of credentials to OpenStack Identity to get an authentication token.
fi_fi: Tunnistautuaksesi käyttämään OpenStack palveluita, sinun tulee ensiksi antaa tunnistautumispyyntö OpenStack Identity:lle saadaksesi tunnuksen.

source: To begin sending API requests, use one of the following methods:
fi_fi: Aloittaaksesi API pyyntöjen lähettämisen, käytä yhtä oheisistä metodeista:

source: To launch an instance, note the IDs of your desired image and flavor.
fi_fi: Käynnistääksesi instanssin pistä muistiin halutun näköistiedoston ja sävyn ID.

source: To launch instances, you must choose a name, an image, and a flavor for your instance.
fi_fi: Käynnistääksesi instansseja sinun tulee valita nimi, näköistiedosto, ja instanssin sävy.

source: To launch the ``my_instance`` instance, run the ``openstack server create`` command with the image and flavor IDs and the server name:
fi_fi: Käynnistääksesi ``my_instance`` instanssin, suorita ``openstack server create`` komento yhdessä näköistiedoston ja sävyn ID:n sekä palvelimen nimen kanssa:

source: To list flavors, run this command:
fi_fi: Listataksesi sävyt suorita tämä komento:

source: To remove the ``openstack`` client, run this command:
fi_fi: Poistaaksesi ``openstack`` asiakas, suorita tämä komento:

source: To update the ``openstack`` client, run this command:
fi_fi: Päivittääksesi ``openstack`` asiakas, suorita tämä komento:

source: Type
fi_fi: Tyyppi

source: Use this SDK to write Python automation scripts that create and manage resources in your OpenStack cloud. The SDK implements Python bindings to the OpenStack API, which enables you to perform automation tasks in Python by making calls on Python objects rather than making REST calls directly. All OpenStack command-line tools are implemented by using the Python SDK. See `OpenStack Python SDK <https://docs.openstack.org/user-guide/sdk.html>`__ in the *OpenStack End User Guide*.
fi_fi: Käytä tätä SDK:ta kirjoittaaksesi Python automatisointiin soveltuvia skriptejä jotka luo ja hallitsee resursseja OpenStack pilvessä. Ohjelmistokehityspakkaus toteuttaa Python sidoksia OpenStack API:iin, joka mahdollistaa automatisoitujen tehtävien suorituksen Pythonilla tekemällä kutsuja suoraan Python objekteihin ilman REST-kutsuja. Kaikki OpenStack komentorivityökalut ovat toteutettu käyttämällä Python SDK:ta. Katso `OpenStack Python SDK <https://docs.openstack.org/user-guide/sdk.html>`__ *OpenStack käyttöoppaasta*.

source: When you send API requests, you include the token in the ``X-Auth-Token`` header. If you access multiple OpenStack services, you must get a token for each service. A token is valid for a limited time before it expires. A token can also become invalid for other reasons. For example, if the roles for a user change, existing tokens for that user are no longer valid.
fi_fi: Kun lähetät API-kutsuja sisällytät tunnisteesi ``X-Auth-Token`` ylätunnisteeseen. Mikäli käytät useampia OpenStack palveluita sinun tulee antaa tunniste kullekin palvelulle erikseen. Tunniste on voimassa vain rajoitetun ajan kunnes se vanhentuu. Tunniste saattaa tulla myös muista syistä käyttökelvottomaksi. Esimerkiksi jos käyttäjälle asetetut roolit muutetaan ei nykyinen tunnus ole enää voimassa.

source: Where *PROJECT* is the project name.
fi_fi: Missä *PROJECT* on projektin nimi.

source: `Application Container Service API <https://developer.openstack.org/api-ref/application-container/>`__ (microversions)
fi_fi: `Application Container Service API <https://developer.openstack.org/api-ref/application-container/>`__ (mikroversiot)

source: `Bare Metal API v1 <https://developer.openstack.org/api-ref/baremetal/>`__ (microversions)
fi_fi: `Bare Metal API v1 <https://developer.openstack.org/api-ref/baremetal/>`__ (mikroversiot)

source: `Block Storage API v3 <https://developer.openstack.org/api-ref/block-storage/v3/>`__ (microversions)
fi_fi: `Block Storage API v3 <https://developer.openstack.org/api-ref/block-storage/v3/>`__ (mikroversiot)

source: `Compute API <https://developer.openstack.org/api-ref/compute/>`__ (microversions)
fi_fi: `Compute API <https://developer.openstack.org/api-ref/compute/>`__ (mikroversiot)

source: `Container Infrastructure Management API <https://developer.openstack.org/api-ref/container-infrastructure-management/>`__ (microversions)
fi_fi: `Container Infrastructure Management API <https://developer.openstack.org/api-ref/container-infrastructure-management/>`__ (mikroversiot)

source: `Data Processing v1.1 <https://developer.openstack.org/api-ref/data-processing/>`__
fi_fi: `Datan prosessointi v1.1 <https://developer.openstack.org/api-ref/data-processing/>`__

source: `Database Service API v1.0 <https://developer.openstack.org/api-ref/database/>`__
fi_fi: `Tietokanta palvelu API v1.0 <https://developer.openstack.org/api-ref/database/>`__

source: `Domain Name Server (DNS) API v2 <https://developer.openstack.org/api-ref/dns/>`__
fi_fi: `Nimipalvelin (DNS) API v2 <https://developer.openstack.org/api-ref/dns/>`__

source: `EC2 API Service <https://developer.openstack.org/api-ref/ec2-api/>`__
fi_fi: `EC2 API palvelu <https://developer.openstack.org/api-ref/ec2-api/>`__

source: `Identity API v2.0 extensions <https://developer.openstack.org/api-ref/identity/v2-ext>`__
fi_fi: `Identity API v2.0 laajennukset <https://developer.openstack.org/api-ref/identity/v2-ext>`__

source: `Identity API v3 extensions <https://developer.openstack.org/api-ref/identity/v3-ext>`__
fi_fi: `Identity API v3 laajennukset <https://developer.openstack.org/api-ref/identity/v3-ext>`__

source: `Image service API v2 <https://developer.openstack.org/api-ref/image/v2>`__
fi_fi: `Image palvelu API v2 <https://developer.openstack.org/api-ref/image/v2>`__

source: `Placement API <https://developer.openstack.org/api-ref/placement/>`__ (microversions)
fi_fi: `Placement API <https://developer.openstack.org/api-ref/placement/>`__ (mikroversiot)

source: `Resource Optimization API v1 <https://developer.openstack.org/api-ref/resource-optimization>`__
fi_fi: `Resurssien optimointi API v1 <https://developer.openstack.org/api-ref/resource-optimization>`__

source: `Search API v1 <https://developer.openstack.org/api-ref/search>`__
fi_fi: `Haku API v1 <https://developer.openstack.org/api-ref/search>`__

source: `Shared File Systems API v2 <https://developer.openstack.org/api-ref/shared-file-system>`__ (microversions)
fi_fi: `Jaetut tiedostojärjestelmät API v2 <https://developer.openstack.org/api-ref/shared-file-system>`__ (mikroversiot)

source: password (required)
fi_fi: salasana (pakollinen)

source: string
fi_fi: merkkijono

source: username (required)
fi_fi: käyttäjänimi (pakollinen)
