Repository: AsherBond/api-site
Catalog: api-quick-start/locale/*.po
Languages: ca, fr, vi_vn

source: A command-line tool that lets you send HTTP requests and receive responses. See <xref linkend="Compute_API_Quick_Start"/>.
ca: Una eina de línia de comandes que et permet enviar peticions HTTP i rebre respostes. Pots veure <xref linkend="Compute_API_Quick_Start"/>.
fr: Un outil de ligne de commande permettant d'envoyer des requêtes HTTP et de recevoir des réponses. Retrouvez plus d'informations en consultant : <xref linkend="Compute_API_Quick_Start"/>.
vi_vn: Một công cụ sử dụng dòng lệnh cho phép bạn gửi yêu cầu HTTP và nhận lại hồi đáp. Xem <xref linkend="Compute_API_Quick_Start"/>.

source: A token. If you do not provide a token, you must provide a user name and password.
ca: Una cadena d'autentificació. Si no proporciones una cadena d'autentificació, has de proporcionar un nom d'usuari i una contrassenya.
fr: Un token. Si vous ne fournissez, pas un token, vous devez utiliser un nom d'utilisateur et un mot de passe.
vi_vn: Một token. Nếu bạn không cung cấp một token, bạn phải cung cấp tên người dùng và mật khẩu.

source: After you authenticate through Identity, you can use the other OpenStack APIs to create and manage resources in your OpenStack cloud. You can launch instances from images and assign metadata to instances through the Compute API or the <placeholder-1/> command-line client.
ca: Després de que t'identifiquis a través d'Identity, pots utilitzar les altres APIs d'OpenStack per crear i manegar recursos al teu núvol d'OpenStack. Pots llençar instàncies desde imatges i assignar metadades a instàncies a través de l'API Compute o el client de línia de comandes <placeholder-1/>.
fr: Après vous êtes identifié au travers du service d'authentification, vous pouvez utiliser les autres APIs OpenStack pour créer et gérer des ressources dans votre Cloud OpenStack. Vous pouvez lancer des instances depuis des images et assigner des métadonnées aux instances en utilisant l'API Compute ou le client de ligne de commande <placeholder-1/>.
vi_vn: Sau khi bạn xác thực qua dịch vụ Identity, bạn có thể sử dụng các OpenStack API khác để tạo và quản lí tài nguyên trong Openstack cloud. Bạn có thể tạo ra các instance từ các image và gán metadata cho các instance thông qua Compute API hoặc <placeholder-1/> giao diện dòng lệnh client

source: Although you install each OpenStack service separately, the OpenStack services work together to meet your cloud needs: Identity, Compute, Image service, Block Storage, Networking (neutron), Object Storage, Orchestration, and Telemetry. With the <link xlink:href="http://www.trystack.org/">TryStack</link> OpenStack installation, these services work together in the background of the installation.
vi_vn: Mặc dù bạn cài đặt từng dịch vụ OpenStack riêng biệt nhưng những dịch vụ này vẫn hoạt động cùng nhau để đáp ứng những nhu cầu hạ tầng cloud của người dùng, bao gồm: Identity, Compute, Image service, Block Storage, Networking (neutron), Object Storage, Orchestration, and Telemetry. Với việc xem cách cài đặt OpenStack tại link sau <link xlink:href="http://www.trystack.org/">TryStack</link>, những dịch vụ này hoạt động ngầm cùng nhau lúc cài đặt.

source: Authenticate
ca: Autentificar-se
fr: Authentification
vi_vn: Xác thực

source: Authentication and API request workflow
ca: Fluxe de treball d'una autentificació i petició a la API
fr: Workflow d'authentification et des requêtes API.
vi_vn: Quy trình xác thực và yêu cầu API

source: Before you can issue client commands, you must download and source the <filename>openrc</filename> file to set environment variables.
ca: Abans de que puguis executar comandes de client, has de descarregar i executar la comanda source sobre l'arxiu <filename>openrc</filename> per establir les variables d'entorn.
fr: Avant d'utiliser les clients de ligne de commande, vous devez télécharger et sourcer le fichier <filename>openrc</filename> pour définir les variables d'environnement.
vi_vn: Trước khi thực hiện các lệnh, bạn phải tải về và lưu trữ file <filename>openrc</filename> để cài đặt biến môi trường.

source: Both Mozilla and Google provide browser-based graphical interfaces for REST. For Firefox, see <link xlink:href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">RESTClient</link>. For Chrome, see <link xlink:href="http://code.google.com/p/rest-client/">rest-client</link>.
vi_vn: Cả Mozilla và Google đều cung cấp giao diện đồ họa dựa trên trình duyệt của họ cho REST. Với Firefox, xem <link xlink:href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">RESTClient</link>. Với Chrome, xem <link xlink:href="http://code.google.com/p/rest-client/">rest-client</link>.

source: Credentials are usually a combination of your user name and password, and optionally, the name or ID of the tenant in which your cloud runs. Ask your cloud administrator for your user name, password, and tenant so that you can generate authentication tokens. Alternatively, you can supply a token rather than a user name and password.
ca: Les credencials són normalment una combinació del teu nom d'usuari i la teva contrassenya, i opcionalment, el nom o l'identificador del contenidor on corre el teu núvol. Pregunta al teu administrador del núvol pel teu usuari, contrassenya i contenidor per poder generar cadenes d'autentificació. Alternativament, pots proporcionar una cadena directament enlloc d'un usuari i contrassenya.
fr: Les informations d'identification (credentials) sont généralement une combinaison de votre nom d'utilisateur, de votre mot de passe et en option, le nom et l'ID du tenant dans lequel votre Cloud s'exécute. Demandez à votre administrateur de cloud votre nom d'utilisateur, votre mot de passe et votre tenant pour que vous puissiez créer des tokens d'authentification. Sinon, vous pouvez fournir un token au lieu d'un nom d'utilisateur et mot de passe.
vi_vn: Credentials là sự kết hợp của tên người dùng và mật khẩu, cũng có khi là tên hoặc ID của tenant đang hoạt động trong đám mây của bạn. Yêu cầu người quản lí cloud của bạn để có tên người dùng, mật khẩu cũng như tenant sẽ giúp bạn tạo ra các token xác thực. Ngoài ra bạn có thể cung cấp một token thay vì tên người dùng và mật khẩu.

source: Description
ca: Descripció
vi_vn: Mô tả chi tiết

source: Each OpenStack project provides a command-line client that enables you to access its API through easy-to-use commands. See <xref linkend="cli-intro"/>.
ca: Cada projecte d'OpenStack proporciona un client de línia de comandes que et permet accedir a l'API a través de comandes senzilles d'utilitzar. Pots veure <xref linkend="cli-intro"/>.
fr: Pour chaque projet OpenStack, il existe un client de ligne de commande permettant d'accéder aux API au travers de commandes faciles à utiliser. Retrouvez plus d'informations en consultant : <xref linkend="cli-intro"/>.
vi_vn: Mỗi project của OpenStack cung cấp một giao diện dòng lệnh client cho phép bạn truy cập vào API của nó thông qua các câu lệnh một cách dễ dàng. Xem <xref linkend="cli-intro"/>.

source: For a typical OpenStack deployment that runs Identity, use a cURL command like the following command to request a token:
ca: Per un desplegament típic d'OpenStack que executa Identity, utilitza una comanda cURL com la següent per demanar una cadena d'autentificació:
fr: Sur une implémentation d'OpenStack typique qui utilise l'identification, utilisez une commande cURL suivante pour demander un token :
vi_vn: Khi việc triển khai OpenStack theo mô hình chuẩn mà phải vận hành Identity, hãysử dụng lệnh cURL như sau để yêu cầu một token:

source: For complete information about the OpenStack clients, including how to source the <filename>openrc</filename> file, see <link xlink:href="http://docs.openstack.org/user-guide/content/"><citetitle>OpenStack End User Guide</citetitle></link>, <link xlink:href="http://docs.openstack.org/user-guide-admin/content/"><citetitle>OpenStack Admin User Guide</citetitle></link>, and <link xlink:href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
vi_vn: Để hoàn tất thông tin về phía các clients của OpenStack, bao gồm cách lưu trữ file <filename>openrc</filename>, xem <link xlink:href="http://docs.openstack.org/user-guide/content/"><citetitle>OpenStack End User Guide</citetitle></link>, <link xlink:href="http://docs.openstack.org/user-guide-admin/content/"><citetitle>OpenStack Admin User Guide</citetitle></link>, và <link xlink:href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.

source: For example, to install the <placeholder-1/> client, run this command:
ca: Per exemple, per instal·lar el client <placeholder-1/>, execute aquesta comanda:
fr: Par exemple, pour installer le client <placeholder-1/>, lancez cette commande :
vi_vn: Ví dụ, để cài đặt <placeholder-1/> client, chạy câu lệnh sau:

source: For information about the command-line clients, see <link xlink:href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
vi_vn: Để biết thêm thông tin về dòng lệnh bên phía các clients, xem <link xlink:href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.

source: For information about the default ports that the OpenStack components use, see <link xlink:href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle>Appendix A. Firewalls and default ports</citetitle></link> in the <citetitle>OpenStack Configuration Reference</citetitle>.
vi_vn: Để biết thêm thông tin về các cổng mặc định mà các thành phần của OpenStack sử dụng, xem <link xlink:href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle>Appendix A. Firewalls and default ports</citetitle></link> trong <citetitle>OpenStack Configuration Reference</citetitle>.

source: For scripting work, you can use a command-line client like the <systemitem role="client">python-novaclient</systemitem> client. This client enables you to use the Compute API through a command-line interface.
ca: Per tasques de programació, pots utilitzar un client de línia de comandes com el client <systemitem role="client">python-novaclient</systemitem>. Aquest client et permet utilitzar l'API Compute a través de la interfície de línia de comandes.
fr: Pour travailler avec des scripts, vous pouvez utiliser un client de ligne de commande comme le client <systemitem role="client">python-novaclient</systemitem>. Ce client vous permet d'utiliser l'API Compute via une interface de ligne de commande.
vi_vn: Đối với công việc viết lệnh kịch bản, bạn có thể sử dụng một dòng lệnh client như <systemitem role="client">python-novaclient</systemitem> client. Client này cho phép bạn sử dụng các Compute API thông qua một giao diện dòng lệnh.

source: If the <errorcode>401</errorcode><errortext>Unauthorized</errortext> error occurs, request another token.
ca: Si es dona un error <errorcode>401</errorcode><errortext>Unauthorized</errortext>, demana una altra cadena d'autentificació.
fr: Si l'erreur <errorcode>401</errorcode><errortext>Unauthorized</errortext> se produit, demandez un autre token.
vi_vn: Nếu lỗi <errorcode>401</errorcode><errortext>Unauthorized</errortext> xuất hiện, yêu cầu một token xác thực khác.

source: If the request succeeds, the server returns an authentication token.
ca: Si la petició és executada amb èxit, el servidor retorna una cadena d'autentificació.
fr: Si la requête réussit, le serveur retournera un token d'authentification.
vi_vn: Nếu yêu cầu thành công, server sẽ gửi về một token dùng để xác thực.

source: If the request succeeds, you receive a <returnvalue>200 OK</returnvalue> response followed by a response body that contains a token in the form <code>"id":"<replaceable>token</replaceable>"</code> and an expiration date and time in the form <code>"expires":"<replaceable>datetime</replaceable>"</code>.
ca: Si la petició és executada amb èxit, rebràs una resposta <returnvalue>200 OK</returnvalue> seguida per un cos de resposta que contindrà la cadena d'autentificació de la forma <code>"id":"<replaceable>token</replaceable>"</code> i una data i temps d'expiració de la forma <code>"expires":"<replaceable>datetime</replaceable>"</code>.
fr: Si la requête aboutie, vous recevrez une réponse <returnvalue>200 OK</returnvalue> suivie par une réponse comportant un token sous la forme suivante <code>"id":"<replaceable>token</replaceable>"</code> ainsi qu'une date et heure d'expiration sous la forme : <code>"expires":"<replaceable>datetime</replaceable>"</code>.
vi_vn: Nếu yêu cầu thành công, bạn sẽ nhận được hồi đáp có giá trị là <returnvalue>200 OK</returnvalue>, nội dung bao gồm một token có dạng <code>"id":"<replaceable>token</replaceable>"</code> và ngày giờ hết hạn có dạng là <code>"expires":"<replaceable>datetime</replaceable>"</code>.

source: If you do not know your tenant name or ID, you can send an authentication request with an empty tenantName, as follows:
vi_vn: Nếu bạn không biết tên hoặc ID của tenant, bạn có thể gửi một yêu cầu xác thực gồm một tenantName trống như sau:

source: Install the clients
ca: Instal·lar els clients
fr: Installez les clients
vi_vn: Cài đặt các client

source: Launch an instance
ca: Llençar una instància
fr: Lancer une instance
vi_vn: Khởi tạo một máy ảo

source: OpenStack API Quick Start
ca: Guia ràpida de l'API d'OpenStack
fr: Démarrage rapide pour l'API OpenStack
vi_vn: Làm quen với OpenStack API

source: OpenStack Python Software Development Kit (SDK)
ca: Kit de desenvolupament en Python per OpenStack (SDK)
fr: Kit de développement logiciel (SDK) OpenStack en Python
vi_vn: Bộ công cụ phát triển OpenStack bằng ngôn ngữ Python (SDK)

source: OpenStack command-line clients
ca: Clients de línia de comandes d'OpenStack
fr: Clients de ligne de commande OpenStack
vi_vn: Công cụ giao diện dòng lệnh của OpenStack

source: PROJECT
ca: PROJECTE
vi_vn: DỰ ÁN

source: Parameter
ca: Paràmetre
fr: Paramètre
vi_vn: Thông số

source: Request an authentication token from the Identity endpoint that your cloud administrator gave you. Send a payload of credentials in the request:
ca: Demana una cadena d'autentificació a l'adreça d'Identity que t'ha donat el teu administrador del núvol. Envia les teves credencials a la petició:
fr: Récupérez un token d'authentification depuis le endpoint du service d'identification fourni par votre administrateur. Envoyez les bonnes informations d'identification (credentials) dans la requête :
vi_vn: Để yêu cầu một token xác thực từ Identity endpoint, là cái mà người quả trị cloud cung cấp cho bạn. Thì gửi một payload của thông tin người dùng trong yêu cầu đó như sau:

source: Run this command to install or update a client package:
ca: Executa aquesta comanda per instal·lar o actualitzar un paquet de client:
fr: Lancez cette commande pour installer ou mettre à jour les paquets d'un client :
vi_vn: Chạy lệnh dưới đây để cài đặt hoặc nâng cấp gói công cụ client:

source: Send API requests
ca: Enviar peticions a l'API
fr: Envoyer des requêtes API
vi_vn: Gửi các gói tin yêu cầu API

source: Send API requests and include the token in the <literal>X-Auth-Token</literal> header. Continue to send API requests with that token until the job completes or a <errorcode>401</errorcode><errortext>Unauthorized</errortext> error occurs.
ca: Envia peticions a l'API i inclou la cadena d'autentificació a la capçalera <literal>X-Auth-Token</literal>. Continua enviant peticions a l'API amb aquesta cadena d'autentificació fins que acabi la feina o es doni un error <errorcode>401</errorcode><errortext>Unauthorized</errortext>.
fr: Envoyez des requêtes API et incluez le code dans le header <literal>X-Auth-Token</literal>. Continuez à envoyer des requêtes API avec ce token jusqu'à la fin des tâches en cours sinon vous obtiendrez un message : <errorcode>401</errorcode><errortext>Unauthorized</errortext>.
vi_vn: Gửi yêu cầu API và kèm theo thẻ chứng thực trong <literal>X-Auth-Token</literal> trong header của bản tin. Tiếp tục gửi yêu cầu API kèm với thẻ chứng thực trên cho tới khi hoàn tất tác vụ hoặc xảy ra lỗi <errorcode>401</errorcode><errortext>Unauthorized</errortext>.

source: The examples in this section use cURL commands. For information about cURL, see <link xlink:href="http://curl.haxx.se/">http://curl.haxx.se/</link>. For information about the OpenStack APIs, see <link xlink:href="http://developer.openstack.org/api-ref.html">OpenStack API Reference</link>.
vi_vn: Những ví dụ trong phần này sử dụng các câu lệnh cURL, để biết thêm thông tin về cURL, xem <link xlink:href="http://curl.haxx.se/">http://curl.haxx.se/</link>. Để biết thêm thông tin về OpenStack APIs, xem <link xlink:href="http://developer.openstack.org/api-ref.html">OpenStack API Reference</link>.

source: The following example shows a successful response:
ca: L'exemple següent mostra una resposta exitosa:
fr: L'exemple suivant montre une réponse aboutie :
vi_vn: Sau đây là ví dụ về một hồi đáp thành công:

source: The password for the user.
ca: La contrassenya per l'usuari.
fr: Le mot de passe de l'utilisateur.
vi_vn: mật khẩu cho người dùng.

source: The tenant ID. Both the <placeholder-1/> and <placeholder-2/> are optional, but should not be specified together. If both attributes are specified, the server responds with a <placeholder-3/><placeholder-4/>. If you do not know the tenantId, you can send a request with "" for the tenantId and get the ID returned to you in the response.
vi_vn: ID của tenant. Cả <placeholder-1/> và <placeholder-2/> đều không bắt buộc nhưng không nên được khai báo cùng một lúc. Nếu cả hai thuộc tính đều được khai báo, server sẽ hồi đáp lại bằng <placeholder-3/><placeholder-4/>. Nếu bạn không biết tenantId, bạn có thể gửi một yêu cầu lấy tenantId "" và nhận về ID đó trong phần hồi đáp.

source: The tenant name. Both the <placeholder-1/> and <placeholder-2/> are optional, but should not be specified together. If both attributes are specified, the server responds with a <placeholder-3/><placeholder-4/>.
ca: El nom del contenidor. Tant com <placeholder-1/> i <placeholder-2/> són opcionals, però no s'han d'especificar tots junts. Si s'especifiquen els dos atributs, el servidor respon amb un <placeholder-3/><placeholder-4/>.
fr: Le nom du tenant. <placeholder-1/> et <placeholder-2/> sont optionnels tous les deux, mais ils ne doivent pas être utilisés en même temps. Si les deux attributs sont utilisés ensemble, le serveur retournera avec le message : placeholder-3/><placeholder-4/>.
vi_vn: Tên của tenant. Cả <placeholder-1/> và <placeholder-2/> đều không bắt buộc nhưng không nên được khai báo cùng một lúc. Nếu cả hai thuộc tính đều được khai báo, server sẽ hồi đáp lại bằng <placeholder-3/><placeholder-4/>.

source: The user name. If you do not provide a user name and password, you must provide a token.
ca: El nom d'usuari. Si no proporciones un nom d'usuari i contrassenya, has de proporcionar una cadena d'autentificació.
fr: Le nom d'utilisateur. Si vous ne fournissez pas de nom d'utilisateur et de mot de passe, vous devrez fournir un token.
vi_vn: Tên người dùng. Nếu bạn không cung cấp tên người dùng và mật khẩu, bạn phải cung cấp một token.

source: This section shows how to make some basic Compute API calls. For a complete list of Compute API calls, see <link xlink:href="http://developer.openstack.org/api-ref-compute-v2.html">Compute APIs and Extensions</link>.
vi_vn: Phần này hướng dẫn cách thực hiện một vài câu gọi Compute API cơ bản, xem <link xlink:href="http://developer.openstack.org/api-ref-compute-v2.html">Compute APIs and Extensions</link>.

source: To authenticate access to OpenStack services, you must first issue an authentication request to OpenStack Identity to acquire an authentication token. To request an authentication token, you must supply a payload of credentials in the authentication request.
ca: Per autentificar l'accés als serveis d'OpenStack, primer has de realitzar una petició d'autentificació al servei Identity d'OpenStack per obtenir una cadena d'autentificació. Per demanar una cadena d'autentificació, has de proporcionar les teves credencials a la petició d'autentificació.
fr: Pour vous authentifier sur les services OpenStack, vous devez d'abord faire part une requête d'authentification sur le service d'authentification OpenStack pour récupérer un token d'authentification. Pour obtenir un token d'authentification, vous devez indiquer vos informations d'authentification (credentials) dans la requête.
vi_vn: Để xác thực truy cập tới các dịch vụ của OpenStack, đầu tiên bạn phải gửi yêu cầu xác thực đến OpenStack Identity để có được một token xác thực. Để yêu cầu một token xác thực, bạn phải cung cấp một payload về dữ liệu người dùng trong yêu cầu xác thực.

source: To begin sending API requests, use one of the following methods:
ca: Per començar a enviar peticions a l'API, utilitza alguns dels mètodes següents:
fr: Pour commencer à envoyer des requêtes API, utilisez une des méthodes suivantes :
vi_vn: Để bắt đầu gửi các yêu cầu của API, sử dụng một trong những phương thức sau:

source: To launch an instance named <literal>my_instance</literal>, run the <placeholder-1/> command with the image and flavor IDs and the server name, as follows:
ca: Per llençar una instància anomenada <literal>la_meva_instancia</literal>, executa la comanda <placeholder-1/> amb els identificadors de imatge i tamany i el nom del servidor, com segueix:
fr: Pour lancer une instance qui s'appelle <literal>my_instance</literal>, exécutez la commande <placeholder-1/> avec l'ID de l'image, celle du type d'instance et le nom du serveur, comme dans l'exemple suivant :
vi_vn: Để khởi tạo một instance tên là <literal>my_instance</literal>, thực hiện <placeholder-1/> câu lệnh cùng với image và flavor IDs và tên server, như sau:

source: To launch an instance, note the IDs of your desired image and flavor.
ca: Per llençar una instància, anota els identificadors de la teva imatge i tamany desitjats.
fr: Pour lancer une instance, notez les IDs de l'image et du type d'instance que vous souhaitez utiliser.
vi_vn: Để khởi tạo một instance, ghi lại ID của image và flavor bạn mong muốn.

source: To launch instances, you must choose a name, an image, and a flavor for your instance.
ca: Per llençar instàncies, has d'escollir un nom, una imatge, i un tamany per la teva instància.
fr: Pour lancer des instances, vous devez choisir un nom, une image et un type d'instance.
vi_vn: Để khởi tạo máy ảo, bạn phải chọn tên, image, tài nguyên cho máy ảo của bạn

source: To list available images, call the Compute API through the <placeholder-1/> client, as follows:
ca: Per llistar les imatges disponibles, pots cridar la API Compute a través del client <placeholder-1/>, com segueix:
fr: Pour lister les images disponibles, faites un appel sur l'API Compute en utilisant le client <placeholder-1/> :
vi_vn: Để liệt kê những image khả dụng, sử dụng Compute API thông qua <placeholder-1/> client, như sau:

source: To list flavors, run this command:
ca: Per llistar els tamanys, executa aquesta comanda:
fr: Pour lister les types d'instances, lancez cette commande :
vi_vn: Để liệt kê những flavor, chạy câu lệnh sau:

source: To remove the <placeholder-1/> client, run this command:
ca: Per el·liminar el paquet <placeholder-1/>, executa aquesta comanda:
fr: Pour supprimer le client <placeholder-1/>, lancez cette commande :
vi_vn: Để xóa bỏ <placeholder-1/> client, chạy câu lệnh sau:

source: To update the <placeholder-1/> client, run this command:
ca: Per actualitzar el client <placeholder-1/>, executa aquesta comanda:
fr: Pour mettre à jour le client <placeholder-1/>, lancez cette commande :
vi_vn: Để cập nhật <placeholder-1/> client, chạy câu lệnh sau:
