Repository: AsherBond/api-site
Catalog: api-quick-start/locale/*.po
Languages: ca, fr, vi_vn

source: To view details for a specified server, use the <placeholder-1/> command. Include the ID of the server:
ca: Per veure els detalls d'un servidor específic, utilitza la comanda <placeholder-1/>. Incloent l'identificador del servidor:
fr: Pour voir les détails d'un serveur spécifique, utilisez la commande <placeholder-1/>. Incluez l'ID du serveur :
vi_vn: Để xem chi tiết một server cụ thể, sử dụng câu lệnh <placeholder-1/>. Bao gồm server ID:

source: Type
ca: Tipus
vi_vn: Kiểu

source: Use <placeholder-1/> to install the OpenStack clients on a Mac OS X or Linux system. It is easy and ensures that you get the latest version of the client from the <link xlink:href="http://pypi.python.org/pypi">Python Package Index</link>. Also, <placeholder-2/> lets you update or remove a package.
vi_vn: Sử dụng <placeholder-1/> để cài đặt các OpenStack clients trên các hệ thống chạy Mac OS X hoặc Linux. Việc này dễ dàng và để đảm bảo rằng bạn luôn có được phiên bản mới nhất của client từ <link xlink:href="http://pypi.python.org/pypi">Python Package Index</link>. Đồng thời, <placeholder-2/> cho phép bạn nâng cấp hoặc gỡ bỏ gói cài đặt.

source: Use the <placeholder-1/> command to view your server:
ca: Utilitza la comanda <placeholder-1/> per veure el teu servidor:
fr: Utilisez la commande <placeholder-1/> pour voir votre serveur :
vi_vn: Sử dụng câu lệnh <placeholder-1/> để hiển thị máy chủ của bạn:

source: Use the Compute API to list flavors, as follows:
vi_vn: Sử dụng Compute API để liệt kê ra các flavor như sau:

source: Use the Compute API to list images, as follows:
vi_vn: Sử dụng Compute API để liệt kê danh sách các image, như sau:

source: Use the Compute API to list servers, as follows:
ca: Utilitza l'API de Compute per llistar els servidors, com segueix:
fr: Utilisez l'API Compute pour lister des serveurs :
vi_vn: Sử dụng Compute API để liệt kê danh sách máy chủ, như sau:

source: Use this SDK to write Python automation scripts that create and manage resources in your OpenStack cloud. The SDK implements Python bindings to the OpenStack API, which enables you to perform automation tasks in Python by making calls on Python objects rather than making REST calls directly. All OpenStack command-line tools are implemented by using the Python SDK. See <link xlink:href="http://docs.openstack.org/user-guide/content/ch_sdk.html">OpenStack Python SDK</link> in the <citetitle>OpenStack End User Guide</citetitle>.
vi_vn: Sử dụng SDK (bộ công cụ phát triển phần mềm) này để viết những tập lệnh tự động hóa dựa trên ngôn ngữ Python dùng trong việc tạo và quản lý nhiều tài nguyên trong "đám mây" Open Stack của bạn. Bộ công cụ SDK ứng dụng ngôn ngữ Python kết hợp với OpenStack API, cho phép bạn thực hiện những tác vụ tự động trong Python bằng cách tạo những câu gọi tới các đối tượng của Python chứ không thực hiện các câu gọi REST trực tiếp. Tất cả các công cụ dòng lệnh trong OpenStack được thực thi bằng cách sử dụng Python SDK. Xem <link xlink:href="http://docs.openstack.org/user-guide/content/ch_sdk.html">OpenStack Python SDK</link> in the <citetitle>OpenStack End User Guide</citetitle>.

source: When you send API requests, you include the token in the <literal>X-Auth-Token</literal> header. If you access multiple OpenStack services, you must get a token for each service. A token is valid for a limited time before it expires. A token can also become invalid for other reasons. For example, if the roles for a user change, existing tokens for that user are invalid.
ca: Quan envies peticions a l'API, pots incloure la cadena d'autentificació a la capçalera <literal>X-Auth-Token</literal>. Si accedeixes a múltiples serveis d'OpenStack, has d'obtenir una cadena per a cada servei. Una cadena d'autentificació és vàlida per un temps limitat abans de que expiri. Una cadena pot ser invàlida per altres raons. Com per exemple, si els rols d'un usuari canvien, les cadenes d'autentificació existents per aquest usuari seran invalidades.
fr: Quand vous envoyez des requêtes API, il faut inclure le token dans le header <literal>X-Auth-Token</literal>. Si vous accédez à plusieurs services OpenStack, vous aurez besoin d'un token pour chaque service. Un token est valide pendant un temps limité avant son expiration. Un token peut également devenir non valide pour d'autres raisons. Par exemple, si les rôles d'un utilisateur changent, les tokens existant seront invalidés.
vi_vn: Khi bạn gửi những yêu cầu API, bạn phải đưa token vào trong phần header <literal>X-Auth-Token</literal> Nếu bạn truy cập vào nhiều dịch vụ OpenStack, bạn phải có một token cho mỗi dịch vụ. Một token có giá trị trong một khoảng thời gian nhất định trước khi nó hết hạn. Một token có thể trở nên vô giá trị vì những lí do khác. Ví dụ, nếu vai trò của người sử dụng thay đổi, những tokens đang tồn tại của người dùng đó sẽ vô giá trị.

source: Where <replaceable>PROJECT</replaceable> is the project name.
ca: On <replaceable>PROJECTE</replaceable> és el nom del projecte.
fr: Remplacez <replaceable>PROJECT</replaceable> par le nom du composant OpenStack.
vi_vn: Với <replaceable> PROJECT </replaceable> là tên dự án

source: You must install each client separately.
ca: Has d'instal·lar el client de forma separada.
fr: Vous devez installer chaque client séparément.
vi_vn: Bạn phải cài riêng biệt các client.

source: password (required)
vi_vn: mật khẩu (bắt buộc)

source: tenantId (Optional)
ca: tenantId (Opcional)
fr: tenantId (Optionnel)
vi_vn: tenantId (Không bắt buộc)

source: tenantName (Optional)
ca: tenantName (opcional)
fr: tenantName (Optionnel)
vi_vn: tenantName (Không bắt buộc)

source: token
vi_vn: Mã xác thực

source: token (Optional)
ca: token (Opcional)
fr: token (Optionnel)
vi_vn: token xác thực (Không bắt buộc)

source: translator-credits
ca: crèdits-dels-traductors
fr: Olivier Buisson <olivier@obn.me>, 2012 Nicholas Elvidge <nicholas.elvidge@cloudwatt.com>, 2014 François Bureau <francois.bureau@cloudwatt.com>, 2014
vi_vn: Người dịch

source: username (required)
vi_vn: username (bắt buộc)

source: For information about the command-line clients, see <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
ca: Per informació sobre els clients de línia de comandes, pots veure <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
fr: Pour plus d'informations sur les clients en ligne de commande, consultez la documentation : <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.

source: Use <placeholder-1/> to install the OpenStack clients on a Mac OS X or Linux system. It is easy and ensures that you get the latest version of the client from the <link href="http://pypi.python.org/pypi">Python Package Index</link>. Also, <placeholder-2/> lets you update or remove a package.
ca: Utilitza <placeholder-1/> per instal·lar els clients d'OpenStack a un sistema Mac OS X o Linux. És fàcil i assegura que tinguis la darrera versió del client desde <link href="http://pypi.python.org/pypi">Python Package Index</link>. A més, <placeholder-2/> et permet actualitzar i el·liminar el paquet.
fr: Utilisez <placeholder-1/> pour installer le Client OpenStack sur Mac OS X ou sur les systèmes Linux. C'est facile et vous pouvez vous assurer d'obtenir la dernière version du Client en utilisant <link href="http://pypi.python.org/pypi">l'index de paquets Python</link>. Par ailleurs, <placeholder-2/> vous permet de mettre à jour ou de supprimer le paquet.

source: For complete information about the OpenStack clients, including how to source the <filename>openrc</filename> file, see <link href="http://docs.openstack.org/user-guide/content/"><citetitle>OpenStack End User Guide</citetitle></link>, <link href="http://docs.openstack.org/user-guide-admin/content/"><citetitle>OpenStack Admin User Guide</citetitle></link>, and <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
ca: Per informació completa sobre els clients d'OpenStack, incloent com executar la comanda source a l'arxiu <filename>openrc</filename>, dirigeix-te a <link href="http://docs.openstack.org/user-guide/content/"><citetitle>OpenStack End User Guide</citetitle></link>, <link href="http://docs.openstack.org/user-guide-admin/content/"><citetitle>OpenStack Admin User Guide</citetitle></link>, and <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
fr: Pour obtenir des informations complètes sur les clients OpenStack, y compris sur comment sourcer le fichier <filename>openrc</filename>, vous pouvez consulter les documentations suivantes : <link href="http://docs.openstack.org/user-guide/content/"><citetitle>OpenStack End User Guide</citetitle></link>, <link href="http://docs.openstack.org/user-guide-admin/content/"><citetitle>OpenStack Admin User Guide</citetitle></link>, and <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.

source: For information about the default ports that the OpenStack components use, see <link href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle>Appendix A. Firewalls and default ports</citetitle></link> in the <citetitle>OpenStack Configuration Reference</citetitle>.
ca: Per informació sobre els ports per defecte que utilitzen els components d'OpenStack, dirigeix-te a <link href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle>Appendix A. Firewalls and default ports</citetitle></link> a la <citetitle>OpenStack Configuration Reference</citetitle>.
fr: Pour obtenir plus d'informations à propos des ports par défaut utilisés par les composants OpenStack, consultez <link href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle>Appendix A. Firewalls and default ports</citetitle></link> in the <citetitle>OpenStack Configuration Reference</citetitle>.

source: Although you install each OpenStack service separately, the OpenStack services work together to meet your cloud needs: Identity, Compute, Image Service, Block Storage, Networking (neutron), Object Storage, Orchestration, and Telemetry. With the <link href="http://www.trystack.org/">TryStack</link> OpenStack installation, these services work together in the background of the installation.
fr: Même si vous installez les services OpenStack séparément, ces derniers fonctionnent ensemble pour répondre à vos besoins de Cloud computing : Authentification, Compute, Service d'image, Stockage de blocs, Stockage Objets, Orchestration et Télémétrie. Avec l'installation de <link href="http://www.trystack.org/">TryStack</link>, ces services fonctionnent ensembles en arrière-plan.

source: REST clients
ca: Clients REST
fr: Clients REST

source: Both Mozilla and Google provide browser-based graphical interfaces for REST. For Firefox, see <link href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">RESTClient</link>. For Chrome, see <link href="http://code.google.com/p/rest-client/">rest-client</link>.
ca: Tant Mozilla com Google proporcionen interfícies gràfiques basades en navegador per REST. Per Firefox, dirigeix-e a <link href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">RESTClient</link>. Per Chrome, dirigeix-te a <link href="http://code.google.com/p/rest-client/">rest-client</link>.
fr: Mozilla et Google fournissent des interfaces graphiques intégrées dans le navigateur pour utiliser REST. Sous Firefox, consultez <link href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">RESTClient</link>. Sous Chrome, consultez <link href="http://code.google.com/p/rest-client/">rest-client</link>.

source: Use this SDK to write Python automation scripts that create and manage resources in your OpenStack cloud. The SDK implements Python bindings to the OpenStack API, which enables you to perform automation tasks in Python by making calls on Python objects rather than making REST calls directly. All OpenStack command-line tools are implemented by using the Python SDK. See <link href="http://docs.openstack.org/user-guide/content/ch_sdk.html">OpenStack Python SDK</link> in the <citetitle>OpenStack End User Guide</citetitle>.
ca: Utilitza aquest SDK per escriure guions d'automatització que crein i maneguin recursos al teu núvol. L'SDK implementa les connexions en Python a l'API d'OpenStack, que et permetran realitzar les taskes d'automatització utilitzant objectes Python enlloc de fer les crides REST directament. Totes les eines de línia de comandes d'OpenStack estan implementades utilitzant l'SDK de Python. Pots veure <link href="http://docs.openstack.org/user-guide/content/ch_sdk.html">OpenStack Python SDK</link> a <citetitle>OpenStack End User Guide</citetitle>.
fr: Utilisez ce SDK pour écrire en Python des scripts d'automatisation pouvant créer et gérer vos ressources dans votre Cloud OpenStack. Le SDK implémente des liaisons en Python pour l'API OpenStack. Il permet d'effectuer des tâches d'automatisation en Python en faisant des appels Python objet au lieu de faire directement des appels en REST. Tous les clients de ligne de commande OpenStack sont implémentés à l'aide du SDK Python. Retrouvez plus d'informations dans la documentation <link href="http://docs.openstack.org/user-guide/content/ch_sdk.html">OpenStack Python SDK</link> qui se trouve dans le <citetitle>OpenStack End User Guide</citetitle>.

source: OpenStack APIs
ca: APIs d'OpenStack
fr: APIs Openstack

source: username (Optional)
fr: nom d'utilisateur (Optionnel)

source: password (Optional)
fr: password (Optionnel)

source: Bad Request
ca: Petició incorrecta
fr: Requête Incorrecte

source: The tenant ID. Both the <placeholder-1/> and <placeholder-2/> are optional, but should not be specified together. If both attributes are specified, the server responds with a <placeholder-3/><placeholder-4/>.
fr: L'ID du tenant. <placeholder-1/> et <placeholder-2/> sont optionnels tous les deux, mais ils ne doivent pas être utilisés en même temps. Si les deux sont utilisés ensemble, le serveur retournera le message : <placeholder-3/><placeholder-4/>.

source: The examples in this section use cURL commands. For information about cURL, see <link href="http://curl.haxx.se/">http://curl.haxx.se/</link>. For information about the OpenStack APIs, see <link href="http://developer.openstack.org/api-ref.html">OpenStack API Reference</link>.
ca: Els exemples d'aquesta secció utilitzen comandes cURL. Per informació sobre cURL, pots veure <link href="http://curl.haxx.se/">http://curl.haxx.se/</link>. Per informació sobre les APIs d'OpenStack, pots veure <link href="http://developer.openstack.org/api-ref.html">OpenStack API Reference</link>.
fr: Les exemples de cette section utilise des commandes cURL. Pour des compléments d'informations sur cURL, voir <link href="http://curl.haxx.se/">http://curl.haxx.se/</link>. Pour plus de renseignements sur les APIs OpenStack, voir <link href="http://developer.openstack.org/api-ref.html">OpenStack API Reference</link>.

source: If you do not know your tenant name or ID, you can send an authentication request with an empty tenant, as follows:
fr: Si vous ne connaissez pas votre tenant name ou votre tenant ID, vous pouvez utiliser une requête d'authentification avec un tenant vide, par exemple :

source: This section shows how to make some Identity API and Compute API calls. For a complete list of Identity API calls, see <link href="http://developer.openstack.org/api-ref-identity-v3.html">Identity APIs</link>. For a complete list of Compute API calls, see <link href="http://developer.openstack.org/api-ref-compute-v2.html">Compute APIs and Extensions</link>.
fr: Cette section décrit comment faire des appels avec l'API d'Identification et l'API Compute. Pour une liste complète des appels de l'API Identification, voir <link href="http://developer.openstack.org/api-ref-identity-v3.html">Identity APIs</link>. Pour une liste complète de l'API Compute, voir <link href="http://developer.openstack.org/api-ref-compute-v2.html">Compute APIs and Extensions</link>.

source: Use the Identity API to request a list of tenants, as follows:
fr: Utilisez l'API d'identification pour demander la liste des tenants :

source: Use the Identity API to request a list of endpoints, as follows:
fr: Utilisez l'API d'identification pour demander une liste des points de terminaison (endpoints) :
