Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: Of course, creating a monitoring system for a single application might not make sense. To learn how to use the OpenStack Orchestration monitoring and auto-scaling capabilities to automate these steps, see :doc:`orchestration`.
de: Natürlich kann das Erstellen eines Überwachungssystems für eine einzelne Anwendung nicht sinnvoll sein. Um zu erlernen, wie man die OpenStack Orchestrierung Monitoring und Auto-Scaling-Funktionen verwendet, um diese Schritte zu automatisieren, siehe :doc:`orchestration`.
id: Tentu saja, membuat sistem pemantauan untuk satu aplikasi mungkin tidak masuk akal. Untuk mempelajari cara menggunakan pemantauan OpenStack Orchestration dan kemampuan penskalaan otomatis untuk mengotomatisasi langkah-langkah ini, lihat :doc:`orchestration`.
tr_tr: Tabi ki tek bir uygulama için izleme sistemi oluşturmak mantıklı gelmeyebilir. OpenStack Orkestrasyon izlemeyi ve bu adımları otomatikleştirmek için otomatik ölçeklendirmeyi nasıl kullanacağınızı öğrenmek için, bkz :doc:`orchestration`.

source: Of course, having access to additional resources is only part of the game plan; while you can manually add or delete resources, you get more value and more responsiveness if the application automatically requests additional resources when it needs them.
de: Natürlich ist der Zugang zu zusätzlichen Ressourcen nur ein Teil des Spielplans; während Sie Ressourcen manuell hinzufügen oder löschen können, erhalten Sie mehr Wert und mehr Reaktionsfähigkeit, wenn die Anwendung automatisch zusätzliche Ressourcen anfordert, wenn sie sie benötigen.
id: Tentu saja, memiliki akses ke sumber daya tambahan hanyalah bagian dari rencana permainan; Sementara Anda dapat menambahkan atau menghapus sumber daya secara manual, Anda mendapatkan nilai lebih dan lebih responsif jika aplikasi meminta secara otomatis sumber daya tambahan saat dibutuhkan.
tr_tr: Tabi ki ek kaynaklara erişime sahip olmak oyun planının yalnızca parçasıdır; elle kaynak ekleyip silebilseniz de, uygulama otomatik olarak ihtiyaç duyduğunda ek kaynaklar isterse bu daha değerlidir ve yanıt vermeyi artırır.

source: Once you have configured permissions, you must know where to access the application.
de: Sobald Sie Berechtigungen konfiguriert haben, müssen Sie wissen, wo Sie auf die Anwendung zugreifen können.
id: Setelah Anda mengkonfigurasi izin, Anda harus tahu di mana mengakses aplikasi.
tr_tr: İzinleri yapılandırdıktan sonra, uygulamaya nerden erişeceğinizi bilmelisiniz.

source: Once you have created a rule or group, you can also delete it:
de: Sobald Sie eine Regel oder Gruppe erstellt haben, können Sie sie auch löschen:
id: Setelah membuat aturan atau grup, Anda juga dapat menghapusnya:
tr_tr: Bir kural veya grup oluşturduktan sonra, silebilirsiniz de:

source: Once you have logged in, check to see whether the worker service process is running as expected. You can find the logs of the worker service in the directory :code:`/var/log/supervisor/`.
de: Sobald Sie angemeldet sind, überprüfen Sie, ob der Worker-Service-Prozess wie erwartet ausgeführt wird. Sie finden die Protokolle des Worker Service im Verzeichnis :code:`/var/log/supervisor/`.
id: Setelah Anda masuk (logged in), periksa untuk melihat apakah proses layanan pekerja berjalan seperti yang diharapkan. Anda dapat menemukan log dari layanan pekerja di direktori :code:`/var/log/supervisor/`.
tr_tr: Giriş yaptıktan sonra işçi servis sürecinin beklendiği şekilde çalışıp çalışmadığını kontrol edin. İşçi servisi kayıtlarını :code:`/var/log/supervisor/` dizini altında bulabilirsiniz.

source: One of the latest trends in scalable cloud application deployment is `continuous integration <http://en.wikipedia.org/wiki/Continuous_integration>`_ and `continuous deployment <http://en.wikipedia.org/wiki/Continuous_delivery>`_ (CI/CD).
de: Einer der neuesten Trends in der skalierbaren Cloud-Anwendung ist die 'kontinuierliche Integration' <http://en.wikipedia.org/wiki/Continuous_integration> `` und `kontinuierliche Bereitstellung <http://en.wikipedia.org/wiki/Continuous_delivery> `_ (CI / CD).
id: Salah satu tren terbaru penerapan aplikasi cloud scalable ini `continuous integration <http://en.wikipedia.org/wiki/Continuous_integration>`_ dan `continuous deployment <http://en.wikipedia.org/wiki/Continuous_delivery>`_ (CI/CD).
tr_tr: Ölçeklenebilir bulut uygulama kurulumlarında son eğilim `sürekli tümleştirme <http://en.wikipedia.org/wiki/Continuous_integration>`_ ve `sürekli kurulum <http://en.wikipedia.org/wiki/Continuous_delivery>`_ (CI/CD).

source: Open :code:`top` to monitor the CPU usage of the :code:`faafo-worker` process.
de: Starten Sie :code:`top` zur Überwachung der CPU-Nutzung des :code:`faafo-worker` process.
id: Buka :code:`top` untuk memantau penggunaan CPU dari proses :code:`faafo-worker`.
tr_tr: :code:`top` uygulamasını açıp :code:`faafo-worker` sürecinin CPU kullanımını izleyin.

source: OpenStack Object Storage automatically replicates each object at least twice before returning 'write success' to your API call. A good strategy is to keep three copies of objects, by default, at all times, replicating them across the system in case of hardware failure, maintenance, network outage, or another kind of breakage. This strategy is very convenient for app creation. You can just dump objects into object storage and not worry about the additional work that it takes to keep them safe.
de: OpenStack Object Storage repliziert automatisch jedes Objekt mindestens zweimal, bevor er 'write success' in Ihren API-Aufruf zurückgibt. Eine gute Strategie ist es, drei Exemplare von Objekten standardmäßig zu halten, indem sie sie im Falle eines Hardwarefehlers, einer Wartung, eines Netzwerkausfalls oder einer anderen Art von Bruch über das System replizieren. Diese Strategie ist sehr praktisch für die App-Erstellung. Sie können einfach Objekte in Objektspeicher reintun und sich nicht um die zusätzliche Arbeit kümmern, die es braucht, um sie sicher zu halten.
id: OpenStack Object Storage secara otomatis mereplikasi setiap objek setidaknya dua kali sebelum mengembalikan 'write success' ke panggilan API Anda. Strategi yang bagus adalah menyimpan tiga salinan objek, secara default, setiap saat, mereplikasi di seluruh sistem jika terjadi kegagalan perangkat keras, perawatan, pemadaman jaringan, atau jenis kerusakan lainnya. Strategi ini sangat cocok untuk pembuatan aplikasi. Anda bisa membuang barang (dump object) ke dalam penyimpanan objek dan tidak khawatir dengan pekerjaan tambahan yang diperlukan agar mereka tetap aman.
tr_tr: OpenStack Nesne Depolama API çağrınıza 'yazma başarılı' döndürmeden önce her nesneyi otomatik olarak en az iki kere yedekler. Donanım arızası, bakım, ağ kesintisi veya başka bir şeylerin kırılması durumuna karşı sistemde tüm nesnelerin öntanımlı olarak her zaman üç kopyasını tutmak iyi bir stratejidir. Bu strateji uygulama oluşturmada çok kolaylık sağlar. Nesneleri direk nesne depolamaya atar ve güvenli tutmak için gerekli olan ek iş yükünü düşünmezsiniz.

source: OpenStack SDK for Microsoft .NET
de: OpenStack SDK für Microsoft .NET
id: OpenStack SDK untuk Microsoft .NET
tr_tr: Microsoft .NET için OpenStack SDK

source: OpenStack provides a couple of tools that make it easy to back up data. If your provider runs OpenStack Object Storage, you can use its API calls and CLI tools to work with archive files.
de: OpenStack bietet ein paar Tools, die es einfach machen, Daten zu sichern. Wenn Ihr Provider OpenStack Object Storage anbietet, können Sie mit seinen API-Aufrufen und CLI-Tools mit Archivdateien arbeiten.
id: OpenStack menyediakan beberapa tool yang memudahkan backup data. Jika penyedia Anda menjalankan OpenStack Object Storage, Anda dapat menggunakan API call dan CLI tool untuk bekerja dengan file arsip.
tr_tr: OpenStack veri yedeklemeyi kolaylaştıran bir takım araç sağlar. Sağlayıcınız OpenStack Nesne Depolama çalıştırıyorsa, API çağrılarını ve CLI araçlarını kullanarak arşiv dosyalarıyla çalışabilirsiniz.

source: OpenStack supports 'regions', which are geographically-separated installations that are connected to a single service catalog. This section explains how to expand the Fractal application to use multiple regions for high availability.
de: OpenStack unterstützt 'Regionen', die geografisch getrennte Installationen sind, die mit einem einzigen Dienstkatalog verbunden sind. In diesem Abschnitt wird erläutert, wie die Fractal-Anwendung erweitert werden kann, um mehrere Regionen für eine hohe Verfügbarkeit zu verwenden.
id: OpenStack mendukung 'regions', yang merupakan instalasi yang dipisahkan secara geografis yang terhubung ke katalog layanan tunggal. Bagian ini menjelaskan bagaimana memperluas aplikasi Fractal untuk menggunakan beberapa daerah untuk ketersediaan tinggi (high availability).
tr_tr: OpenStack tek bir servis kataloğuna bağlı olana coğrafik olarak ayrılmış kurulumlar olan 'bölgeler'i destekler. Bu kısım yüksek kullanılırlık için Fraktal uygulamasını nasıl birden fazla bölgeye genişleterek kullanacağınızı anlatır.

source: Or, try one of these tutorial steps:
de: Oder versuchen Sie eines dieser Tutorial Schritte:
id: Atau, cobalah salah satu langkah tutorial berikut:
tr_tr: Veya şu öğretici adımlarından birini deneyin:

source: Orchestration
de: Orchestrierung
tr_tr: Orkestrasyon

source: Other features, such as creating volume snapshots, are useful for backups:
de: Weitere Features, wie das Erstellen von Volume-Snapshots, sind für Backups nützlich:
id: Fitur lainnya, seperti membuat snapshot volume, berguna untuk backup:
tr_tr: Birim anlık görüntüleri almak gibi diğer özellikler yedekler için faydalıdır:

source: Other versions of this guide show you how to use the other SDKs and languages to complete these tasks. If you are a developer for another toolkit that you would like this guide to include, feel free to submit code snippets. For more information, contact `OpenStack Documentation team <https://wiki.openstack.org/Documentation>`_ members.
de: Andere Versionen dieses Handbuchs zeigen Ihnen, wie Sie die anderen SDKs und Sprachen verwenden, um diese Aufgaben abzuschließen. Wenn Sie ein Entwickler für ein anderes Toolkit sind, dass Sie diesen Leitfaden einschließen möchten, fühlen Sie sich frei, Code-Snippets einzureichen. Für weitere Informationen wenden Sie sich bitte an `OpenStack Documentation Team <https://wiki.openstack.org/Documentation> `_ Mitglieder.
id: Versi lain dari panduan ini menunjukkan cara menggunakan SDK dan bahasa lainnya untuk menyelesaikan tugas ini. Jika Anda adalah pengembang untuk toolkit lain yang ingin disertakan dalam panduan ini, jangan ragu untuk mengirimkan cuplikan kode. Untuk informasi lebih lanjut, hubungi anggota `OpenStack Documentation team <https://wiki.openstack.org/Documentation>`_.
tr_tr: Bu kılavuzun diğer sürümleri diğer SDK'ları ve dilleri kullanarak bu görevleri nasıl gerçekleştireceğinizi gösterir. Bu kılavuzda dahil edilmesini istediğiniz başka bir aracın geliştiricisi iseniz kod parçaları göndermeye çekinmeyin. Daha fazla bilgi için, `OpenStack Belgelendirme takımı <https://wiki.openstack.org/Documentation>`_ üyeleriyle iletişime geçin.

source: Otherwise, continue reading to learn how to work with, and move the Fractal application database server to use, block storage.
de: Andernfalls lesen Sie weiter, um zu lernen, wie Sie arbeiten können, und verschieben Sie den Fractal-Anwendungsdatenbank-Server, um den Speicher zu blockieren.
id: Jika tidak, lanjutkan membaca untuk belajar bagaimana bekerja dengan, dan memindahkan server database aplikasi Fractal untuk digunakan, blokir penyimpanan.
tr_tr: Aksi halde, Fraktal uygulama veritabanı sunucusunu blok depolama kullanacak şekilde nasıl taşıyacağınızı ve nasıl çalışacağınızı öğrenmek için okumaya devam edin.

source: Our code samples use `Java 8 <http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html>`_.
de: Unsere Code-Samples verwenden `Java 8 <http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html> `_.
id: Sampel kode kami digunakan `Java 8 <http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html>`_.
tr_tr: Kod örneklerimiz `Java 8 <http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html>`_ kullanır.

source: PHP-OpenCloud supports the OpenStack Networking API, but this section has not been completed.
de: PHP-OpenCloud unterstützt die OpenStack Networking API, aber dieser Abschnitt wurde noch nicht abgeschlossen.
id: PHP-OpenCloud mendukung OpenStack Networking API, namun bagian ini belum selesai.
tr_tr: PHP-OpenCloud OpenStack Ağ API'sini destekler ama bu kısım henüz tamamlanmadı.

source: PHP-opencloud supports OpenStack Orchestration :D:D:D but this section is not written yet.
de: PHP-opencloud unterstützt OpenStack Orchestrierung: D:D:D aber dieser Abschnitt ist noch nicht geschrieben.
id: PHP-opencloud mendukung OpenStack Orchestration :D:D:D tapi bagian ini belum ditulis.
tr_tr: PHP-opencloud OpenStack Orkestrasyon'u destekliyor :D:D:D ama bu kısım henüz yazılmadı.

source: Perhaps you can `contribute <https://docs.openstack.org/contributor-guide/>`_?
de: Vielleicht können Sie dazu beitragen <https://docs.openstack.org/contributor-guide/> `_
tr_tr: Belki siz de `katkıda bulunabilirsiniz <https://docs.openstack.org/contributor-guide/>`_?

source: Phoenix servers
de: Phoenix-Server
id: Server Phoenix
tr_tr: Phoenix sunucuları

source: Pkgcloud supports OpenStack Orchestration :D:D:D but this section is `not written yet <https://github.com/pkgcloud/pkgcloud/blob/master/docs/providers/openstack/orchestration.md>`_
de: Pkgcloud unterstützt OpenStack Orchestration: D:D:D aber dieser Abschnitt ist noch nicht geschrieben <https://github.com/pkgcloud/pkgcloud/blob/master/docs/providers/openstack/orchestration.md> `_
id: Pkgcloud mendukung OpenStack Orchestration :D:D:D tapi bagian ini `not written yet <https://github.com/pkgcloud/pkgcloud/blob/master/docs/providers/openstack/orchestration.md>`_
tr_tr: Pkgcloud OpenStack Orkestrasyon'u destekliyor :D:D:D ama bu kısım `henüz yazılmadı <https://github.com/pkgcloud/pkgcloud/blob/master/docs/providers/openstack/orchestration.md>`_

source: Pkgcloud supports the OpenStack Networking API, but this section has not been completed.
de: Pkgcloud unterstützt die OpenStack Networking API, aber dieser Abschnitt wurde noch nicht abgeschlossen.
id: Pkgcloud mendukung OpenStack Networking API, namun bagian ini belum selesai.
tr_tr: Pkgcloud OpenStack Ağ API'sini destekler ama bu kısım henüz tamamlanmadı.

source: Place the above pom.xml into the root directory of your project. Then create the nested subdirectory tree :code:`src` -> :code:`main` -> :code:`java`. Place the Java code samples that you copy from this book into the folder named ":code:`java`".
de: Lege die obige pom.xml in das Wurzelverzeichnis Ihres Projekts. Dann erstellen Sie den verschachtelten Unterverzeichnisbaum :code: `src` ->:code:` main` ->:code: `java`. Legen Sie die Java-Code-Beispiele, die Sie aus diesem Buch kopieren, in den Ordner mit dem Namen ':code:` java` '.
id: Tempatkan pom.xml di atas ke dalam direktori root proyek Anda. Kemudian buat pohon subdirektori nested :code:`src` -> :code:`main` -> :code:`java`. Tempatkan contoh kode Java yang Anda salin dari buku ini ke dalam folder bernama ":code:`java`".
tr_tr: Yukarıdaki pom.xml dosyasını projenizin kök dizinine yerleştirin. Ardından :code:`src` -> :code:`main` -> :code:`java` iç içe dizinlerini oluşturun. Bu kitaptan kopyaladığınız Java kod örneklerini ":code:`java`" isimli dizine koyun.

source: Place the images in the :code:`fractals` container:
de: Legen Sie die Bilder in den :code: `Fraktale` Container:
id: Tempatkan image di kontainer :code:`fractals`:
tr_tr: İmajları :code:`fraktallar` kapsayıcısına koyun:

source: Previously, you manually created the database, which is useful for a single database that you rarely update. However, the OpenStack :code:`trove` component provides Database as a Service (DBaaS).
de: Bisher haben Sie die Datenbank manuell erstellt, was für eine einzige Datenbank nützlich ist, die Sie selten aktualisieren. Allerdings bietet die OpenStack :code: `trove`-Komponente Datenbank als Service (DBaaS).
id: Sebelumnya, Anda secara manual membuat database, yang berguna untuk database tunggal yang jarang Anda update. Namun, komponen OpenStack :code:`trove` menyediakan Database sebagai Layanan (DBaaS).
tr_tr: Daha önce, veritabanını elle oluşturdunuz, bu nadiren güncellenen tek veritabanları için kullanışlıdır. Ancak OpenStack :code:`trove` bileşeni Servis olarak Veritabanı (DBaaS) sağlar.

source: Prior to this section, the network layout for the Fractal application would be similar to the following diagram:
de: Vor diesem Abschnitt wäre das Netzwerklayout für die Fractal-Anwendung ähnlich dem folgenden Diagramm:
id: Sebelum bagian ini, tata letak jaringan untuk aplikasi Fraktal akan serupa dengan diagram berikut:
tr_tr: Bu kısım öncesinde, Fraktal uygulama için ağ düzeni şu çizime benzer olurdu:

source: Programmatic interfaces (APIs)
de: Programmatische Schnittstellen (APIs)
tr_tr: Programlama arayüzleri (API'ler)

source: Regions and geographic diversity
de: Regionen und geografische Vielfalt
id: Kawasan dan keanekaragaman geografis
tr_tr: Bölgeler ve coğrafi çeşitlilik

source: Remove the existing app
de: Entfernen Sie die vorhandene App
id: Hapus aplikasi yang ada
tr_tr: Mevcut uygulamayı kaldırın

source: Removing the egress rule created by OpenStack will cause your instance networking to break.
de: Das Entfernen der von OpenStack erstellten Ausstiegsregel wird dazu führen, dass Ihre Instanz-Netzwerke zusammenbrechen.
id: Menghapus aturan egress yang dibuat oleh OpenStack akan menyebabkan jaringan instance Anda terputus.
tr_tr: OpenStack tarafından oluşturulan Egress kuralı kaldırmak sunucu ağınızın bozulmasına yol açar.

source: Replace :code:`IP_API_1` and :code:`IP_API_2` with the corresponding floating IPs. Replace FRACTAL_UUID with the UUID of an existing fractal.
de: Ersetzen Sie :code:`IP_API_1` und :code:`IP_API_2` mit den entsprechenden Floating IPs. Ersetzen Sie FRACTAL_UUID durch die UUID eines vorhandenen Fraktals.
id: Ganti :code:`IP_API_1` dan :code:`IP_API_2` dengan IP mengambang yang sesuai. Ganti FRACTAL_UUID dengan UUID dari fraktal yang ada.
tr_tr: :code:`IP_API_1` ve :code:`IP_API_2` değerlerini ilişkili değişken IP'lerle değiştirin. FRACTAL_UUID anahtarını mevcut bir fraktalın UUID değeriyle değiştirin.

source: Replace :code:`IP_API_1` with the IP address of the API instance.
de: Ersetzen Sie :code: `IP_API_1` mit der IP-Adresse der API-Instanz.
id: Ganti :code:`IP_API_1` dengan alamat IP dari instance API.
tr_tr: :code:`IP_API_1` anahtarını API sunucusunun IP adresiyle değiştirin.

source: Replace :code:`IP_API_1` with the IP address of the first API instance and USERNAME with the appropriate user name.
de: Ersetzen Sie :code:`IP_API_1` mit der IP-Adresse der ersten API-Instanz und USERNAME mit dem entsprechenden Benutzernamen.
id: Ganti :code:`IP_API_1` dengan alamat IP dari instance API pertama dan USERNAME dengan nama pengguna yang sesuai.
tr_tr: :code:`IP_API_1` anahtarını ilk API sunucunun IP adresiyle ve USERNAME anahtarını uygun kullanıcı adıyla değiştirin.

source: Replace :code:`IP_CONTROLLER` with the IP address of the controller instance and USERNAME to the appropriate user name.
de: Ersetzen Sie :code:`IP_CONTROLLER` mit der IP-Adresse der Controller-Instanz und USERNAME an den entsprechenden Benutzernamen.
id: Ganti :code:`IP_CONTROLLER` dengan alamat IP dari instance controller dan USERNAME ke nama pengguna yang sesuai.
tr_tr: :code:`IP_CONTROLLER` anahtarını kontrol sunucusunun adresiyle ve USERNAME değerini uygun kullanıcı adıyla değiştirin.

source: Replace :code:`IP_CONTROLLER` with the IP address of the controller instance and USERNAME with the appropriate user name.
de: Ersetzen Sie :code:`IP_CONTROLLER` mit der IP-Adresse der Controller-Instanz und USERNAME mit dem entsprechenden Benutzernamen.
id: Ganti :code:`IP_CONTROLLER` dengan alamat IP dari instance controller dan USERNAME dengan nama pengguna yang sesuai.
tr_tr: :code:`IP_CONTROLLER` anahtarını kontrol sunucusunun IP adresiyle ve USERNAME anahtarını uygun kullanıcı adıyla değiştirin.

source: Replace :code:`IP_CONTROLLER` with the IP address of the controller instance.
de: Ersetzen Sie :code:`IP_CONTROLLER` mit der IP-Adresse der Controller-Instanz.
id: Ganti :code:`IP_CONTROLLER` dengan alamat IP dari instance controller.
tr_tr: :code:`IP_CONTROLLER` anahtarını kontrol sunucusunun IP adresiyle değiştirin.

source: Replace :code:`IP_DATABASE` with the IP address of the database instance and USERNAME to the appropriate user name.
de: Ersetzen Sie :code: `IP_DATABASE` mit der IP-Adresse der Datenbankinstanz und USERNAME an den entsprechenden Benutzernamen.
id: Ganti :code:`IP_DATABASE` dengan alamat IP dari instance database dan USERNAME ke nama pengguna yang sesuai.
tr_tr: :code:`IP_DATABASE` anahtarını veritabanı sunucusunun IP adresiyle ve USERNAME değerini uygun kullanıcı adıyla değiştirin.

source: Replace :code:`IP_WORKER_1` with the IP address of the worker instance and USERNAME to the appropriate user name.
de: Ersetzen Sie :code:`IP_WORKER_1` mit der IP-Adresse der Workerinstanz und USERNAME mit den entsprechenden Benutzernamen.
id: Menggantikan :code:`IP_WORKER_1` Dengan alamat IP dari instance pekerja dan USERNAME ke nama pengguna yang sesuai.
tr_tr: :code:`IP_WORKER_1` anahtarını işçi sunucunun IP adresi ile ve USERNAME anahtarını uygun kullanıcı adı ile değiştirin.

source: Replace :code:`IP_WORKER` with the IP address of the worker instance and USERNAME with the appropriate user name.
de: Ersetzen Sie :code:`IP_WORKER` mit der IP-Adresse der Worker-Instanz und USERNAME mit dem entsprechenden Benutzernamen.
id: Ganti :code:`IP_WORKER` dengan alamat IP dari instance pekerja dan USERNAME dengan nama pengguna yang sesuai.
tr_tr: :code:`IP_WORKER` anahtarını işçi sunucunun IP adresiyle ve USERNAME anahtarını uygun kullanıcı adıyla değiştirin.

source: Ruby
de: Rubin

source: Run the :code:`ceilometer_statistics_query`: command to see the derived statistics.
de: Führen Sie den Befehl :code:`ceilometer_statistics_query` aus, um die abgeleiteten Statistiken zu sehen.
id: Jalankan perintah :code:`ceilometer_statistics_query`: untuk melihat statistik turunan.
tr_tr: :code:`ceilometer_statistics_query`: komutunu çalıştırarak gelen istatistiklere göz atın.

source: Run the :code:`nova list` command to confirm that the :code:`OS::Heat::AutoScalingGroup` has created more instances:
de: Führen Sie den Befehl :code:`nova list` aus, um zu bestätigen, dass der :code:`OS::Heat::AutoScalingGroup` mehr Instanzen erstellt hat:
id: Jalankan perintah :code:`nova list` untuk memastikan bahwa :code:`OS::Heat::AutoScalingGroup` telah menciptakan lebih banyak instance:
tr_tr: :code:`nova list` komutunu çalıştırarak :code:`OS::Heat::AutoScalingGroup`'un daha fazla sunucu oluşturduğunuz onaylayın:

source: Run the :code:`nova list` command to confirm that the :code:`OS::Heat::AutoScalingGroup` removed the unneeded instances:
de: Führen Sie den Befehl :code:`nova list` aus, um zu bestätigen, dass der :code:`OS::Heat::AutoScalingGroup` die nicht benötigten Instanzen entfernt hat:
id: Jalankan perintah :code:`nova list` untuk memastikan bahwa :code:`OS::Heat::AutoScalingGroup` menghapus instance yang tidak dibutuhkan:
tr_tr: :code:`nova list` komutunu çalıştırarak :code:`OS::Heat::AutoScalingGroup`'un gereksiz sunucuları kaldırdığını onaylayın:
