Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: Run the :code:`nova list` command. This template created three instances:
de: Führen Sie den Befehl :code:`nova list` aus. Diese Vorlage hat drei Instanzen erstellt:
id: Jalankan perintah :code:`nova list`. Template ini membuat tiga instance:
tr_tr: :code:`nova list` komutunu çalıştırın. Bu şablon üç sunucu oluşturdu:

source: Run the script to start the deployment.
de: Führen Sie das Skript aus, um die Bereitstellung zu starten.
id: Jalankan skrip untuk memulai pengerahan.
tr_tr: Kurulumu başlatmak için betiği çalıştırın.

source: SDKs do not generally support the service yet, but you can use the 'trove' command-line client to work with it instead.
de: SDKs unterstützen den Dienst noch nicht, aber Sie können den Kommandozeilenclient 'trove' verwenden, um dort zu arbeiten.
id: SDK pada umumnya tidak mendukung layanan ini, namun Anda bisa menggunakan 'trove' command-line client untuk bekerja dengannya.
tr_tr: SDK'lar henüz servisi genel olarak desteklemez, ama 'trove' komut satırı istemcisini kullanarak çalışabilirsiniz.

source: Scalability
de: Skalierbarkeit
id: Skalabilitas
tr_tr: Ölçeklenebilirlik

source: Scale available resources up and down.
de: Skalieren Sie verfügbare Ressourcen auf und ab.
id: Skala sumber daya yang tersedia naik dan turun.
tr_tr: Uygun kaynakları yukarı aşağı ölçekleyin.

source: Scale the API service
de: Skalieren Sie den API-Dienst
id: Skala layanan API
tr_tr: API servisini ölçekleyin

source: Scale the workers
de: Skalieren Sie die Worker
id: Skala pekerja
tr_tr: İşçileri ölçekleyin

source: Scaling out
de: Skalieren
tr_tr: Dışa ölçekleme

source: Security
de: Sicherheit
id: Keamanan
tr_tr: Güvenlik

source: Security groups are sets of network access rules that are applied to an instance's networking. By default, only egress (outbound) traffic is allowed. You must explicitly enable ingress (inbound) network access by creating a security group rule.
de: Sicherheitsgruppen sind Sätze von Netzwerkzugriffsregeln, die auf die Vernetzung einer Instanz angewendet werden. Standardmäßig ist nur Austritt (ausgehender) Verkehr erlaubt. Sie müssen explizit den Eintritt (Eingang) des Netzwerkzugriffs aktivieren, indem Sie eine Sicherheitsgruppenregel erstellen.
id: Kelompok keamanan adalah kumpulan aturan akses jaringan yang diterapkan pada jaringan instance. Secara default, hanya lalu lintas jalan keluar (outbound) yang diperbolehkan. Anda harus secara eksplisit mengaktifkan akses jaringan masuk (inbound) dengan membuat aturan kelompok keamanan.
tr_tr: Güvenlik grupları bir sunucunun ağına uygulanan ağ erişim kuralları kümesidir. Öntanımlı olarak egress (dışarı yönde) trafiğe izin verilir. Bir güvenlik grubu kuralı oluşturarak özellikle ingress (içe doğru) ağ erişimine izin vermeniz gerekir.

source: Security is important when it comes to your instances; you can not have just anyone accessing them. To enable logging into an instance, you must provide the public key of an SSH key pair during instance creation. In section one, you created and uploaded a key pair to OpenStack, and cloud-init installed it for the user account.
de: Sicherheit ist wichtig, wenn es um Ihre Instanzen geht; es kann nicht jeder auf sie zugreifen. Um die Anmeldung in einer Instanz zu aktivieren, müssen Sie während der Instanzerstellung den öffentlichen Schlüssel eines SSH-Schlüsselpaars angeben. Im Abschnitt Eins haben Sie ein Schlüsselpaar zu OpenStack erstellt und hochgeladen und Cloud-init für das Benutzerkonto installiert.
id: Keamanan penting bila menyangkut instance Anda; Anda tidak bisa memiliki siapa pun yang mengaksesnya. Untuk mengaktifkan masuk ke sebuah instance, Anda harus menyediakan kunci publik dari pasangan kunci SSH selama pembuatan instance. Pada bagian pertama, Anda membuat dan mengunggah pasangan kunci ke OpenStack, dan cloud-init memasangnya untuk akun pengguna.
tr_tr: Konu sunucularınız olduğunda güvenlik önemlidir; herhangi birinin erişebilmesini istemezsiniz. Sunucuya girişi etkinleştirmek için, sunucu oluşturma sırasında bir SSH anahtar çiftinin açık anahtarını sağlamalısınız. Birinci kısımda OpenStack'e bir anahtar oluşturup yüklediniz, ve cloud-init kullanıcı hesabı için bunu yükledi.

source: See `configure shade <http://git.openstack.org/cgit/openstack/os-client-config/tree/README.rst>`_, to configure your cloud using a profile.
de: Siehe `configure shade <http://git.openstack.org/cgit/openstack/os-client-config/tree/README.rst> `_, um Ihre Cloud mit einem Profil zu konfigurieren.
tr_tr: Bulutunuzu bir profil kullanarak yapılandırmak için `shade yapılandırmasına <http://git.openstack.org/cgit/openstack/os-client-config/tree/README.rst>`_ göz atın.

source: See the state of the alarms set up by the template:
de: Sehen Sie den Zustand der Alarme, die von der Vorlage eingerichtet wurden:
id: Lihat keadaan alarm yang diatur oleh template:
tr_tr: Şablon tarafından ayarlanan uyarı durumlarına göz atın:

source: Set the image and size variables to appropriate values for your cloud. We will use these variables in later sections.
de: Setzen Sie die Abbild- und Größenvariablen auf entsprechende Werte für Ihre Cloud. Wir werden diese Variablen in späteren Abschnitten verwenden.
id: Tetapkan variabel image dan ukuran ke nilai yang sesuai untuk awan Anda. Kami akan menggunakan variabel-variabel ini di bagian selanjutnya.
tr_tr: İmaj ve boyut değişkenlerini bulutunuz için uygun değerlere ayarlayın. Bu değişkenleri ilerleyen kısımlarda kullanacağız.

source: Shade's create_object function has a "use_slo" parameter (that defaults to true) which will break your object into smaller objects for upload and rejoin them if needed.
de: Shade's create_object-Funktion hat einen 'use_slo' -Parameter (der standardmäßig auf true), der Ihr Objekt in kleinere Objekte zum Hochladen zerbricht und bei Bedarf wieder zusammenbringt.
id: Fungsi shade's create_object memiliki parameter "use_slo" (yang default true) yang akan memecah objek Anda menjadi objek yang lebih kecil untuk diunggah dan bergabung kembali dengannya jika diperlukan.
tr_tr: Shade'in create_object fonksiyonu nesnenizi yüklerken ve gerektiğinde tekrar birleştirirken kullanılmak üzere küçük parçalara bölen (öntanımlı değeri doğru olan) bir "use_slo" parametresine sahiptir.

source: Similar to the UNIX programming model, an object, such as a document or an image, is a "bag of bytes" that contains data. You use containers to group objects. You can place many objects inside a container, and your account can have many containers.
de: Ähnlich wie bei dem UNIX-Programmiermodell ist ein Objekt wie ein Dokument oder ein Bild ein 'Beutel von Bytes', der Daten enthält. Sie verwenden Container, um Objekte zu gruppieren. Sie können viele Objekte in einem Container platzieren, und Ihr Konto kann viele Container haben.
id: Mirip dengan model pemrograman UNIX, sebuah objek, seperti dokumen atau image, adalah "bag of bytes" yang berisi data. Anda menggunakan kontainer untuk mengelompokkan objek. Anda dapat menempatkan banyak benda di dalam kontainer, dan akun Anda dapat memiliki banyak kontainer.
tr_tr: UNIX programlama modeline benzer şekilde, bir nesne, örneğin bir belge veya imaj, veri içeren bir "baytlar çantasıdır". Kapsayıcıları kullanarak nesneleri gruplarsınız. Bir kapsayıcıya birçok nesne koyabilirsiniz, ve hesabınız birçok kapsayıcıya sahip olabilir.

source: So what exactly was that request doing at the end of the previous section? Let us look at it again. In this subsection, we are just explaining what you have already done in the previous section; you do not need to run these commands again.
de: Also, was genau war die Frage am Ende des vorherigen Abschnitts? Lassen Sie uns es noch einmal anschauen. In diesem Unterabschnitt erklären wir nur, was Sie bereits im vorigen Abschnitt gemacht haben. Sie müssen diese Befehle nicht mehr ausführen.
id: Jadi apa sebenarnya permintaan itu di akhir bagian sebelumnya? Mari kita lihat lagi. Dalam subbagian ini, kami hanya menjelaskan apa yang telah Anda lakukan di bagian sebelumnya; Anda tidak perlu menjalankan perintah ini lagi.
tr_tr: Öyleyes önceki kısmın sonundaki istek tam olarak ne yapıyordu? Tekrar bir bakalım. Bu alt kısımda önceki kısımda zaten yaptığınız şeyleri açıklayacağız; bu komutları tekrar çalıştırmanıza gerek yok.

source: So, for example, the file named :code:`GettingStarted.java` from the end of this chapter would be located as follows:
de: So würde zum Beispiel die Datei mit dem Namen :code: `GettingStarted.java` am Ende dieses Kapitels wie folgt liegen:
id: Jadi, misalnya, file yang bernama :code:`GettingStarted.java` dari akhir bab ini akan ditempatkan sebagai berikut:
tr_tr: Örneğin bu bölümün sonundaki :code:`GettingStarted.java` dosyasını şu şekilde konulmalı:

source: Specify a network during instance build
de: Geben Sie während des Instanzbaus ein Netzwerk an
id: Tentukan jaringan selama pembangunan instance
tr_tr: Sunucu inşası sırasında bir ağ belirtin

source: Specify an external gateway for your router to tell OpenStack which network to use for Internet access.
de: Geben Sie ein externes Gateway für Ihren Router an, um OpenStack mitzuteilen, welches Netzwerk für den Internet-Zugang verwendet werden soll.
id: Tentukan gateway eksternal untuk router Anda untuk memberitahu OpenStack yang jaringannya akan digunakan untuk akses Internet.
tr_tr: Yönlendiriciniz için bir harici geçit belirterek OpenStack'e internet erişimi için hangi ağı kullanacağını söyleyin.

source: Specify the flavor ID that you would like to use.
de: Geben Sie die Varianten-ID an, die Sie verwenden möchten.
id: Tentukan ID flavor yang ingin Anda gunakan.
tr_tr: Kullanmak istediğiniz nitelik kimliğini belirtin.

source: Spend some time playing with the stack and the Fractal app to see how it works.
de: Verbringen Sie einige Zeit mit dem Stack und der Fractal App zu sehen, wie es funktioniert.
id: Luangkan waktu untuk bermain dengan stack dan aplikasi Fractal untuk melihat cara kerjanya.
tr_tr: Yığınla ve Fraktal uygulamasıyla oynayarak biraz daha zaman geçirin ve nasıl çalıştığını görün.

source: Split the database and message queue
de: Teilen Sie die Datenbank und die Nachrichtenwarteschlange
id: Memisahkan database dan message queue
tr_tr: Veritabanı ve ileti kuyruğunu ayırın

source: Splitting services across multiple instances
de: Aufteilung von Diensten über mehrere Instanzen hinweg
id: Memisahkan layanan di beberapa instance
tr_tr: Servisleri birden çok sunucuya ayırmak

source: Start by creating a security group for the all-in-one instance and adding the appropriate rules, such as HTTP (TCP port 80) and SSH (TCP port 22):
de: Beginnen Sie mit dem Erstellen einer Sicherheitsgruppe für die All-in-One-Instanz und Hinzufügen der entsprechenden Regeln wie HTTP (TCP-Port 80) und SSH (TCP-Port 22):
id: Mulailah dengan membuat grup keamanan untuk instance all-in-one dan menambahkan aturan yang sesuai, seperti HTTP (port TCP 80) dan SSH (port TCP 22):
tr_tr: Herşeyi içeren sunucunuz için bir güvenlik grubu oluşturarak ve uygun kuralları ekleyerek, örneğin HTTP (TCP bağlantı noktası 80) ve SSH (TCP bağlantı noktası 22) başlayın:

source: Start by looking at what is already in place.
de: Beginnen Sie mit dem Betrachten, was bereits vorhanden ist.
id: Mulailah dengan melihat apa yang sudah ada.
tr_tr: Zaten yerinde olan şeylere bakarak başlayın.

source: Stop the running MySQL database service and move the database files from :file:`/var/lib/mysql` to the new volume, which is temporarily mounted at :file:`/mnt/database`.
de: Stoppen Sie den laufenden MySQL-Datenbankdienst und verschieben Sie die Datenbankdateien aus :file: `/var/lib/mysql` auf das neue Volume, das vorübergehend an: file :`/mnt/database` angebracht ist.
id: Hentikan layanan database MySQL yang berjalan dan pindahkan file database dari :file:`/var/lib/mysql` ke volume baru, yang sementara dipasang di :file:`/mnt/database`.
tr_tr: Çalışan MySQL veritabanı servisini durdurun ve veritabanı dosyalarını :file:`/var/lib/mysql` konumundan geçici olarak :file:`/mnt/database` konumuna bağlanmış olan yeni birime taşıyın.

source: Swift metadata keys are prepended with "x-object-meta-" so when you get the object with get_object(), in order to get the value of the metadata your key will be "x-object-meta-foo".
de: swift Metadatentasten werden mit 'x-object-meta-' vorangestellt, also wenn Sie das Objekt mit get_object () bekommen, um den Wert der Metadaten zu erhalten, wird Ihr Schlüssel 'x-object-meta-foo' sein.
id: Swift metadata keys ditambahkan dengan "x-object-meta-" juga saat Anda mendapatkan objek dengan get_object (), untuk mendapatkan nilai metadata, key Anda akan menjadi "x-object-meta-foo".
tr_tr: Swift metaveri anahtarlarının önüne bir "x-object-meta-" değeri gelir böylece get_object() ile nesneyi aldığınızda metaveri değerini alabilmeniz için anahtar "x-object-meta-foo" olur.

source: Sync the file systems and mount the block device that contains the database files to :file:`/var/lib/mysql`.
de: Synchronisieren Sie die Dateisysteme und montieren Sie das Blockgerät, das die Datenbankdateien enthält, an :file: `/var/lib/mysql`.
id: Sinkronkan sistem file dan mount perangkat blok yang berisi file database ke :file:`/var/lib/mysql`.
tr_tr: Dosya sistemlerini eşzamanlayın ve veritabanı dosyalarını içeren blok aygıtı :file:`/var/lib/mysql` konumuna bağlayın.

source: That brings us to where we ended up at the end of :doc:`/getting_started`. But where do we go from here?
de: Das bringt uns dahin, wo wir am Ende von :doc:`/ getting_started` enden. Aber wohin gehen wir von hier
id: Itu membawa kita ke tempat kita berakhir di akhir :doc:`/getting_started`. Tapi kemana kita pergi dari sini?
tr_tr: Bu da bizi :doc:`/getting_started` kısmında kaldığımız noktaya getirir. Peki burdan nereye gideceğiz?

source: That example is simplistic, of course, but the flexibility of the resource object enables the creation of templates that contain all the required cloud infrastructure to run an application, such as load balancers, block storage volumes, compute instances, networking topology, and security policies.
de: Das Beispiel ist natürlich einfach, aber die Flexibilität des Resource-Objekts ermöglicht die Erstellung von Templates, die alle benötigten Cloud-Infrastrukturen enthalten, um eine Applikation auszuführen, wie z.B. Load Balancer, Blockspeichervolumen, Compute-Instanzen, Netzwerktopologie und Sicherheitsrichtlinien.
id: Contohnya sederhana, tentu saja, tapi fleksibilitas dari objek sumber daya memungkinkan pembuatan template yang berisi semua infrastruktur awan yang dibutuhkan untuk menjalankan aplikasi, seperti load balancer, block storage volume, compute instance, networking topology, and security policy.
tr_tr: Bu örnek tabi ki basittir, ama kaynak nesnesinin esnekliği yük dengeleyiciler, blok depolama birimleri, hesaplama sunucuları, ağ topolojileri ve güvenlik ilkeleri gibi bir uygulamayı çalıştırmak için gerekli tüm bulut altyapısının oluşturulmasını sağlar.

source: That, as it happens, is the new reality of programming. Applications and systems used to be created on large, expensive servers, cared for by operations staff dedicated to keeping them healthy. If something went wrong with one of those servers, the staff's job was to do whatever it took to make it right again and save the server and the application.
de: Das ist, wie es geschieht, die neue Realität der Programmierung. Anwendungen und Systeme wurden auf großen, teuren Servern erstellt, die von Betriebs-Mitarbeitern betreut wurden, um sie gesund zu halten. Wenn etwas mit einem dieser Server schief gegangen wäre, war die Aufgabe des Mitarbeiters zu tun, was notwendig ist, um sie wieder ganz zu machen und den Server und die Anwendung wiederherzustellen.
id: Itu, seperti yang terjadi, adalah realitas baru pemrograman. Aplikasi dan sistem yang digunakan untuk dibuat di server besar dan mahal, dirawat oleh staf operasi yang berdedikasi untuk menjaga kesehatan mereka. Jika ada yang tidak beres dengan salah satu server tersebut, tugas staf adalah melakukan apa pun untuk memperbaikinya lagi dan menyimpan server dan aplikasinya.
tr_tr: Bu da programlamanın yeni gerçekliği haline geldi diyebiliriz. Uygulamalar ve sistemler büyük pahalı sunucular üzerinde, sağlıklarını izlemek için adanmış işletici çalışanlarca bakılacak şekilde oluşturulurdu. Bu sunuculardan birine bir şey olursa, çalışanların işi uygulamayı ve sunucuyu kurtarmak için ellerinden geleni yapmaktı.

source: The :code:`OS::Heat::AutoScalingGroup` removes instances in creation order. So the worker instance that was created first is the first instance to be removed.
de: Der :code:`OS::Heat::AutoScalingGroup` entfernt Instanzen in der Erstellungsreihenfolge. Also die Worker-Instanz, die zuerst erstellt wurde, ist die erste Instanz, die entfernt werden soll.
id: The :code:`OS::Heat::AutoScalingGroup` menghapus instance dalam urutan pembuatan. Jadi instance pekerja yang dibuat pertama adalah instance pertama yang harus dihapus.
tr_tr: :code:`OS::Heat::AutoScalingGroup` sunucuları oluşturulma sırasına göre kaldırır. Yani ilk önce oluşturulan işçi sunucu kaldırılacak ilk sunucudur.

source: The :doc:`/introduction` section describes how to build in a modular fashion, create an API, and other aspects of the application architecture. Now you will see why those strategies are so important. By creating a modular application with decoupled services, you can identify components that cause application performance bottlenecks and scale them out. Just as importantly, you can also remove resources when they are no longer necessary. It is very difficult to overstate the cost savings that this feature can bring, as compared to traditional infrastructure.
de: Der Abschnitt :doc:`/introduction` beschreibt, wie man modular aufbaut, eine API erstellt und andere Aspekte der Anwendungsarchitektur. Jetzt werden Sie sehen, warum diese Strategien so wichtig sind. Durch die Erstellung einer modularen Anwendung mit entkoppelten Diensten können Sie Komponenten identifizieren, die Anwendungsperformance verursachen und sie ausgleichen. Genauso wichtig, man kann auch Ressourcen entfernen, wenn sie nicht mehr nötig sind. Es ist sehr schwierig, die Kosteneinsparungen zu beziffern, die diese Funktion im Vergleich zur herkömmlichen Infrastruktur bringen kann.
id: Bagian :doc:`/introduction` menjelaskan bagaimana membangun secara modular, membuat API, dan aspek arsitektur aplikasi lainnya. Sekarang Anda akan melihat mengapa strategi tersebut sangat penting. Dengan membuat aplikasi modular dengan layanan decoupled, Anda dapat mengidentifikasi komponen yang menyebabkan kemacetan kinerja aplikasi dan memperkecilnya. Sama pentingnya, Anda juga dapat menghapus sumber daya saat tidak diperlukan lagi. Sangat sulit untuk melebih-lebihkan penghematan biaya yang bisa diperoleh fitur ini, dibandingkan dengan infrastruktur tradisional.
tr_tr: :doc:`/introduction` kısmı modüler şekilde nasıl inşa edileceğini, bir API oluşturulacağını ve uygulama mimarisinin diğer yönlerini tanımlar. Şimdi bu stratejilerin neden bu kadar önemli olduğunu göreceksiniz. Birbirinden bağımsız servislerle modüler uygulama oluşturarak uygulama başarım darboğazlarına sebep olan bileşenleri tanımlayabilir ve bunları ölçekleyebilirsiniz. Aynı önem seviyesinde, artık ihtiyaç duyulmadığında kaynakları kaldırabilirsiniz. Bu özelliğin geleneksel altyapıya göre masrafı ne kadar azaltacağını abartmak mümkün değildir.

source: The CPU utilization across workers increases as workers start to create the fractals.
de: Die CPU-Auslastung über die Worker steigt, wenn die Worker die Fraktale erschaffen.
id: Pemanfaatan CPU di seluruh pekerja meningkat saat para pekerja mulai menciptakan fractal.
tr_tr: İşçi sunucular arasındaki CPU kullanımı işçiler yeni fraktallar oluşturmaya başladıkça artacaktır.

source: The Fractals app currently uses the local file system on the instance to store the images that it generates. For a number of reasons, this approach is not scalable or durable.
de: Die Fractals App verwendet derzeit das lokale Dateisystem auf der Instanz, um die von ihm erzeugten Bilder zu speichern. Aus einer Reihe von Gründen ist dieser Ansatz nicht skalierbar oder langlebig.
id: Aplikasi Fractal saat ini menggunakan sistem file lokal pada instance untuk menyimpan image yang dihasilkannya. Untuk sejumlah alasan, pendekatan ini tidak terukur atau awet.
tr_tr: Fraktal uygulaması şu an ürettiği imajları depolamak için yerel dosya sistemini kullanır. Birden fazla sebepten, bu yaklaşım ne ölçeklenebilirdir ne de dayanıklı.

source: The Fractals application was designed with the principles of the previous subsection in mind. You will note that in :doc:`getting_started`, we deployed the application in an all-in-one style, on a single virtual machine. This is not a good practice, but because the application uses micro-services to decouple logical application functions, we can change this easily.
de: Die Fractals-Anwendung wurde mit den Prinzipien des vorherigen Unterabschnitts entworfen. Sie werden feststellen, dass in :doc: `getting_started`, wir die Anwendung in einem All-in-One-Stil, auf einer einzigen virtuellen Maschine einsetzen. Dies ist keine gute Praxis, aber weil die Anwendung Mikrodienste verwendet, um logische Anwendungsfunktionen zu entkoppeln, können wir dies leicht ändern.
id: Aplikasi Fractals dirancang dengan prinsip-prinsip dari subbagian sebelumnya. Anda akan mencatat itu di :doc:`getting_started`, kami menerapkan aplikasi dengan gaya all-in-one, pada satu mesin virtual. Ini bukan praktik yang baik, tapi karena aplikasinya menggunakan layanan mikro untuk memisahkan fungsi aplikasi logis, kita bisa mengubahnya dengan mudah.
tr_tr: Fraktallar uygulaması önceki alt kısım göz önüne alınarak tasarlanmıştır. Bunu :doc:`getting_started` kısmında değerlendireceğiz, uygulamayı hepsi bir arada biçiminde kurduk, tek bir sanal makine üzerine. Bu iyi bir yaklaşım değildir, fakat uygumala mantıksal uygulama fonksiyonlarını ayırmak için mikro servisleri kullandığından, bunu kolaylıkla değiştirebiliriz.

source: The Object Storage API is organized around objects and containers.
de: Die Objektspeicher-API ist um Objekte und Container herum angeordnet.
id: Object Storage API diatur di sekitar objek dan kontainer.
tr_tr: Nesne Depolama API'si nesneler ve kapsayıcılar etrafında düzenlenmiştir.
