Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: http://php-opencloud.readthedocs.org/en/latest/getting-started-with-openstack.html
de: http://php-opencloud.readthedocs.org/de/latest/getting-started-with-openstack.html

source: http://superuser.openstack.org/articles/simple-auto-scaling-environment-with-heat
de: http://superuser.openstack.org/articles/simple-auto-scaling-umwelt-with-heat

source: http://superuser.openstack.org/articles/understanding-openstack-heat-auto-scaling
de: http://superuser.openstack.org/articles/verständnis-openstack-heat-auto-scaling

source: internal worker traffic
de: interner Worker-Verkehr
id: lalu lintas pekerja internal
tr_tr: dahili işçi trafiği

source: jClouds supports the OpenStack Networking API, but section has not yet been completed. Please see `this <https://gist.github.com/everett-toews/8701756>`_ in the meantime.
de: jClouds unterstützt die OpenStack Networking API, aber der Bereich ist noch nicht abgeschlossen. Bitte sehen Sie <https://gist.github.com/everett-toews/8701756> `_ in der Zwischenzeit.
id: jCloud mendukung OpenStack Networking API, namun bagian ini belum selesai. Silahkan lihat `this <https://gist.github.com/everett-toews/8701756>`_ sementara itu.
tr_tr: jClouds OpenStack Ağ API'sini destekler, ama bu kısım henüz tamamlanmadı. Bu sırada lütfen `buraya <https://gist.github.com/everett-toews/8701756>`_ göz atın.

source: libcloud does not currently support OpenStack Orchestration.
de: libcloud unterstützt derzeit keine OpenStack Orchestrierung.
id: libcloud saat ini tidak mendukung OpenStack Orchestration.
tr_tr: libcloud henüz OpenStack Orkestrasyon'u desteklemiyor.

source: libcloud support added 0.14: https://developer.rackspace.com/blog/libcloud-0-dot-14-released/
de: libcloud support hinzugefügt 0.14: https://developer.rackspace.com/blog/libcloud-0-dot-14-released/
tr_tr: libcloud desteği eklendi 0.14: https://developer.rackspace.com/blog/libcloud-0-dot-14-released/

source: password
de: Passwort
tr_tr: parola

source: project ID or name (projects are also known as tenants)
de: Projekt-ID oder Name (Projekte sind auch als Tenant bekannt)
id: ID atau nama proyek (proyek juga dikenal sebagai tenant/penyewa)
tr_tr: proje kimliği veya ismi (projeler kiracılar olarak da bilinir)

source: public-facing web traffic
de: öffentlich zugänglichen Webverkehr
id: lalu lintas web public-facing
tr_tr: dışarı dönük web trafiği

source: the .NET SDK does not currently support OpenStack Orchestration.
de: Das .NET SDK unterstützt derzeit keine OpenStack Orchestrierung.
id: the .NET SDK saat ini tidak mendukung OpenStack Orchestration.
tr_tr: .NET SDK henüz OpenStack Orkestrasyon'u desteklemiyor.

source: user name
de: Benutzername
tr_tr: kullanıcı adı

source: .NET Framework
tr_tr: .NET Çatısı

source: Extras
id: Ekstra
tr_tr: Ekler

source: Name
id: Nama
tr_tr: Ad

source: Neutron LbaaS API
tr_tr: Neutron LbaaS API'si

source: OpenStack SDKs
tr_tr: OpenStack SDK'ları

source: Parameter
tr_tr: Parametre

source: auth URL
tr_tr: yetkilendirme URL'si

source: cloud region
tr_tr: bulut bölgesi

source: If you do use a public cloud `known by shade <https://opendev.org/openstack/os-client-config/src/os_client_config/vendors>`_, you can avoid specifying :code:`auth_url:` and instead specify :code:`profile: $PROVIDER_NAME` in the clouds.yml file.
id: Jika Anda menggunakan cloud publik `known by shade <https://opendev.org/openstack/os-client-config/src/os_client_config/vendors>` _, Anda dapat menghindari menentukan: code: `auth_url:` dan sebagai gantinya sebutkan :code: `profil: $ PROVIDER_NAME` dalam file clouds.yml.

source: Official Python-based library for OpenStack.
id: Perpustakaan berbasis Python yang resmi untuk OpenStack.

source: Perhaps you can `contribute <https://docs.openstack.org/doc-contrib-guide/index.html>`_?
id: Mungkin kamu bisa `contribute <https://docs.openstack.org/doc-contrib-guide/index.html>`_?

source: See `configure shade <https://opendev.org/openstack/os-client-config/src/README.rst>`_, to configure your cloud using a profile.
id: Lihat `configure shade <https://opendev.org/openstack/os-client-config/src/README.rst>`_, untuk mengkonfigurasi cloud Anda menggunakan profil.

source: The `hello_faafo <https://opendev.org/openstack/api-site/raw/firstapp/samples/heat/hello_faafo.yaml>`_ Hot template demonstrates how to create a compute instance that builds and runs the Fractal application as an all-in-one installation.
id: The `hello_faafo <https://opendev.org/openstack/api-site/raw/firstapp/samples/heat/hello_faafo.yaml>`_ Template panas (hot template) menunjukkan cara membuat instance komputasi yang membangun dan menjalankan aplikasi Fractal sebagai instalasi all-in-one.

source: a recent version of `OpenStackSDK <https://docs.openstack.org/python-openstacksdk/latest/install/index.html>`_ installed.
id: versi terbaru dari`OpenStackSDK <https://docs.openstack.org/python-openstacksdk/latest/install/index.html>`_ terinstal.
