Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: **Remove the stack**
de: **Stapel entfernen**
tr_tr: **Yığını kaldır**

source: **Show information about the stack**
de: **Informationen zum Stapel anzeigen**
tr_tr: **Yığınla ilgili bilgi göster**

source: **Stack create**
de: **Stapel erstellen**
tr_tr: **Yığın oluştur**

source: :code:`api` (enable and start the API service), :code:`worker` (enable and start the worker service), and :code:`demo` (run the demo mode to request random fractals).
de: :code:`api` (Aktivieren und Starten des API-Dienstes) :code:`worker` (Aktivieren und Starten des Worker Service) und :code:`demo` (den Demo-Modus ausführen, um zufällige Fraktale anzufordern).
id: :code:`api` (enable and start the API service), :code:`worker` (enable and start the worker service), dan :code:`demo` (run the demo mode to request random fractals).
tr_tr: :code:`api` (API servisini etkinleştir ve başlat), :code:`worker` (işçi servisini etkinleştir ve başlat), ve :code:`demo` (Rasgele fraktallar istemek için demo kipini çalıştır).

source: :code:`ceilometer_sample_query`: shows the samples used to build the statistics.
de: :code:`ceilometer_sample_query`: zeigt die zum Erstellen der Statistik verwendeten Samples an.
id: :code:`ceilometer_sample_query`: menunjukkan sampel yang digunakan untuk membangun statistik.
tr_tr: :code:`ceilometer_sample_query`: istatistikleri inşa etmek için kullanılan örnekleri gösterir.

source: :code:`ceilometer_statistics_query`: shows the statistics used to trigger the alarms.
de: :code:`ceilometer_statistics_query`: Zeigt die Statistik an, die verwendet wird, um die Alarme auszulösen.
id: :code:`ceilometer_statistics_query`: menunjukkan statistik yang digunakan untuk memicu alarm.
tr_tr: :code:`ceilometer_statistics_query`: uyarıları tetiklemek için kullanılan istatistikleri gösterir.

source: :code:`detach_volume` and :code:`destroy_volume` take a volume object, not a name.
de: :code: `detach_volume` und :code:` destroy_volume` nimm ein Volume-Objekt, kein Name.
id: :code:`detach_volume` dan :code:`destroy_volume` ambil objek volume, bukan nama.
tr_tr: :code:`detach_volume` ve :code:`destroy_volume` birim nesnesi alır, isim değil.

source: :code:`ex_create_security_group_rule()` takes ranges of ports as input. This is why ports 80 and 22 are passed twice.
de: :code:`ex_create_security_group_rule ()` nimmt Bereiche von Ports als Eingabe. Aus diesem Grund sind die Anschlüsse 80 und 22 zweimal angegeben.
id: :code:`ex_create_security_group_rule()` mengambil rentang port sebagai masukan. Inilah sebabnya mengapa port 80 dan 22 dilewati dua kali.
tr_tr: :code:`ex_create_security_group_rule()` bağlantı noktası aralıklarını girdi olarak alır. Bu yüzden 80 ve 22 iki kere geçirilmiştir.

source: :code:`messaging` (install RabbitMQ) and :code:`faafo` (install the Faafo app).
de: :code:`messaging` (installiere RabbitMQ) und :code:`faafo` (installiere die Faafo app).
tr_tr: :code:`messaging` (RabbitMQ kur) ve :code:`faafo` (Faafo uygulamasını kur).

source: :code:`scale__workers_up_url`: A post to this url will add worker instances.
de: :code:`scale__workers_up_url`: Ein Post zu dieser URL wird Worker-Instanzen hinzufügen.
id: :code:`scale__workers_up_url`: Post ke url ini akan menambahkan instance pekerja.
tr_tr: :code:`scale__workers_up_url`: Bu url'ye yapılan gönderi işçi sunucu ekleyecektir.

source: :code:`scale_workers_down_url`: A post to this url will remove worker instances.
de: :code:`scale_workers_down_url`: Ein Post zu dieser URL entfernt Worker-Instanzen.
id: :code:`scale_workers_down_url`: Post ke url ini akan menghapus instance pekerja.
tr_tr: :code:`scale_workers_down_url`: Bu url'ye yapılan gönderi işçi sunucuları kaldıracaktır.

source: :doc:`/advice`: Get advice about operations.
de: :doc: `/advice`: Ratschläge über den Betrieb erhalten.
tr_tr: :doc:`/advice`: İşlemler hakkında öneri alın.

source: :doc:`/block_storage`: Migrate the database to block storage, or use the database-as-a-service component.
de: :doc: `/block_storage`: Migration der Datenbank, um den Speicher zu blockieren oder die Datenbank-as-a-Service-Komponente zu verwenden.
id: :doc:`/block_storage`: Migrasikan database untuk memblokir penyimpanan, atau gunakan komponen basis data as-a-service.
tr_tr: :doc:`/block_storage`: Veritabanını blok depolamaya göç ettirin, veya servis olarak veritabanı bileşenini kullanın.

source: :doc:`/craziness`: Learn some crazy things that you might not think to do ;)
de: :doc: `/craziness`: Lernen Sie einige verrückte Dinge, die Sie nicht zu träumen wagen ;)
id: :doc:`/craziness`: Pelajari beberapa hal gila yang mungkin tidak Anda pikirkan untuk dilakukan;)
tr_tr: :doc:`/craziness`: Yapmayı düşünmeyeceğiniz bazı çılgın şeyleri öğrenin ;)

source: :doc:`/durability`: Learn how to use Object Storage to make your application durable.
de: :doc:`/ durability`: Erfahren Sie, wie Sie Object Storage verwenden, um Ihre Anwendung langlebig zu machen.
id: :doc:`/durability`: Pelajari cara menggunakan Object Storage agar aplikasi Anda awet.
tr_tr: :doc:`/durability`: Uygulamanızı dayanıklı hale getirmek için Nesne Depolamayı nasıl kullanacağınızı öğrenin.

source: :doc:`/durability`: Learn how to use Object Storage to make your application more durable.
de: :doc:`/durability`: Erfahren Sie, wie Sie Object Storage verwenden, um Ihre Anwendung langlebiger zu machen.
id: :doc:`/durability`: Pelajari cara menggunakan Object Storage agar aplikasi Anda lebih awet.
tr_tr: :doc:`/durability`: Uygulamanızı daha dayanıklı hale getirmek için Nesne Depolamayı nasıl kullanacağınızı öğrenin.

source: :doc:`/networking`: Learn about complex networking.
de: :doc: `/networking`: Erfahren Sie mehr über komplexe Netzwerke.
tr_tr: :doc:`/networking`: Karmaşık ağları öğrenin.

source: :doc:`/orchestration`: Automatically orchestrate your application.
de: : doc: `/ orchestration`: Automatisches Orchestrieren Ihrer Applikation.
tr_tr: :doc:`/orchestration`: Uygulamanızı otomatik olarak düzenleyin.

source: :doc:`/scaling_out`: Learn how to scale your application.
de: :doc:`/ scaling_out`: Erfahren Sie, wie Sie Ihre Anwendung skalieren können.
id: :doc:`/scaling_out`: Pelajari bagaimana melakukan skala aplikasi Anda.
tr_tr: :doc:`/scaling_out`: Uygulamanızı nasıl ölçekleyeceğinizi öğrenin.

source: A .NET-based library. Use it to write C++ or C# code for Microsoft applications.
de: Eine .NET-basierte Bibliothek. Verwenden Sie es, um C ++ oder C # -Code für Microsoft-Anwendungen zu schreiben.
id: Perpustakaan berbasis .NET. Gunakan untuk menulis kode C ++ atau C # untuk aplikasi Microsoft.
tr_tr: .NET tabanlı bir kitaplık. Microsoft uygulamaları için C++ veya C# kodu yazmak için kullanın.

source: A Java-based library that the Apache Foundation manages. Use it to work with multiple cloud types.
de: Eine Java-basierte Bibliothek, die die Apache Foundation verwaltet. Verwenden Sie es, um mit mehreren Cloud-Typen zu arbeiten.
id: Perpustakaan berbasis Java yang dikelola Apache Foundation. Gunakan untuk bekerja dengan beberapa jenis awan.
tr_tr: Apache Vakfının yönettiği Java tabanlı bir kitaplık. Birden çok bulut türüyle çalışmak için kullanın.

source: A Node.js-based SDK. Use it work with multiple clouds.
de: Ein Node.js-basiertes SDK. Verwenden Sie es,um mit mehreren Clouds zu arbeiten.
id: SDK berbasis Node.js. Gunakan bekerja dengan banyak awan.
tr_tr: Node.js tabanlı bir SDK. Birden çok bulutla çalışmak için kullanın.

source: A PHP-based library. Use it to write PHP code that works with OpenStack clouds.
de: Eine PHP-basierte Bibliothek. Verwenden Sie es, um PHP-Code zu schreiben, der mit OpenStack-Clouds arbeitet.
id: Sebuah perpustakaan berbasis PHP. Gunakan untuk menulis kode PHP yang bekerja dengan awan OpenStack.
tr_tr: PHP tabanlı bir kitaplık. OpenStack bulutlarıyla çalışan PHP kodu yazmak için kullanın.

source: A Python-based library developed by OpenStack Infra team. Use it to operate multiple OpenStack clouds.
de: Eine Python-basierte Bibliothek, die von OpenStack Infra entwickelt wurde. Verwenden Sie es, um mehrere OpenStack-Clouds zu betreiben.
id: Perpustakaan berbasis Python yang dikembangkan oleh tim OpenStack Infra. Gunakan untuk mengoperasikan beberapa awan OpenStack.
tr_tr: OpenStack Infra takımı tarafından geliştirilen Python tabanlı bir kitaplık. Birden çok OpenStack bulutlarını işletmek için kullanın.

source: A Python-based library for OpenStack.
de: Eine Python-basierte Bibliothek für OpenStack.

source: A Python-based library that the Apache Foundation manages. Use it to work with multiple cloud types.
de: Eine Python-basierte Bibliothek, die die Apache-Stiftung verwaltet. Verwenden Sie es, um mit mehreren Cloud-Typen zu arbeiten.
id: Perpustakaan berbasis Python yang dikelola Apache Foundation. Gunakan untuk bekerja dengan beberapa jenis awan.
tr_tr: Apache Vakfının yönettiği Python tabanlı kitaplık. Birden çok bulut türüyle çalışmak için kullanın.

source: A Ruby-based SDK. Use it to work with multiple clouds.
de: Ein Ruby-basiertes SDK. Verwenden Sie es, um mit mehreren Clouds zu arbeiten.
id: SDK berbasis Ruby. Gunakan untuk bekerja dengan beberapa awan.
tr_tr: Ruby tabanlı bir SDK. Birden çok bulutla çalışmak için kullanın.

source: A floating IP helper function
de: Eine Floating-IP-Helferfunktion
id: Fungsi pembantu IP mengambang
tr_tr: Bir değişken IP yardımcı fonksiyonu

source: A general overview
de: Ein allgemeiner Überblick
id: Gambaran umum
tr_tr: Genel görünüm

source: A go-based SDK. Use it to write Golang code that works with OpenStack clouds.
de: Ein Go-basiertes SDK. Verwenden Sie es, um Golang-Code zu schreiben, der mit OpenStack-Clouds arbeitet.
id: SDK berbasis go. Gunakan untuk menulis kode Golang yang bekerja dengan awan OpenStack.
tr_tr: Go tabanlı bir SDK. OpenStack bulutlarıyla çalışan Golang kodu yazmak için kullanın.

source: A key pair. To access your instance, you must import an SSH public key into OpenStack to create a key pair. OpenStack installs this key pair on the new instance. Typically, your public key is written to :code:`.ssh/id_rsa.pub`. If you do not have an SSH public key file, follow `these instructions <https://help.github.com/articles/generating-ssh- keys/>`_ first. We will cover these instructions in depth in :doc:`/introduction`.
de: Ein Schlüsselpaar. Um auf Ihre Instanz zuzugreifen, müssen Sie einen SSH Public Key in OpenStack importieren, um ein Schlüsselpaar zu erstellen. OpenStack installiert dieses Schlüsselpaar auf der neuen Instanz. Normalerweise wird Ihr öffentlicher Schlüssel geschrieben an :code: `.ssh/id_rsa.pub`. Wenn Sie keine SSH-Public-Key-Datei haben, folgen Sie diesen Anweisungen <https://help.github.com/articles/generating-ssh- keys/> `_ zuerst Wir werden diese Anleitung ausführlich behandeln in :doc:`/introduction`.
id: Pasangan kunci Untuk mengakses instance Anda, Anda harus mengimpor kunci publik SSH ke OpenStack untuk membuat pasangan kunci. OpenStack menginstal pasangan kunci ini pada instance baru. Biasanya, kunci publik Anda ditulis ke :code:`.ssh/id_rsa.pub`. Jika Anda tidak memiliki file kunci publik SSH, ikuti `these instructions <https://help.github.com/articles/generating-ssh- keys/>`_ sebelumnya. Kami akan membahas instruksi ini secara mendalam :doc:`/introduction`.
tr_tr: Bir anahtar çifti. Sunucunuza erişmek için, OpenStack'e SSH açık anahtarını aktararak anahtar çifti oluşturmalısınız. OpenStack bu anahtar çiftini yeni sunucuya yükler. Genellikle açık anahtarınız :code:`.ssh/id_rsa.pub` konumuna yazılır. SSH açık anahtarı dosyanız yoksa önce `şu yönergeleri <https://help.github.com/articles/generating-ssh- keys/>`_ takip edin. Bu yönergeleri :doc:`/introduction` da daha derin işleyeceğiz.

source: A simple solution is to give half of your friends one address and half the other, but that solution is not sustainable. Instead, you can use a `DNS round robin <http://en.wikipedia.org/wiki/Round- robin_DNS>`_ to do that automatically. However, OpenStack networking can provide Load Balancing as a Service, which :doc:`/networking` explains.
de: Eine einfache Lösung ist, die Hälfte Ihrer Freunde eine Adresse und die Hälfte der anderen zu geben, aber diese Lösung ist nicht nachhaltig. Stattdessen können Sie ein 'DNS Round Robin' benutzen <http://en.wikipedia.org/wiki/Round- robin_DNS> `_, um das automatisch zu tun. Allerdings kann OpenStack Networking Load Balancing als Service bieten, was :doc:`/networking` erklärt.
id: Solusi sederhana adalah memberi setengah dari satu alamat teman Anda dan setengah lainnya, namun solusi itu tidak berkelanjutan. Sebagai gantinya, Anda bisa menggunakan `DNS round robin <http://en.wikipedia.org/wiki/Round- robin_DNS>`_ untuk melakukannya secara otomatis. Namun, jaringan OpenStack dapat menyediakan Load Balancing sebagai Service, yang mana :doc:`/networking` menjelaskan.
tr_tr: Basit bir çözüm arkadaşlarınızın yarısına bir adres, diğer yarısına başka bir adres vermektir, ama bu çözüm devam ettirilebilir değildir. Bunun yerine bunu otomatik olarak yapmak için `DNS round robin <http://en.wikipedia.org/wiki/Round- robin_DNS>`_ kullanabilirsiniz. Ancak OpenStack ağı :doc:`/networking` belgesinin açıkladığı şekilde Servis olarak Yük Dengeleme sağlayabilir.

source: API load is a slightly different problem than the previous one regarding capacity to work. We can simulate many requests to the API, as follows:
de: API Last ist ein etwas anderes Problem als die vorherige in Bezug auf die Fähigkeit zu arbeiten. Wir können viele Anfragen an die API simulieren, wie folgt:
id: Beban API adalah masalah yang sedikit berbeda dari yang sebelumnya mengenai kapasitas untuk bekerja. Kita bisa mensimulasikan banyak permintaan ke API, sebagai berikut:
tr_tr: API yükü daha önce bahsedilen çalışma kapasitesinden daha farklı bir problemdir. API'lere şu şekilde birçok istek gönderme denemesi yapabiliriz:

source: API traffic
de: API-Verkehr
id: Lalu lintas API
tr_tr: API trafiği

source: Access the application
de: Zugriff auf die Anwendung
id: Akses aplikasi
tr_tr: Uygulamaya erişin

source: Add metadata to objects
de: Metadaten zu Objekten hinzufügen
id: Tambahkan metadata ke objek
tr_tr: Metaveri nesneleri ekleyin

source: Add the option Networks and send its id to attach the instance to:
de: Fügen Sie die Option Netzwerke hinzu und geben Sie ihre ID an, um die Instanz auf folgende Adresse zu setzen:
id: Tambahkan opsi Networks dan kirim idnya untuk menyematkan instance ke:
tr_tr: Ağlar seçeneğini ekleyin ve kimliğini sunucuyu eklemek için gönderin:

source: Add the parameter network and send its name or id to attach the instance to:
de: Fügen Sie das Parameter-Netzwerk hinzu und geben Sie den Namen oder die ID an, um die Instanz an folgende Adresse anzuhängen:
id: Tambahkan jaringan parameter dan kirimkan nama atau id untuk menyematkan instance ke:
tr_tr: Ağ parametresini ekleyin ve ismini veya kimliğini eklenecek sunucuya gönderin:

source: Adding this capacity enables you to deal with a higher number of requests for fractals. As soon as these worker instances start, they begin checking the message queue for requests, reducing the overall backlog like a new register opening in the supermarket.
de: Wenn Sie diese Kapazität hinzufügen, können Sie mit einer höheren Anzahl von Anträgen auf Fraktale umgehen. Sobald diese Worker-Instanzen beginnen, beginnen sie mit der Überprüfung der Message-Queue für Anfragen, wodurch der Gesamt-Backlog wie eine neue Kasseneröffnung im Supermarkt reduziert wird.
id: Menambahkan kapasitas ini memungkinkan Anda menangani jumlah permintaan fraktal yang lebih tinggi. Begitu instance pekerja ini dimulai, mereka mulai memeriksa antrian pesan untuk permintaan, mengurangi keseluruhan simpanan keseluruhan seperti pembukaan pendaftar baru di supermarket.
tr_tr: Bu kapasiteyi eklemek fraktallar için daha yüksek sayıda istekle başa çıkabilmenizi sağlar. Bu işçi sunucular başladığı anda, istekler için ileti kuyruğunu kontrol etmeye başlarlar, markette açılan yeni bir kasa gibi genel birikmeyi azaltırlar.

source: Advice for developers new to operations
de: Beratung für Entwickler, die neu in Betrieb sind
id: Saran bagi pengembang baru untuk operasi
tr_tr: İşlemlere yeni geliştiriciler için öneri

source: After separating the Fractal worker nodes into their own networks, the next logical step is to move the Fractal API service to a load balancer, so that multiple API workers can handle requests. By using a load balancer, the API service can be scaled out in a similar fashion to the worker nodes.
de: Nach dem Trennen der Fractal-Worker-Knoten in ihre eigenen Netzwerke ist der nächste logische Schritt, den Fractal-API-Dienst zu einem Load-Balancer zu verschieben, so dass mehrere API-Worker Anfragen verarbeiten können. Durch die Verwendung eines Load-Balancers kann der API-Service in ähnlicher Weise wie die Worker-Knoten skaliert werden.
id: Setelah memisahkan node pekerja Fractal ke jaringan mereka sendiri, langkah logis berikutnya adalah memindahkan layanan Fractal API ke penyeimbang beban, sehingga beberapa pekerja API dapat menangani permintaan. Dengan menggunakan penyeimbang beban, layanan API dapat disesuaikan dengan node pekerja.
tr_tr: Fraktal işçi düğümlerini kendi ağlarına ayırdıktan sonra, sonraki mantıklı adım Fraktal API servisini bir yük dengeleyiciye taşıyarak birden fazla API işçisinin istekleri ele almasını sağlamaktır. Bir yük dengeleyici kullanarak, API servisi işçi düğümleri gibi ölçeklenebilir.

source: After the instance is created, cloud-init downloads and runs a script called :code:`install.sh`. This script installs the Fractals application. Cloud-init can consume bash scripts and a number of different types of data. You can even provide multiple types of data. You can find more information about cloud-init in the `official documentation <https://cloudinit.readthedocs.org/en/latest/>`_.
de: Nachdem die Instanz erstellt wurde, lädt Cloud-init ein Skript namens :code:`install.sh` herunter und führt es aus. Dieses Skript installiert die Fractals-Anwendung. Cloud-init kann Bash-Scripts und eine Reihe von verschiedenen Arten von Daten verarbeiten. Sie können sogar mehrere Arten von Daten bereitstellen. Weitere Informationen über cloud-init finden Sie in der offiziellen Dokumentation <https://cloudinit.readthedocs.org/en/latest/> `_.
id: Setelah instance dibuat, unduhan cloud-init dan jalankan skrip yang disebut :code:`install.sh`. Script ini menginstal aplikasi Fractals. Cloud-init bisa mengkonsumsi script bash dan sejumlah tipe data yang berbeda. Anda bahkan bisa menyediakan beberapa jenis data. Anda dapat menemukan lebih banyak informasi tentang cloud-init di `official documentation <https://cloudinit.readthedocs.org/en/latest/>`_.
tr_tr: Sunucu oluşturulduktan sonra, cloud-init :code:`install.sh` adındaki bir betiği indirir ve çalıştırır. Bu betik Fraktallar uygulamasını kurar. Cloud-init bash betiklerini ve çeşitli farklı türde veriyi tüketebilir. Hatta birden fazla türde veri de sağlayabilirsiniz. `Resmi belgelendirmede <https://cloudinit.readthedocs.org/en/latest/>`_ cloud-init'le ilgili daha fazla bilgi bulabilirsiniz.

source: Allocate floating ips and assign them to the web server nodes.
de: Weisen Sie Floating-IPs zu und weisen Sie sie den Webserverknoten zu.
id: Alokasikan floating ip dan tetapkan ke node server web.
tr_tr: Değişken ip'ler ayırın ve web sunucusu düğümlerine atayın.

source: Allocate the floating IP address:
de: Weisen Sie die Floating-IP-Adresse zu:
id: Alokasikan floating IP address:
tr_tr: Değişken IP adresini ayırın:

source: Allocating a floating IP address to an instance does not change the IP address of the instance, it causes OpenStack to establish the network translation rules to allow an *additional* IP address.
de: Das Zuweisen einer Floating-IP-Adresse zu einer Instanz ändert nicht die IP-Adresse der Instanz, es bewirkt, dass OpenStack die Netzwerkübersetzungsregeln festlegt, um eine *zusätzliche IP-Adresse zuzulassen.
id: Mengalokasikan sebuah floating IP ke sebuah instance tidak mengubah alamat IP dari instance, menyebabkan OpenStack untuk menetapkan aturan terjemahan jaringan untuk mengizinkan sebuah *additional* alamat IP.
tr_tr: Bir değişken IP adresini sunucuya ayırmak sunucunun IP adresini değiştirmez, OpenStack ağ dönüşüm kurallarını *ek* bir IP adresine izin verecek şekilde kurmasına sebep olur.

source: An often-cited reason for designing applications by using cloud patterns is the ability to **scale out**. That is: to add additional resources, as required. Contrast this strategy to the previous one of increasing capacity by scaling up the size of existing resources. To scale out, you must:
de: Ein oft zitierter Grund für die Gestaltung von Anwendungen mit Hilfe von Cloud-Mustern ist die Fähigkeit, **auszugleichen**. Das ist: um zusätzliche Ressourcen hinzuzufügen, wie erforderlich. Kontrastieren Sie diese Strategie auf die vorherige der zunehmenden Kapazität durch die Skalierung der Größe der vorhandenen Ressourcen. Um zu skalieren, müssen Sie:
id: Alasan yang sering dikutip untuk merancang aplikasi dengan menggunakan pola awan adalah kemampuan untuk **scale out**. Yaitu: menambahkan sumber daya tambahan, sesuai kebutuhan. Bandingkan strategi ini dengan kapasitas peningkatan sebelumnya dengan meningkatkan (scaling up) ukuran sumber daya yang ada. Untuk scale out, Anda harus:
tr_tr: Bulut kalıpları kullanarak uygulama tasarlamanın çoğu zaman gösterilen sebeplerinden biri **dışa ölçeklemedir**. Bu kısaca gerektiğinde ek kaynaklar ekleyebilmektir. Kapasite artırmak için mevcut kaynakların boyutlarını artırma stratejisiyle karşılaştırın. Dışa ölçeklemek için:

source: And as before, the stack takes a few minutes to build!
de: Und wie schon zuvor, der Stapel dauert ein paar Minuten zu bauen!
id: Dan seperti sebelumnya, stack itu membutuhkan waktu beberapa menit untuk dibangun!
tr_tr: Ve yine önceki gibi, yığın inşası birkaç dakika alır!

source: And confirm it is in place:
de: Und bestätigen das es vorhanden ist:
id: Dan konfirmasikan sudah ada di tempat:
tr_tr: Ve yerinde olduğunu onaylayın:

source: Another approach is to create a 'gold' image, which pre-installs your application and its dependencies. A 'gold' image enables faster boot times and more control over what is on the instance. However, if you use 'gold' images, you must have a process in place to ensure that these images do not fall behind on security updates.
de: Ein weiterer Ansatz ist es, ein 'goldenses' AbBild zu erstellen, das Ihre Anwendung und ihre Abhängigkeiten vorinstalliert. Ein 'goldenes' Abbild ermöglicht schnellere Boot-Zeiten und mehr Kontrolle über das, was auf der Instanz ist. Allerdings, wenn Sie 'goldene' Abbiler verwenden, müssen Sie einen Prozess haben, um sicherzustellen, dass diese Abbilder nicht bei Sicherheits-Updates herunterfallen.
id: Pendekatan lain adalah dengan menciptakan 'gold' image, yang menginstall aplikasi dan dependensinya. The 'gold' image, memungkinkan waktu boot yang lebih cepat dan kontrol yang lebih besar atas apa yang ada pada instance. Namun, jika Anda menggunakan 'gold' image, Anda harus memiliki proses untuk memastikan images ini tidak ketinggalan dalam pembaruan keamanan.
tr_tr: Başka bir yaklaşım da uygulamanızı ve bağımlılıklarınızı önceden kuran bir 'altın' imaj oluşturmaktır. 'altın' imaj daha hızlı önyükleme süreleri ve sunucu üzerinde ne olduğuyla ilgili daha iyi kontrol sağlar. Ancak 'altın' imajlar kullanırsanız, bu imajların güvenlik güncellemelerinin gerisinde kalmadığından emin olmak için bir sürece sahip olmalısınız.
