Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: The most common way for OpenStack clouds to allocate Internet rout-able IP addresses to instances, however, is through the use of floating IPs. A floating IP is an address that exists as an entity unto itself, and can be associated to a specific instance network interface. When a floating IP address is associated to an instance network interface, OpenStack re-directs traffic bound for that address to the address of the instance's internal network interface address. Your cloud provider will generally offer pools of floating IPs for your use.
de: Der häufigste Weg für OpenStack-Clouds, um Internet-Router-fähige IP-Adressen zu Instanzen zuzuordnen, ist jedoch durch die Verwendung von Floating-IPs. Eine Floating-IP ist eine Adresse, die als Entität für sich selbst existiert und einer bestimmten Instanznetzwerkschnittstelle zugeordnet werden kann. Wenn eine Floating-IP-Adresse einer Instanznetzwerkschnittstelle zugeordnet ist, leitet OpenStack den für diese Adresse verknüpften Verkehr an die Adresse der internen Netzwerkschnittstellenadresse der Instanz zurück. Ihr Cloud-Anbieter bietet in der Regel Pools von Floating-IPs für Ihren Einsatz.
id: Cara yang paling umum untuk awan OpenStack untuk mengalokasikan alamat IP Internet rout-able ke instance, bagaimanapun, adalah melalui penggunaan floating IP. Floating IP adalah alamat yang ada sebagai entitas tersendiri, dan dapat dikaitkan dengan antarmuka jaringan instance yang spesifik. Bila alamat floating IP dikaitkan dengan antarmuka jaringan instance, OpenStack re-directs traffic yang terikat alamat tersebut ke alamat alamat antarmuka jaringan internal instance. Provider awan Anda umumnya akan menawarkan kolam floating IP untuk Anda gunakan.
tr_tr: Ancak OpenStack bulutlarının internet yönlendirilebilir IP adreslerini sunuculara ayırmalarının en yaygın yolu değişken IP'lerin kullanımı iledir. Değişken IP kendi kendine var olan bir adrestir ve belirli sunucu ağ arayüzüyle ilişkilendirilebilir. Bir değişken IP adresi bir sunucu ağ arayüzüyle ilişkilendirildiğinde, OpenStack bu adrese bağlı trafiği sunucunun dahili ağ arayüz adresine yeniden yönlendirir. Bulut sağlayıcınız genellikle kullanımınız için değişken IP adresi havuzları sunacaktır.

source: The new instance appears.
de: Die neue Instanz erscheint.
id: Instance baru muncul.
tr_tr: Yeni sunucu belirir.

source: The next logical step is to upload an object. Find a photo of a goat online, name it :code:`goat.jpg`, and upload it to your :code:`fractals` container:
de: Der nächste logische Schritt besteht darin, ein Objekt hochzuladen. Finden Sie ein Foto von einer Ziege online, nennen Sie es :Code: `goat.jpg`, und laden Sie es auf Ihre :Code:`Fraktale` Container:
id: Langkah logis berikutnya adalah mengunggah sebuah objek. Temukan foto kambing secara online, beri nama :code:`goat.jpg`, dan unggah ke kontainer Anda :code:`fractals`:
tr_tr: Sonraki mantıksal adım bir nesne yüklemektir. İnternette bir keçi resmi bulun, ismini :code:`goat.jpg` yapın ve :code:`fraktallar` kapsayıcınıza yükleyin:

source: The outputs section of the stack contains two ceilometer command-line queries:
de: Der Ausgabestand des Stapels enthält zwei Ceilometer-Befehlszeilenabfragen:
id: Bagian output dari stack berisi dua ceilometer command-line queries:
tr_tr: Yığının çıktılar kısmı iki ceilometer komut satırı sorgusu içerir:

source: The parameter :code:`Size` is in gigabytes.
de: Der Parameter :Code: `Größe` ist in Gigabyte.
id: Parameter :code:`Size` ada di gigabyte.
tr_tr: :code:`Size` parametresi gigabayt türündendir.

source: The parameter :code:`size` is in gigabytes.
de: Der Parameter :code: `size` ist in Gigabyte.
id: Parameter :code:`size` ada di gigabyte.
tr_tr: :code:`size` parametresi gigabayt türündendir.

source: The prefix is `metering.` For example, `metering.some_name`.
de: Das Präfix ist 'metering'. Zum Beispiel `metering.some_name`.
id: Awalannya adalah `metering.` Misalnya, `metering.some_name`.
tr_tr: Önek `metering`'dir. Örneğin, `metering.bir_isim`.

source: The previous section uses two virtual machines - one 'control' service and one 'worker'. The speed at which your application can generate fractals depends on the number of workers. With just one worker, you can produce only one fractal at a time. Before long, you will need more resources.
de: Der vorhergehende Abschnitt verwendet zwei virtuelle Maschinen - einen 'Steuerdienst' und einen 'Worker'. Die Geschwindigkeit, mit der Ihre Anwendung Fraktale erzeugen kann, hängt von der Anzahl der Worker ab. Mit nur einem Worker können Sie nur ein Fraktal zu einer Zeit produzieren. Bis dahin benötigen Sie mehr Ressourcen.
id: Bagian sebelumnya menggunakan dua mesin virtual - satu layanan 'control' dan satu 'worker'. Kecepatan di mana aplikasi Anda dapat menghasilkan fraktal bergantung pada jumlah pekerja. Dengan hanya satu pekerja, Anda hanya bisa menghasilkan satu fraktal sekaligus. Tidak lama lagi, Anda akan membutuhkan lebih banyak sumber daya.
tr_tr: Önceki kısım iki sanal makine kullanır - biri 'kontrol' servisi biri de 'işçi' servisidir. Uygulamanızın fraktalları üretme hızı işçi sayısına göre değişir. Tek bir işçiyle bir seferde bir fraktal üretebilirsiniz. Fazla geçmeden daha fazla kaynağa ihtiyacınız olacak.

source: The rest of this tutorial will not reference the all-in-one instance you created in section one. Take a moment to delete this instance.
de: Der Rest dieses Tutorials bezieht sich nicht auf die All-in-One-Instanz, die Sie in Abschnitt eins erstellt haben. Nehmen Sie sich einen Moment Zeit, um diese Instanz zu löschen.
id: Sisa tutorial ini tidak akan mereferensikan all-in-one instance yang Anda buat di bagian pertama. Luangkan waktu untuk menghapus instance ini.
tr_tr: Bu kılavuzun geri kalanı bu kısımda oluşturduğunuz herşeyi içeren sunucuya başvurmayacak. Bu sunucuyu hızlıca silin.

source: The samples and the statistics are listed in opposite time order!
de: Die Muster und die Statistiken sind in umgekehrter Reihenfolge aufgeführt!
id: Sampel dan statistiknya tercantum dalam urutan waktu yang berlawanan!
tr_tr: Örnekler ve istatistikler ters zaman sırasına göre listelenir!

source: The second application is an OpenStack application that enables you to:
de: Die zweite Anwendung ist eine OpenStack-Anwendung, die es Ihnen ermöglicht:
id: Aplikasi kedua adalah aplikasi OpenStack yang memungkinkan Anda untuk:
tr_tr: İkinci uygulama şunları yapmanızı sağlayacak bir OpenStack uygulamasıdır:

source: The shade framework can select and assign a free floating IP quickly
de: Das shade-Framework kann eine Floating-IP schnell auswählen und zuordnen
id: Shade framework (kerangka teduh) dapat memilih dan menetapkan floating IP (IP apung) bebas dengan cepat
tr_tr: Shade çatısı çabukça boş bir değişken IP seçip atayabilir

source: The sheer number of requests means that some requests for fractals might not make it to the message queue for processing. To ensure that you can cope with demand, you must also scale out the API capability of the Fractals application.
de: Die schiere Anzahl von Anfragen bedeutet, dass einige Anfragen für Fraktale es nicht zur Nachrichtenwarteschlange zur Verarbeitung machen können. Um sicherzustellen, dass Sie mit der Nachfrage fertig werden können, müssen Sie auch die API-Fähigkeit der Fractals-Anwendung skalieren.
id: Jumlah permintaan sebenarnya berarti beberapa permintaan fraktal mungkin tidak sampai ke antrian pesan untuk diproses. Untuk memastikan bahwa Anda dapat mengatasi permintaan, Anda juga harus meningkatkan kemampuan API dari aplikasi Fractals.
tr_tr: İsteklerin tam sayısı demek fraktallar için bazı isteklerin işleme için ileti kuyruğuna varamayabileceği anlamına gelir. İstekle baş edebileceğinizden emin olmak için ayrıca Fraktal uygulamasının API kapasitesini de ölçeklemelisiniz.

source: The stack automatically creates a Nova instance, as follows:
de: Der Stapel erstellt automatisch eine Nova-Instanz wie folgt:
id: Stack tersebut secara otomatis menciptakan instance Nova, sebagai berikut:
tr_tr: Yığın şu şekilde otomatik olarak Nova sunucusunu oluşturur:

source: The stack reports an initial :code:`CREATE_IN_PROGRESS` status. When all software is installed, the status changes to :code:`CREATE_COMPLETE`.
de: Der Stapel meldet initial :code: `CREATE_IN_PROGRESS` Status. Wenn alle Software installiert ist, wechselt der Status zu :code:`CREATE_COMPLETE`.
id: Stack tersebut melaporkan status :code:`CREATE_IN_PROGRESS` awal. Saat semua perangkat lunak diinstal, status berubah menjadi :code:`CREATE_COMPLETE`.
tr_tr: Yığın önce bir :code:`CREATE_IN_PROGRESS` durumu bildirir. Tüm yazılım kurulduktan sonra, durum :code:`CREATE_COMPLETE` olarak değişir.

source: The stack we will be building uses the firing of alarms to control the addition or removal of worker instances.
de: Der Stapel, den wir bauen werden, nutzt das Abfeuern von Alarmen, um die Hinzufügung oder Entfernung von Worker-Instanzen zu kontrollieren.
id: Stack yang akan kita bangun menggunakan penyalaan alarm untuk mengendalikan penambahan atau pemindahan instance pekerja.
tr_tr: İnşa ediyor olacağımız yığın işçi sunucuların eklenmesi ve kaldırılmasını kontrol etmek için uyarıların tetiklenmesini kullanır.

source: The transport URL of the messaging service.
de: Die Transport-URL des Messaging-Dienstes.
id: URL transport dari layanan pesan.
tr_tr: İleti servisinin aktarım URL'si.

source: The unique identifier (UUID) of the image
de: Die eindeutige Kennung (UUID) des Abbildes
id: Unique identifier (UUID) dari image
tr_tr: İmajın benzersiz tanımlayıcısı (UUID)

source: The value of a meter is regularly sampled and saved with a timestamp.
de: Der Wert eines Meters wird regelmäßig abgetastet und mit einem Zeitstempel gespeichert.
id: Nilai meter secara teratur diambil sampelnya dan disimpan dengan timestamp.
tr_tr: Bir ölçünün değeri düzenli olarak örneklenir ve bir zaman damgasıyla kaydedilir.

source: The worker service consumes messages from the work queue and then processes them to create the corresponding fractal image file.
de: Der Workerservice konsumiert Nachrichten aus der Arbeitswarteschlange und verarbeitet sie dann, um die entsprechende Fraktalbilddatei zu erstellen.
id: Layanan pekerja mengkonsumsi pesan dari antrian kerja dan kemudian memprosesnya untuk membuat file image fraktal yang sesuai.
tr_tr: İşçi servisi iş kuyruğundan iletileri tüketir ve ilgili fraktal imaj dosyasını oluşturmak için bunları işler.

source: The world is running out of IPv4 addresses. If you get the "No more IP addresses available on network" error, contact your cloud administrator. You may also want to ask about IPv6 :)
de: Die Welt verliert IPv4-Adressen. Wenn Sie den Fehler 'Keine weitere IP-Adressen im Netzwerk' erhalten, wenden Sie sich an Ihren Cloud-Administrator. Sie können auch nach IPv6 fragen :)
id: Dunia kehabisan alamat IPv4. Jika Anda mengalami kesalahan "No more IP addresses available on network", hubungi administrator awan Anda. Anda mungkin juga ingin bertanya tentang IPv6 :)
tr_tr: Dünyada IPv4 adresi kalmamak üzere. Eğer "Ağda kullanılabilir başka IP adresi yok" hatası alırsanız, bulut yöneticinizle iletişime geçin. IPv6 ile ilgili konuşmak da isteyebilirsiniz :)

source: Then attach it to the instance:
de: Dann fügen Sie sie an die Instanz:
id: Kemudian pasang ke instance:
tr_tr: Ardından sunucuya ekleyin:

source: Then request an IP number be allocated from the pool.
de: Dann fordern Sie eine IP-Nummer aus dem Pool zuzuordnen.
id: Kemudian meminta nomor IP dialokasikan dari kolam.
tr_tr: Ardından ayırmak için havuzdan bir IP numarası isteyin.

source: Then, create a pair of large fractals:
de: Dann erstellen Sie ein paar große Fraktale:
id: Kemudian, buat sepasang fractal besar:
tr_tr: Ardından, büyük bir fraktal çifti oluşturun:

source: There are also multiple storage back ends (to store the generated fractal images) and a database component (to store the state of tasks), but we will talk about those in :doc:`/durability` and :doc:`/block_storage` respectively.
de: Es gibt auch mehrere Speicher-Backends (um die erzeugten Fraktalbilder zu speichern) und eine Datenbankkomponente (um den Status der Aufgaben zu speichern), aber wir sprechen über die in :doc:`/durability` und :doc:`/block_storage`.
id: Ada juga beberapa storage back end (untuk menyimpan image fraktal yang dihasilkan) dan komponen basis data (untuk menyimpan keadaan tugas), namun kami akan membicarakan hal-hal tersebut di :doc:`/durability` dan :doc:`/block_storage` masing-masing.
tr_tr: Ayrıca birden fazla depolama arka ucu (üretilen fraktal imajları saklamak için) ve bir veritabanı bileşeni (görevlerin durumunu saklamak için) bulunur, ama bunlardan sırasıyla :doc:`/durability` ve :`/block_storage` kısımlarında söz edeceğiz.

source: There are definite advantages to this architecture. It is easy to get a "new" server, without any of the issues that inevitably arise when a server has been up and running for months, or even years.
de: Es gibt definitive Vorteile für diese Architektur. Es ist leicht, einen 'neuen' Server zu bekommen, ohne irgendwelche Probleme, die unweigerlich entstehen, wenn ein Server seit Monaten läuft oder sogar Jahre alt ist.
id: Ada keuntungan pasti arsitektur ini. Sangat mudah untuk mendapatkan server "new", tanpa masalah yang pasti muncul saat server telah berjalan dan berjalan selama berbulan-bulan, atau bahkan bertahun-tahun.
tr_tr: Bu mimarinin belirli avantajları bulunur. Bir sunucunun aylarca hatta yıllarca çalıştığında bir gün karşısına çıkacak sunucular olmadan "yeni" bir sunucu almak kolaydır.

source: There are more commands available; find out more details about them with :code:`faafo get --help`, :code:`faafo list --help`, and :code:`faafo delete --help`.
de: Es stehen mehr Befehle zur Verfügung; erfahren Sie mehr über sie mit :code: `faafo get --help`, :code:`faafo list --help` und :code:`faafo delete --help`.
id: Ada lebih banyak perintah yang tersedia; cari tahu lebih banyak tentang mereka :code:`faafo get --help`, :code:`faafo list --help`, dan :code:`faafo delete --help`.
tr_tr: Kullanılabilir daha fazla komut bulunur; :code:`faafo get --help`, :code:`faafo list --help`, ve :code:`faafo delete --help` ile ayrıntılarını keşfedin.

source: These demonstrate how the Ceilometer alarms add and remove instances. To use them:
de: Dies zeigt, wie die Ceilometer Alarme Instanzen hinzufügen und entfernen. Um sie zu benutzen:
id: Ini menunjukkan bagaimana alarm Ceilometer menambahkan dan menghapus contoh. Untuk menggunakannya:
tr_tr: Bunlar Ceilometer uyarılarının nasıl sunucu eklediğini ve kaldırdığını gösterir. Kullanmak için:

source: These queries provide a view into the behavior of the stack.
de: Diese Abfragen geben einen Einblick in das Verhalten des Stapels.
id: Query ini memberikan pandangan tentang perilaku stack.
tr_tr: Bu sorgular yığının davranışına bir görüş sağlar.

source: These saved samples are aggregated to produce a statistic. The statistic that we are interested in is **avg**: the average of the samples over a given period.
de: Diese gespeicherten Proben werden zusammengefasst, um eine Statistik zu erzeugen. Die Statistik, die wir interessieren, ist **avg**: der Durchschnitt der Proben über einen bestimmten Zeitraum.
id: Sampel yang disimpan ini dikumpulkan untuk menghasilkan statistik. Statistik yang kami minati adalah **avg**: rata-rata sampel selama periode tertentu.
tr_tr: Bu kaydedilen örnekler istatistik üretmek üzere toplanır. Bizim ilgilendiğimiz istatistik **avg**'dir: verilen bir zaman aralığındaki örneklerin ortalaması.

source: These services are client-facing, so unlike the workers they do not use a message queue to distribute tasks. Instead, you must introduce some kind of load balancing mechanism to share incoming requests between the different API services.
de: Diese Dienste sind kundenorientiert, so dass sie im Gegensatz zu den Mitarbeitern keine Nachrichtenwarteschlange verwenden, um Aufgaben zu verteilen. Stattdessen müssen Sie eine Art Lastverteilungsmechanismus einführen, um eingehende Anfragen zwischen den verschiedenen API-Diensten zu teilen.
id: Layanan ini bersifat klien, sangat tidak seperti para pekerja mereka tidak menggunakan antrian pesan untuk mendistribusikan tugas. Sebagai gantinya, Anda harus memperkenalkan semacam mekanisme load balancing untuk berbagi permintaan yang masuk antara berbagai layanan API.
tr_tr: Bu servisler istemciye bakarlar, yani işçilerden farklı olarak görevleri dağıtmak için bir ileti kuyruğu kullanmazlar. Bunun yerine gelen istekleri farklı API servisleri arasında paylaştırmak için bir çeşit yük dengeleme sağlamalısınız.

source: These tools vastly reduce the effort it takes to work with large numbers of servers, and also improve the ability to recreate, update, move, and distribute applications.
de: Diese Tools reduzieren den Aufwand, den es braucht, um mit einer großen Anzahl von Servern zu arbeiten, und verringert auch die Fähigkeit, Anwendungen neu zu erstellen, zu aktualisieren, zu verschieben und zu verteilen.
id: Alat ini sangat mengurangi upaya yang diperlukan untuk bekerja dengan sejumlah besar server, dan juga meningkatkan kemampuan untuk membuat ulang (recreate), memperbarui, memindahkan, dan mendistribusikan aplikasi.
tr_tr: Bu araçlar çok fazla sunucuda çalışırken gösterilmesi gereken emeği büyük ölçüde azaltır, ayrıca uygulamaları tekrar oluşturma, güncelleme, taşıma ve dağıtma yeteneğini artırır.

source: This OpenStack Database service is not installed in many clouds right now, but if your cloud supports it, it can make your life a lot easier when working with databases.
de: Dieser OpenStack-Datenbank-Service ist derzeit nicht in vielen Clouds installiert, aber wenn Ihre Cloud es unterstützt, kann es Ihr Leben bei der Arbeit mit Datenbanken viel einfacher machen.
id: Layanan OpenStack Database ini tidak terinstal di banyak awan saat ini, namun jika awan Anda mendukungnya, ini bisa membuat hidup Anda jauh lebih mudah saat bekerja dengan database.
tr_tr: Bu OpenStack Kontrol panosu servisi şu an pek fazla bulutta kurulu değil, ama bulutunuz destekliyorsa, veritabanlarıyla çalışırken hayatınızı epey kolaylaştıracaktır.

source: This adds a "foo" key to the metadata that has a value of "bar".
de: Dies fügt einen 'foo' Schlüssel zu den Metadaten hinzu, die einen Wert von 'bar' haben.
id: Ini menambahkan "foo" key ke metadata yang memiliki nilai "bar".
tr_tr: Bu "bar" değerine sahip bir "foo" anahtarını metaveriye ekler.

source: This chapter explains the importance of durability and scalability for your cloud-based applications. In most cases, really achieving these qualities means automating tasks such as scaling and other operational tasks.
de: In diesem Kapitel wird die Bedeutung von Langlebigkeit und Skalierbarkeit für Ihre Cloud-basierten Anwendungen erläutert. In den meisten Fällen bedeutet es wirklich, diese Qualitäten zu erreichen, um Aufgaben wie Skalierung und andere operative Aufgaben zu automatisieren.
id: Bab ini menjelaskan pentingnya daya tahan dan skalabilitas untuk aplikasi berbasis awan Anda. Dalam kebanyakan kasus, benar-benar mencapai kualitas ini berarti mengotomatisasi tugas seperti penskalaan dan tugas operasional lainnya.
tr_tr: Bu bölüm bulut tabanlı uygulamalarınız için dayanıklılık ve ölçeklenebilirliğin önemini açıklar. Çoğu durumda bu kaliteleri gerçekten elde etmek ölçekleme ve diğer işlevsel görevleri otomatikleştirmek demektir.

source: This chapter introduces the Networking API. This will enable us to build networking topologies that separate public traffic accessing the application from traffic between the API and the worker components. We also introduce load balancing for resilience, and create a secure back-end network for communication between the database, web server, file storage, and worker components.
de: In diesem Kapitel wird die Networking API vorgestellt. Dies ermöglicht es uns, Netzwerk-Topologien zu erstellen, die den öffentlichen Verkehrszugriff auf die Anwendung vom Verkehr zwischen der API und den Worker-Komponenten trennen. Wir führen auch Lastverteilung für Resilienz ein und schaffen ein sicheres Back-End-Netzwerk für die Kommunikation zwischen Datenbank, Webserver, Dateispeicher und Worker-Komponenten.
id: Bab ini memperkenalkan Networking API. Ini akan memungkinkan kita untuk membangun topologi jaringan yang memisahkan lalu lintas umum yang mengakses aplikasi dari lalu lintas antara komponen API dan pekerja. Kami juga memperkenalkan load balancing untuk ketahanan, dan menciptakan jaringan back-end yang aman untuk komunikasi antara database, server web, penyimpanan file, dan komponen pekerja.
tr_tr: Bu bölüm Ağ API'sine giriş yapar. Bu bize uygulamaya erişen dışarı açık trafikle API ve işçi bileşenler arasındaki trafiği ayıracak ağ topolojileri inşa etmemizi sağlayacak. Ayrıca dayanıklılık için yük dengelemeye giriş yapacağız ve veritabanı, web sunucu, dosya sunucu ve işçi bileşenler arasında iletişim için güvenli bir arka uç ağı oluşturacağız.

source: This code returns output like this:
de: Dieser Code gibt die Ausgabe wie folgt zurück:
id: Kode ini menghasilkan output seperti ini:
tr_tr: Bu kod şu şekilde çıktı verir:

source: This code returns the floating IP address:
de: Dieser Code gibt die Floating-IP-Adresse zurück:
id: Kode ini mengembalikan floating IP address:
tr_tr: Bu kod değişken IP adresini döndürür:

source: This command returns a very long list of meters. Once a meter is created, it is never thrown away!
de: Dieser Befehl gibt eine sehr lange Liste von Metern zurück. Sobald ein Meter erstellt ist, wird er niemals weggeworfen!
id: Perintah ini mengembalikan daftar meter yang sangat panjang. Sekali satu meter dibuat, tidak pernah dibuang!
tr_tr: Bu komut uzun bir ölçü listesi döndürür. Bir ölçü oluşturulduğunda, asla fırlatılıp atılmaz!

source: This document has not yet been completed for the .NET SDK.
de: Dieses Dokument ist noch nicht für das .NET SDK abgeschlossen.
id: Dokumen ini belum selesai untuk .NET SDK.
tr_tr: Bu belge henüz .NET SDK için tamamlanmadı.

source: This document has not yet been completed for the fog SDK.
de: Dieses Dokument ist noch nicht für das fog-SDK abgeschlossen.
id: Dokumen ini belum selesai untuk fog SDK.
tr_tr: Bu belge henüz fog SDK için tamamlanmadı.

source: This document has not yet been completed for the php-opencloud SDK.
de: Dieses Dokument ist noch nicht für das php-opencloud SDK abgeschlossen.
id: Dokumen ini belum selesai untuk php-opencloud SDK.
tr_tr: Bu belge php-opencloud SDK için henüz tamamlanmadı.

source: This file contains all the code from this tutorial section. This class lets you view and run the code.
de: Diese Datei enthält den ganzen Code aus diesem Tutorial. Mit dieser Klasse können Sie den Code anzeigen und ausführen.
id: File ini berisi semua kode dari bagian tutorial ini. Kelas ini memungkinkan Anda melihat dan menjalankan kode.
tr_tr: Bu dosya bu öğretici kısmındaki tüm kodu içerir. Bu sınıf kodu görüntülemenizi ve çalıştırmanızı sağlar.

source: This file contains all the code from this tutorial section. This comprehensive code sample lets you view and run the code as a single script.
de: Diese Datei enthält den ganzen Code aus diesem Tutorial. Mit diesem umfassenden Code-Beispiel können Sie den Code als einzelnes Skript anzeigen und ausführen.
id: File ini berisi semua kode dari bagian tutorial ini. Sampel kode komprehensif ini memungkinkan Anda melihat dan menjalankan kode sebagai satu skrip.
tr_tr: Bu dosya bu öğretici kısmındaki tüm kodu içerir. Bu kapsamlı kod örneği kodu tek bir betik olarak görüntülemenizi ve çalıştırmanızı sağlar.
