Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: Choose an image and flavor for your instance. You need about 1GB RAM, 1 CPU, and a 1GB disk. This example uses the Ubuntu image with a small flavor, which is a safe choice. In subsequent tutorial sections in this guide, you must change the image and flavor IDs to correspond to the image and flavor that you choose.
de: Wählen Sie ein Abbild und eine Variante für Ihre Instanz. Sie benötigen ca. 1GB RAM, 1 CPU und eine 1GB Festplatte. Dieses Beispiel nutzt das Ubuntu-Abbild mit einer kleinen Variante, was eine sichere Wahl ist. In nachfolgenden Tutorialabschnitten in diesem Handbuch müssen Sie die Abbild- und Varianten-IDs entsprechend dem Abbild und der Variante ändern, die Sie gewählt haben.
id: Pilih flavor dan image untuk instance Anda. Anda memerlukan RAM 1GB, 1 CPU, dan disk 1GB. Contoh ini menggunakan image Ubuntu dengan sedikit flavor, yang merupakan pilihan yang aman. Di bagian tutorial berikutnya dalam panduan ini, Anda harus mengubah ID image dan flavor agar sesuai dengan image dan flavor yang Anda pilih.
tr_tr: Sunucunuz için bir imaj ve nitelik seçin. 1GB kadar RAM, 1 CPU ve 1GB diske ihtiyacınız var. Bu örnek güvenli bir seçim olan, küçük nitelikte bir Ubuntu imajını kullanır. Bu kılavuzdaki ilerleyen öğretici kısımlarda imaj ve nitelik kimliklerini seçtiğiniz imaj ve niteliklere göre değiştirmeniz gerekecek.

source: Choose your OpenStack SDK
de: Wählen Sie Ihr OpenStack SDK
id: Pilih SDK OpenStack Anda
tr_tr: OpenStack SDK'nızı seçin

source: Cloud application architecture principles
de: Cloud-Anwendung Architektur Prinzipien
id: Prinsip arsitektur aplikasi cloud
tr_tr: Bulut uygulama mimarisi prensipleri

source: Cloud applications often use many small instances rather than a few large instances. Provided that an application is sufficiently modular, you can easily distribute micro-services across as many instances as required. This architecture enables an application to grow past the limit imposed by the maximum size of an instance. It is like trying to move a large number of people from one place to another; there is only so many people you can put on the largest bus, but you can use an unlimited number of buses or small cars, which provide just the capacity you need - and no more.
de: Cloud-Anwendungen verwenden oft viele kleine Instanzen eher als ein paar große Instanzen. Vorausgesetzt, dass eine Anwendung ausreichend modular ist, können Sie problemlos Mikrodienste über möglichst viele Fälle verteilen. Diese Architektur ermöglicht es einer Anwendung, an der Grenze vorbei zu gehen, die durch die maximale Größe einer Instanz auferlegt wird. Es ist wie das Versuchen, eine große Anzahl von Menschen von einem Ort zum anderen zu bewegen; Es gibt nur so viele Leute, die man in den größten Bus setzen kann, aber man kann eine unbegrenzte Anzahl von Bussen oder Kleinwagen benutzen, die nur die Kapazität bieten, die man braucht - und nicht mehr.
id: Aplikasi awan sering menggunakan banyak instance kecil daripada beberapa instance besar. Asalkan aplikasi cukup modular, Anda dapat dengan mudah mendistribusikan micro-service sebanyak mungkin sesuai kebutuhan. Arsitektur ini memungkinkan aplikasi tumbuh melewati batas yang diberlakukan oleh ukuran maksimum sebuah instance. Ini seperti mencoba memindahkan sejumlah besar orang dari satu tempat ke tempat lain; Hanya ada begitu banyak orang yang bisa Anda pakai di bus terbesar, tapi Anda bisa menggunakan jumlah bus atau mobil kecil yang tidak terbatas, yang hanya menyediakan kapasitas yang Anda butuhkan - dan tidak lebih.
tr_tr: Bulut uygulamaları genellikle birkaç büyük sunucu yerine birçok küçük sunucu kullanırlar. Bir uygulamanın yeterli miktarda modüler olması sağlanırsa, kolaylıkla mikro servisleri istenilen sayıda sunucuya dağıtabilirsiniz. Bu mimari bir uygulamanın sunucu sınırlarını aşabilecek noktaya büyüyebilmesini sağlar. Bu çok sayıda insanı bir yerden bir yere taşımaya benzer; büyük bir otobüse ancak belli miktarda insanı koyabilirsiniz, ama sınırsız sayıda otobüs veya küçük arabalar kullanarak kapasiteyi ihtiyaç kadar ya da daha fazla artırabilirsiniz.

source: Cloud applications typically share several design principles. These principles influenced the design of the Fractals application.
de: Cloud-Anwendungen teilen sich typischerweise mehrere Designprinzipien. Diese Grundsätze beeinflussten die Gestaltung der Fractals-Anwendung.
id: Aplikasi awan biasanya berbagi beberapa prinsip desain. Prinsip-prinsip ini mempengaruhi disain aplikasi Fractals.
tr_tr: Bulut uygulamaları genellikle birçok tasarım prensibini paylaşır. Bu prensipler Fraktallar uygulamasının tasarımını etkilemiştir.

source: Cloud resources, such as running instances that you no longer use, can cost money. To avoid unexpected expenses, destroy cloud resources.
de: Cloud-Ressourcen, wie z.B. Instanzen, die Sie nicht mehr verwenden, können Geld kosten. Um unerwartete Ausgaben zu vermeiden, zerstören Sie die Cloud-Ressourcen.
id: Sumber daya awan, seperti instance yang tidak Anda gunakan lagi, bisa menghabiskan biaya. Untuk menghindari biaya tak terduga, hancurkan sumber daya awan.
tr_tr: Bulut kaynakları, örneğin artık kullanmadığınız çalışan sunucular, para harcayabilir. İstenmeyen masraflardan kaçınmak için bulut kaynaklarını silin.

source: Complete code sample
de: Komplettes Codebeispiel
id: Sampel kode lengkap
tr_tr: Tam kod örneği

source: Configuration management
de: Konfigurationsmanagement
id: Pengelolaan konfigurasi
tr_tr: Yapılandırma yönetimi

source: Configuration management tools, such as Ansible, Chef, and Puppet, enable you to describe exactly what to install and configure on an instance. Using these descriptions, these tools implement the changes that are required to get to the desired state.
de: Konfigurationsmanagement-Tools wie Ansible, Chef und Puppet ermöglichen es Ihnen, genau zu beschreiben, was zu installieren und zu konfigurieren auf einer Instanz. Mit diesen Beschreibungen implementieren diese Werkzeuge die Änderungen, die erforderlich sind, um in den gewünschten Zustand zu gelangen.
id: Alat pengelolaan konfigurasi, seperti Ansible, Chef, and Puppet, memungkinkan Anda untuk menjelaskan dengan tepat apa yang harus diinstal dan dikonfigurasi pada sebuah instance. Dengan menggunakan deskripsi ini, alat ini menerapkan perubahan yang diperlukan untuk mencapai keadaan yang diinginkan.
tr_tr: Ansible, Chef ve Puppet gibi yapılandırma yönetim araçları bir sunucuda tam olarak ne kurmak ve yapılandırmak istediğinizi tanımlamanızı sağlarlar. Bu tanımları kullanarak, bu araçlar istenen duruma gelinmesi için gerekli değişiklikleri uygularlar.

source: Configure the Fractals app to use Object Storage
de: Konfigurieren Sie die Fractals App, um Object Storage zu verwenden
id: Konfigurasikan aplikasi Fractal untuk menggunakan Object Storage
tr_tr: Fraktallar uygulamasını Nesne Depolamayı kullanacak şekilde yapılandırın

source: Confirm that the stack created two alarms:
de: Vergewissern Sie sich, dass der Stapel zwei Alarme erstellt hat:
id: Konfirmasikan bahwa stack itu membuat dua alarm:
tr_tr: Yığının iki uyarı oluşturduğunu onaylayın:

source: Confirm that they were added:
de: Bestätigen Sie, dass sie hinzugefügt wurden:
id: Konfirmasikan bahwa mereka telah ditambahkan:
tr_tr: Eklendiklerini onaylayın:

source: Confirm that we have a public network by listing the networks our tenant has access to. The public network does not have to be named public - it could be 'external', 'net04_ext' or something else - the important thing is it exists and can be used to reach the Internet.
de: Bestätigen Sie, dass wir ein öffentliches Netz haben, indem wir die Netzwerke aufrufen, auf die unser Tenant zugreifen kann. Das öffentliche Netz muss nicht öffentlich benannt werden - es könnte 'extern', 'net04_ext' oder etwas anderes sein - das Wichtigste ist, dass es existiert und verwendet werden kann, um das Internet zu erreichen.
id: Konfirmasikan bahwa kami memiliki jaringan publik dengan mencantumkan jaringan yang dapat diakses oleh penyewa kami. Jaringan publik tidak harus diberi nama publik - bisa jadi 'external', 'net04_ext' atau yang lainnya - yang terpenting ada dan bisa digunakan untuk menjangkau Internet.
tr_tr: Kiracımızın erişimi olan ağları listeleyerek bir açık ağımız olduğunu onaylayın. Açık ağ açık olarak adlandırılmamış olabilir- 'harici', 'net04_ext' veya başka bir şey olabilir- önemli olan mevcut olması ve internet erişiminde kullanılabilir olmasıdır.

source: Connect to the API endpoint:
de: Verbinden mit dem API-Endpunkt:
id: Hubungkan ke API endpoint:
tr_tr: API uç noktasına bağlanın:

source: Connecting to the Internet
de: Verbindung zum Internet herstellen
id: Menghubungkan ke Internet
tr_tr: İnternete bağlanmak

source: Contents
de: Inhalt
id: Isi
tr_tr: İçerikler

source: Create a network and subnet for the web server nodes.
de: Erstellen Sie ein Netzwerk und ein Subnetz für die Webserverknoten.
id: Buat jaringan dan subnet untuk node server web.
tr_tr: Web sunucu düğümleri için bir ağ ve alt ağ oluştur.

source: Create a network and subnet for the worker nodes. This is the private data network.
de: Erstellen Sie ein Netzwerk und ein Subnetz für die Worker-Knoten. Dies ist das private Datennetzwerk.
id: Buat jaringan dan subnet untuk node pekerja. Ini adalah jaringan data private.
tr_tr: İşçi düğümler için bir ağ ve alt ağ oluşturun. Bu özel veri ağıdır.

source: Create a router for the private data network.
de: Erstellen Sie einen Router für das private Datennetzwerk.
id: Buat router untuk jaringan data private.
tr_tr: Özel veri ağı için bir yönlendirici oluşturun.

source: Create a volume object by using the unique identifier (UUID) for the volume. Then, use the server object from the previous code snippet to attach the volume to it at :code:`/dev/vdb`:
de: Erstellen Sie ein Volume-Objekt, indem Sie die eindeutige Kennung (UUID) für das Volume verwenden. Verwenden Sie dann das Serverobjekt aus dem vorherigen Code-Snippet, um das Volume an folgende Adresse anzuhängen: code: `/ dev / vdb`:
id: Buat objek volume dengan menggunakan unique identifier (UUID) untuk volume. Kemudian, gunakan objek server dari cuplikan kode sebelumnya untuk menempelkan volume ke :code:`/dev/vdb`:
tr_tr: Birimin benzersiz tanımlayıcısını (UUID) kullanarak bir birim nesnesi oluşturun. Ardından, önceki kod parçasındaki sunucu nesnesini kullanarak birimi :code:`/dev/vdb` konumuna ekleyin:

source: Create and delete compute resources. These resources are virtual machine instances where the Fractals application runs.
de: Erstellen und Löschen von Berechnungsressourcen. Diese Ressourcen sind virtuelle Maschineninstanzen, in denen die Fractals-Anwendung läuft.
id: Buat dan hapus sumber daya komputasi. Sumber daya ini adalah instance mesin virtual tempat aplikasi Fractals berjalan.
tr_tr: Hesaplama kaynaklarını oluşturun ve silin. Bu kaynaklar Fraktal uygulamanın çalıştığı sanal makine sunucularıdır.

source: Create more API service requests
de: Erstellen Sie weitere API-Dienstanforderungen
id: Buat lebih banyak permintaan layanan API
tr_tr: Daha fazla API servis isteği oluşturun

source: Create more tasks
de: Erstellen Sie mehr Aufgaben
id: Buat lebih banyak tugas
tr_tr: Daha fazla görev oluşturun

source: Create networks
de: Netzwerke erstellen
id: Buat jaringan
tr_tr: Ağlar oluşturun

source: Create the instance.
de: Erstellen Sie die Instanz.
id: Buat instance.
tr_tr: Sunucuyu oluşturun.

source: Currently, you cannot directly store generated images in OpenStack Object Storage. Please revisit this section again in the future.
de: Derzeit können Sie nicht direkt gespeicherte Bilder in OpenStack Object Storage speichern. Bitte wiederholen Sie diesen Abschnitt nochmals in Zukunft.
id: Saat ini, Anda tidak bisa langsung menyimpan image yang dihasilkan di OpenStack Object Storage. Silakan kunjungi kembali bagian ini lagi di masa mendatang.
tr_tr: Şu an üretilen imajları doğrudan OpenStack Nesne Depolamaya kaydedemezsiniz. Lütfen ilerde bu kısmı tekrar ziyaret edin.

source: Customize networking for better performance and segregation.
de: Anpassung der Vernetzung für bessere Leistung und Segregation.
id: Sesuaikan jaringan untuk kinerja dan segregasi yang lebih baik.
tr_tr: Daha iyi başarım ve ayrım için ağı özelleştirin.

source: Define a short function to locate unused or allocate floating IPs. This saves a few lines of code and prevents you from reaching your floating IP quota too quickly.
de: Definieren Sie eine kurze Funktion, um unbenutzte oder zugängliche Floating-IPs zu lokalisieren. Das spart ein paar Zeilen Code und verhindert, dass Sie Ihr Floating-IP-Quota zu schnell erreichen.
id: Tentukan fungsi singkat untuk menemukan yang tidak digunakan atau mengalokasikan IP mengambang. Ini menghemat beberapa baris kode dan mencegah Anda mencapai kuota IP mengambang Anda terlalu cepat.
tr_tr: Kullanılmayanları bulmak için kısa bir fonksiyon tanımlayın veya değişken IP'ler ayırın. Bu birkaç satır koddan kar etmenizi sağlar ve değişken IP kotanızın çok çabuk dolmasını önler.

source: Delete containers
de: Container löschen
id: Hapus kontainer
tr_tr: Kapsayıcıları silin

source: Deploy the application to a new instance
de: Bereitstellen der Anwendung auf eine neue Instanz
id: Terapkan aplikasi ke instance baru
tr_tr: Uygulamayı yeni bir sunucuya kurun

source: Deploying application data and configuration to the instance can take some time. Consider enjoying a cup of coffee while you wait. After the application deploys, you can use your preferred browser to visit the awesome graphic interface at the following link.
de: Das Anlegen von Anwendungsdaten und die Konfiguration an die Instanz kann einige Zeit in Anspruch nehmen. Denken Sie daran, eine Tasse Kaffee zu genießen, während Sie warten. Nachdem die Anwendung installiert ist, können Sie Ihren bevorzugten Browser verwenden, um die fantastische grafische Oberfläche unter folgendem Link zu besuchen.
id: Menyebarkan data dan konfigurasi aplikasi ke instance bisa memakan waktu lama. Pertimbangkan menikmati secangkir kopi sambil menunggu. Setelah aplikasi menyebar, Anda dapat menggunakan browser pilihan Anda untuk mengunjungi antarmuka grafis yang mempesona di link berikut.
tr_tr: Uygulama verisinin ve yapılandırmanın sunucuya kurulumu biraz zaman alabilir. Beklerken bir kahve keyfi yapmayı düşünebilirsiniz. Uygulama kurulduktan sonra, tercih ettiğiniz tarayıcıyla aşağıdaki bağlantıdaki muhteşem grafik arayüzü ziyaret edebilirsiniz.

source: Deploying applications in a cloud environment can be very different from deploying them in a traditional IT environment. This guide teaches you how to deploy applications on OpenStack and some best practices for cloud application development.
de: Die Bereitstellung von Anwendungen in einer Cloud-Umgebung kann sich sehr von der Bereitstellung in einer herkömmlichen IT-Umgebung unterscheiden. Dieser Leitfaden lehrt Sie, wie Sie Anwendungen auf OpenStack bereitstellen und einige bewährte Methoden für die Entwicklung von Cloud-Anwendungen.
id: Menerapkan aplikasi di lingkungan awan bisa sangat berbeda dengan menerapkannya di lingkungan TI tradisional. Panduan ini mengajarkan Anda cara menerapkan aplikasi pada OpenStack dan beberapa praktik terbaik untuk pengembangan aplikasi awan.
tr_tr: Uygulamaları bulut ortamında kurmak geleneksel IT ortamında kurmaktan oldukça farklıdır. Bu kılavuz uygulamaları OpenStack'de nasıl kuracağınızı ve bulut uygulama geliştirme için bazı en iyi uygulamaları öğretir.

source: Description
de: Beschreibung
id: Deskripsi
tr_tr: Açıklama

source: Destroy an instance
de: Zerstören einer Instanz
id: Hancurkan instance
tr_tr: Bir sunucuyu silin

source: Do not worry if these concepts are not yet completely clear. In :doc:`/introduction`, we explore these concepts in more detail.
de: Machen Sie sich keine Sorgen, wenn Ihnen diese Konzepte noch nicht ganz klar sind. In :doc:`/introduction`, erforschen wir diese Konzepte genauer.
id: Jangan khawatir jika konsep ini belum sepenuhnya jelas. Dalam :doc:`/introduction`, kami mengeksplorasi konsep ini secara lebih rinci.
tr_tr: Bu kavramlar henüz tam oturmadıysa endişe etmeyin. :doc:`/introduction` kısmında bu kavramları daha ayrıntılı işleyeceğiz.

source: Enable/start something
de: Aktivieren/Starten von etwas
tr_tr: Bir şeyleri etkinleştir/başlat

source: Ensure you have an :file:`openrc.sh` file, source it, and validate that your trove client works:
de: Stellen Sie sicher, dass Sie eine Datei haben: `openrc.sh` Datei, Quelle, und bestätigen Sie, dass Ihr Trove Client funktioniert:
id: Pastikan Anda memiliki file :file:`openrc.sh`, sumber, dan memvalidasi bahwa klien Anda bekerja:
tr_tr: Bir :file:`openrc.sh` dosyanız olduğundan emin olun, onu kaynak edin ve trove istemcinizin çalıştığını onaylayın:

source: Ensure you have an openrc.sh file, source it, and then check that your openstack client works: ::
de: Stellen Sie sicher, dass Sie eine openrc.sh-Datei haben, sie sourcen, und überprüfen Sie dann, ob Ihr Openstack-Client funktioniert: ::
id: Pastikan Anda memiliki file openrc.sh, sumber, dan kemudian periksa apakah klien openstack Anda bekerja: ::
tr_tr: Bir openrc.sh dosyanız olduğundan emin olun, onu kaynak edin ve openstack istemcinizin çalıştığını kontrol edin: ::

source: Even with a key in place, however, you must have the appropriate security group rules in place to access your instance.
de: Sogar mit einem installierten Schlüssel, müssen Sie jedoch die entsprechenden Sicherheitsgruppenregeln aktiviert haben, um auf Ihre Instanz zuzugreifen.
id: Bahkan dengan kunci di tempat, bagaimanapun, Anda harus memiliki peraturan kelompok keamanan yang sesuai untuk mengakses instance Anda.
tr_tr: Bir anahtar olsa da, sunucunuza erişmek için uygun güvenlik grubu kurallarına sahip olmalısınız.

source: Example
de: Beispiel
id: Contoh
tr_tr: Örnek

source: Explore and apply advanced OpenStack cloud features.
de: Entdecken und bewerben Sie erweiterte OpenStack Cloud-Funktionen.
id: Jelajahi dan terapkan fitur awan OpenStack yang canggih.
tr_tr: Gelişmiş OpenStack bulut özelliklerini keşfedin ve uygulayın.

source: Extra features
de: Zusatzfunktionen
id: Fitur tambahan
tr_tr: Ek özellikler

source: Extra security groups
de: Zusätzliche Sicherheitsgruppen
id: Kelompok keamanan ekstra
tr_tr: Ek güvelik grupları

source: Fail fast
de: Schnell fehlschlagen
tr_tr: Hızlıca başarısız

source: Fault tolerance
de: Fehlertoleranz
id: Toleransi kesalahan
tr_tr: Arızaya dayanıklılık

source: Fault tolerance is essential to the cloud-based application.
de: Fehlertoleranz ist für die Cloud-basierte Anwendung unerlässlich.
id: Toleransi kesalahan sangat penting untuk aplikasi berbasis cloud.
tr_tr: Arızaya dayanıklılık bulut tabanlı uygulama için şarttır.

source: Final result
de: Endergebnis
id: Hasil final
tr_tr: Sonuç

source: Finally, clean up by deleting the test object:
de: Schließlich bereinigen Sie, indem Sie das Testobjekt löschen:
id: Akhirnya, bersihkan dengan cara menghapus objek test:
tr_tr: Son olarak deneme nesnesini silerek temizlik yapın:

source: Finally, start the stopped MySQL database service and validate that everything works as expected.
de: Schließlich starten Sie den gestoppten MySQL-Datenbankdienst und bestätigen, dass alles wie erwartet funktioniert.
id: Akhirnya, mulai menghentikan layanan database MySQL dan memvalidasi bahwa semuanya berjalan seperti yang diharapkan.
tr_tr: Son olarak, durdurulan MySQL veritabanı servisini başlatın ve herşeyin beklenen şekilde çalıştığını doğrulayın.

source: First check for an unused floating IP.
de: Zuerst auf eine unbenutzte Floating-IP prüfen
id: Pertama periksa floating IP yang tidak terpakai.
tr_tr: Önce kullanılmamış bir değişken IP için kontrol edin.

source: First provide the appropriate identity, credentials and authorization URL for your project. Then get an instance of the Nova API interface.
de: Zuerst die entsprechende Identität, Anmeldeinformationen und Berechtigungs-URL für Ihr Projekt zur Verfügung stellen. Dann bekommen Sie eine Instanz der Nova API-Schnittstelle.
id: Pertama, berikan identitas, kredensial, dan otorisasi URL yang sesuai untuk proyek Anda. Kemudian dapatkan sebuah instance dari antarmuka Nova API.
tr_tr: Önce projeniz için uygun kimliği, kimlik bilgilerini ve yetkilendirme URL'sini sağlayın. Ardından Nova API arayüzü örneğini alın.

source: First, learn how to connect to the Object Storage endpoint:
de: Erstens erfahren Sie, wie Sie eine Verbindung zum Objektspeicher-Endpunkt herstellen können:
id: Pertama, pelajari cara menyambungkan ke Object Storage endpoint:
tr_tr: Önce, Nesne Depolama uç noktasına nasıl bağlanacağınızı öğrenin:

source: First, tell the connection to get a specified image by using the ID of the image that you picked in the previous section:
de: Zuerst fragen Sie die Verbindung nach einem bestimmten Abbild, indem Sie die ID des Abbildes verwenden, das Sie im vorherigen Abschnitt ausgewählt haben:
id: Pertama, beritahu koneksi untuk mendapatkan image tertentu dengan menggunakan ID image yang Anda pilih di bagian sebelumnya:
tr_tr: Önce, bağlantıya önceki kısımda seçtiğiniz imajın kimliğini kullanarak belirtilen imajı almasını söyleyin:

source: Flavors and images
de: Variante und Abbilder
id: Flavor dan image
tr_tr: Nitelikler ve imajlar

source: For a list of available SDKs, see `Software Development Kits <https://wiki.openstack.org/wiki/SDKs>`_.
de: Eine Liste der verfügbaren SDKs finden Sie unter 'Software Development Kits' <https://wiki.openstack.org/wiki/SDKs> `_.
id: Untuk daftar SDK yang tersedia, lihat `Software Development Kits <https://wiki.openstack.org/wiki/SDKs>`_.
tr_tr: Kullanılabilir SDK listesi için, `Yazılım Geliştirme Araçlarına <https://wiki.openstack.org/wiki/SDKs>`_ göz atın.

source: For efficiency, most Object Storage installations treat large objects, :code:`> 5GB`, differently than smaller objects.
de: Für die Effizienz, die meisten Object Storage-Installationen behandeln große Objekte, :code:`> 5GB`, anders als kleinere Objekte.
id: Untuk efisiensi, sebagian besar instalasi Object Storage memperlakukan objek besar, :code:`> 5GB`, berbeda dari objek yang lebih kecil.
tr_tr: Etkinlik için, çoğu Nesne Depolama kurulumları büyük nesnelere, örneğin :code:`>5GB` küçük nesnelerden farklı davranırlar.

source: For example, you might use the Orchestration API to create two compute instances by creating a stack and by passing a template to the Orchestration API. That template contains two resources with the :code:`type` attribute set to :code:`OS::Nova::Server`.
de: Beispielsweise können Sie die Orchestrierungs-API verwenden, um zwei Compute-Instanzen zu erstellen, indem Sie einen Stapel erstellen und eine Vorlage an die Orchestrierungs-API übergeben. Diese Vorlage enthält zwei Ressourcen mit dem :code:`type` Attribut gesetzt auf :code:`OS::Nova::Server`.
id: Misalnya, Anda mungkin menggunakan Orchestration API untuk membuat dua instance komputasi dengan membuat tumpukan dan dengan melewatkan template ke Orchestration API. Template itu berisi dua sumber dengan atribut :code: `type` yang disetel ke :code:`OS::Nova::Server`.
tr_tr: Örneğin bir yığın oluşturarak ve Orkestrasyon API'sine bir şablon geçirerek Orkestrasyon API'sini kullanarak iki hesaplama sunucusu oluşturabilirsiniz. Bu şablon :code:`type` özniteliği :code:`OS::Nova::Server` olarak ayarlanmış iki kaynak içerir.

source: For example:
de: Beispielsweise:
id: Sebagai contoh:
tr_tr: Örneğin:
