Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: To launch an instance, you choose a flavor and an image. The flavor represents the size of the instance, including the number of CPUs and amount of RAM and disk space. An image is a prepared OS installation from which you clone your instance. When you boot instances in a public cloud, larger flavors can be more expensive than smaller ones in terms of resources and monetary cost.
de: Um eine Instanz zu starten, wählen Sie eine Variante und ein Abbild. Die Variante repräsentiert die Größe der Instanz, einschließlich der Anzahl der CPUs und der Menge an RAM und Speicherplatz. Ein Abbild ist eine vorbereitete OS-Installation, von der aus Sie Ihre Instanz klonen. Wenn Sie Instanzen in einer öffentlichen Cloud booten, können größere Varianten teurer sein als kleinere in Bezug auf Ressourcen und monetäre Kosten.
id: Untuk meluncurkan sebuah instance, Anda memilih flavor dan image. Flavor mewakili ukuran instance, termasuk jumlah CPU dan jumlah RAM dan ruang disk. Image adalah instalasi OS yang disiapkan dari mana Anda mengkloning instance Anda. Saat Anda melakukan booting di awan publik, flavor yang lebih besar bisa lebih mahal daripada yang lebih kecil dari segi sumber daya dan biaya moneter.
tr_tr: Bir sunucu başlatmak için, bir nitelik ve imaj seçersiniz. Nitelik sunucunuzun boyutunu, CPU sayısı ve RAM ve disk boyutu da dahil olarak temsil eder. İmaj sunucunuzu kopyaladığınız hazır bir işletim sistemi kurulumudur. Açık bir bulutta sunucularınız önyüklediğinizde, büyük nitelikler kaynakça ve maddi olarak küçük olanlardan daha pahalı olabilir.

source: To learn about auto-scaling with the Orchestration API, read these articles:
de: Um über die automatische Skalierung mit der Orchestrierungs-API zu erfahren, lesen Sie diese Artikel:
id: Untuk mempelajari tentang penskalaan otomatis dengan Orchestration API, baca artikel ini:
tr_tr: Orkestrasyon API'si ile otomatik ölçeklendirme hakkında daha fazlasını öğrenmek için şu makaleleri okuyun:

source: To learn about the template syntax for OpenStack Orchestration, how to create basic templates, and their inputs and outputs, see `Heat Orchestration Template (HOT) Guide <https://docs.openstack.org/heat/latest/template_guide/hot_guide.html>`_.
de: Um die Vorlage-Syntax für die OpenStack Orchestration zu erlernen, wie Sie grundlegende Vorlagen erstellen und ihre Eingaben und Ausgänge erstellen, finden Sie unter 'Heat Orchestration Template (HOT) Guide' <https://docs.openstack.org/heat/latest/template_guide/hot_guide.html> `_.
id: Untuk mempelajari tentang sintaks template untuk OpenStack Orchestration, bagaimana membuat template dasar, dan masukan dan keluarannya, lihat `Heat Orchestration Template (HOT) Guide <https://docs.openstack.org/heat/latest/template_guide/hot_guide.html>`_.

source: To list the images that are available in your cloud, run some API calls:
de: Um die Abbilder aufzurufen, die in Ihrer Cloud verfügbar sind, führen Sie einige API-Aufrufe aus:
id: Untuk daftar image yang tersedia di awan Anda, jalankan beberapa panggilan API:
tr_tr: Bulutunuzda kullanılabilir imajları listelemek için, bazı API çağrıları çalıştırın:

source: To recap:
de: Zur Wiederholung:
id: Untuk rekap:
tr_tr: Tekrar etmek için:

source: To run your application, you must launch an instance. This instance serves as a virtual machine.
de: Um Ihre Anwendung auszuführen, müssen Sie eine Instanz starten. Diese Instanz dient als virtuelle Maschine.
id: Untuk menjalankan aplikasi Anda, Anda harus meluncurkan sebuah instance. Contoh ini berfungsi sebagai mesin virtual.
tr_tr: Uygulamanızı çalıştırmak için bir sunucu başlatmalısınız. Sunucu bir sanal makine olarak servis verir.

source: To see if the volume creation was successful, list all volumes:
de: Um zu sehen, ob die Volumenerstellung erfolgreich war, listen Sie alle Volumes auf:
id: Untuk melihat apakah pembuatan volume berhasil, cantumkan semua volume:
tr_tr: Birim oluşturmanın başarılı olup olmadığını görmek için tüm birimleri listeleyin:

source: To see the application running, you must know where to look for it. By default, your instance has outbound network access. To make your instance reachable from the Internet, you need an IP address. By default in some cases, your instance is provisioned with a publicly rout-able IP address. In this case, you see an IP address listed under `public_ips` or `private_ips` when you list the instances. If not, you must create and attach a floating IP address to your instance.
de: Um die Anwendung zu sehen, müssen Sie wissen, wo sie sie suchen. Standardmäßig verfügt Ihre Instanz über einen ausgehenden Netzwerkzugriff. Um Ihre Instanz aus dem Internet zu erreichen, benötigen Sie eine IP-Adresse. In manchen Fällen ist Ihre Instanz standardmäßig mit einer öffentlich routbaren IP-Adresse versorgt. In diesem Fall sehen Sie eine IP-Adresse, die unter `public_ips` oder `private_ips` aufgeführt ist, wenn Sie die Instanzen auflisten. Wenn nicht, müssen Sie eine Floating-IP-Adresse an Ihre Instanz erstellen und anhängen.
id: Untuk melihat aplikasi berjalan, Anda harus tahu di mana mencarinya. Secara default, instance Anda memiliki akses jaringan keluar. Untuk membuat instance Anda dapat dijangkau dari Internet, Anda memerlukan alamat IP. Secara default dalam beberapa kasus, instance Anda tersedia dengan alamat IP yang dapat digunakan secara publik. Dalam kasus ini, Anda melihat alamat IP yang tercantum di bawah `public_ips` atau` private_ips` saat Anda mencantumkan instance. Jika tidak, Anda harus membuat dan menghubungkan alamat IP mengambang ke instance Anda.
tr_tr: Uygulamayı çalışır görmek için, nereye bakacağınızı bilmeniz gerekir. Öntanımlı olarak sunucunuzun dışarı ağ erişimi bulunur. Sunucunuzu internetten erişilebilir yapmak için bir IP adresine ihtiyacınız vardır. Bazı durumlarda öntanımlı olarak sunucunuz açıkça yönlendirilebilir bir IP adresiyle hazırlanır. Bu durumda sunucuları listelediğinizde `public_ips` veya `private_ips` altında listelenen bir IP adresi görürsünüz. Görmezseniz sunucunuz için bir değişken IP adresi oluşturmalı ve atamalısınız.

source: To see whether a private IP address is assigned to your instance:
de: Um zu sehen, ob eine private IP-Adresse Ihrer Instanz zugewiesen ist:
id: Untuk melihat apakah alamat IP private diberikan ke instance Anda:
tr_tr: Sunucunuza özel bir IP adresinin atanıp atanmadığını görmek için:

source: To see which security groups apply to an instance, you can:
de: Um zu sehen, welche Sicherheitsgruppen für eine Instanz gelten, können Sie:
id: Untuk melihat grup keamanan mana yang berlaku untuk sebuah instance, Anda dapat:
tr_tr: Bir sunucuya hangi güvenlik gruplarının uygulandığını görmek için:

source: To set up environment variables for your cloud in an :file:`openrc.sh` file, see `Set environment variables using the OpenStack RC file <https://docs.openstack.org/cli-reference/common/cli_set_environment_variables_using_openstack_rc.html>`_.
de: Um die Umgebungsvariablen für Ihre Cloud in einer: file: `openrc.sh` Datei einzurichten, siehe` Umgebungsvariablen mit der OpenStack RC Datei einstellen <https://docs.openstack.org/cli-reference/common/cli_set_environment_variables_using_openstack_rc.html> `_.
id: Untuk mengatur variabel lingkungan untuk awan Anda dalam file :file:`openrc.sh``, lihat `Set environment variables using the OpenStack RC file <https://docs.openstack.org/cli-reference/common/cli_set_environment_variables_using_openstack_rc.html>`_.
tr_tr: Bulutunuz için bir :file:`openrc.sh` dosyasında çevre değişkenleri ayarlamak için, `OpenStack RC dosyası kullanarak çevre değişkeni ayarlamak <https://docs.openstack.org/cli-reference/common/cli_set_environment_variables_using_openstack_rc.html>`_ kısmına göz atın.

source: To set up the necessary variables for your cloud in an 'openrc' file, use this guide:
de: Um die notwendigen Variablen für Ihre Cloud in einer 'openrc' Datei einzurichten, benutzen Sie diese Anleitung:
id: Untuk mengatur variabel yang diperlukan untuk awan Anda dalam file 'openrc', gunakan panduan ini:
tr_tr: Bulutunuz için gerekli değişkenleri bir 'openrc' dosyasında ayarlamak için, bu kılavuzu kullanın:

source: To show the details of a specific fractal use the subcommand :code:`show` of the Faafo CLI.
de: Um die Details eines bestimmten Fraktals zu zeigen, verwenden Sie den Unterbefehl :code:`show` der Faafo CLI.
id: Untuk menunjukkan rincian fraktal spesifik gunakan subcommand :code:`show` dari Faafo CLI.
tr_tr: Belirli bir fraktalın ayrıntılarını göstermek için Faafo CLI'nin :code:`show` alt komutunu kullanın.

source: To test what happens when the Fractals application is under load, you can:
de: Um zu testen, was passiert, wenn die Fractals-Anwendung unter Last ist, können Sie:
id: Untuk menguji apa yang terjadi saat aplikasi Fractals di bawah muatan, Anda dapat:
tr_tr: Fraktal uygulaması yük altındayken neler olacağını denemek için şunu yapabilirsiniz:

source: To try it out, add the following code to a Python script (or use an interactive Python shell) by calling :code:`python -i`.
de: Um es auszuprobieren, fügen Sie den folgenden Code zu einem Python-Skript hinzu (oder verwenden Sie eine interaktive Python-Shell), indem Sie aufrufen :code: `python -i`.
id: Untuk mencobanya, tambahkan kode berikut ke skrip Python (atau gunakan shell Python interaktif) dengan memanggil :code:`python -i`.
tr_tr: Denemek için aşağıdaki kodu :code:`python -i` çağırarak bir Python betiğine ekleyin (veya etkileşimli Python kabuğu kullanın).

source: To try it out, make a 1GB volume called 'test'.
de: Um es auszuprobieren, machen Sie ein 1GB Volumen namens 'Test'.
id: Untuk mencobanya, buatlah volume 1GB yang disebut 'test'.
tr_tr: Denemek için, 'test' isimli 1GB bir birim yapın.

source: To try it, add the following code to a Python script (or use an interactive Python shell) by calling :code:`python -i`.
de: Um es zu versuchen, fügen Sie den folgenden Code zu einem Python-Skript (oder verwenden Sie eine interaktive Python-Shell), indem Sie :code: `python -i` eingeben.
id: Untuk mencobanya, tambahkan kode berikut ke skrip Python (atau gunakan shell Python interaktif) dengan memanggil :code:`python -i`.
tr_tr: Denemek için, :code:`python -i`çağırarak aşağıdaki kodu bir Python betiğine ekleyin (veya etkileşimli Python kabuğunu kullanın).

source: To try it, use an interactive Node.js shell by calling :code:`node` or add the following code to a script.
de: Um es auszuprobieren, benutzen Sie eine interaktive Node.js-Shell, indem Sie :code: `node` ausführen oder den folgenden Code zu einem Skript hinzufügen.
id: Untuk mencobanya, gunakan shell Node.js interaktif dengan memanggil :code:`node` atau tambahkan kode berikut ke skrip.
tr_tr: Denemek için, :code:`node` çağırarak etkileşimli Node.js kabuğu kullanın veya aşağıdaki kodu bir betiğe ekleyin.

source: To use Maven to compile a downloaded sample, with the command prompt located in the same directory as the :code:`pom.xml` file, enter:
de: Um Maven zu verwenden, um ein heruntergeladenes Sample zu kompilieren, mit der Eingabeaufforderung im selben Verzeichnis wie die :code: `pom.xml` Datei, geben Sie Folgendes ein:
id: Untuk menggunakan Maven untuk mengkompilasi sampel yang telah didownload, dengan command prompt berada di direktori yang sama dengan file :code:`pom.xml`, masukkan:
tr_tr: İndirilen bir örneği derlemek için Maven kullanmak için, :code:`pom.xml` dosyasının bulunduğu dizinle aynı yerdeki komut satırına şunu girin:

source: To use Maven to run each downloaded sample, with the command prompt located in the same directory as the :code:`pom.xml` file, enter:
de: Um Maven zu verwenden, um jedes heruntergeladene Beispiel auszuführen, mit der Eingabeaufforderung, die sich im selben Verzeichnis wie die Datei :code: `pom.xml` befindet, geben Sie Folgendes ein:
id: Untuk menggunakan Maven untuk menjalankan setiap sampel yang diunduh, dengan command prompt yang terdapat di direktori yang sama dengan file :code:`pom.xml`, masukkan:
tr_tr: İndirilen her bir örneği Maven kullanarak çalıştırmak için komut satırı :code:`pom.xml` dosyasının olduğu dizinde olacak şekilde, şunu girin:

source: To use a floating IP, you must first allocate an IP to your project, then associate it to your instance's network interface.
de: Um eine Floating-IP zu verwenden, müssen Sie zuerst Ihr Projekt eine IP zuordnen und sie dann der Netzwerkschnittstelle Ihrer Instanz zuordnen.
id: Untuk menggunakan floating IP, Anda harus mengalokasikan IP ke proyek Anda terlebih dulu, kemudian mengaitkannya ke antarmuka jaringan instance Anda.
tr_tr: Bir değişken IP kullanmak için, önce projenize bir IP ayırmalısınız, ardından bunu sunucunuzun ağ arayüzüyle ilişkilendirmelisiniz.

source: To use the OpenStack .NET SDK, add the following code in the required namespace section.
de: Um das OpenStack .NET SDK zu verwenden, fügen Sie den folgenden Code in den erforderlichen Namespace-Abschnitt hinzu.
id: Untuk menggunakan OpenStack .NET SDK, tambahkan kode berikut di bagian namespace yang dibutuhkan.
tr_tr: OpenStack .NET SDK'yı kullanmak için, aşağıdaki kodu gerekli isim uzayı kısmına ekleyin.

source: To verify that ceilometer is installed, list the known meters:
de: Um zu überprüfen, ob der Ceilometer installiert ist, liste die bekannten Zähler auf:
id: Untuk memverifikasi ceilometer yang terpasang, daftar meter yang diketahui:
tr_tr: Ceilometer'in kurulu olduğunu onaylamak için bilinen ölçüleri listeleyin:

source: Use :code:`ex_list_floating_ip_pools()` and select the first floating IP address pool. Allocate this pool to your project and use it to get a floating IP address.
de: Verwenden Sie :code: `ex_list_floating_ip_pools ()` und wählen Sie den ersten floating IP-Adresspool aus. Weisen Sie diesen Pool zu Ihrem Projekt und verwenden Sie ihn, um eine Floating-IP-Adresse zu erhalten.
id: Gunakan :code:`ex_list_floating_ip_pools()` dan pilih kolam floating IP address pertama. Alokasikan kolam ini ke proyek Anda dan gunakan untuk mendapatkan floating IP address.
tr_tr: :code:`ex_list_floating_ip_pools()` kullanın ve ilk değişken IP adresi havuzunu seçin. Bu havuzu projenize ayırın ve bir değişken IP adresi almak için kullanın.

source: Use :code:`getFloatingIps` to check for unused addresses. Select the first available address. Otherwise, use :code:`allocateNewFloatingIp` to allocate a floating IP to your project from the default address pool.
de: Verwenden Sie :code: `getFloatingIps`, um nach unbenutzten Adressen zu suchen. Wählen Sie die erste verfügbare Adresse aus. Andernfalls verwenden Sie :code:`allocateNewFloatingIp`, um Ihrem Projekt eine Floating-IP zuzuweisen, aus dem Standard-Adresspool.
id: Gunakan :code:`getFloatingIps` untuk memeriksa alamat yang tidak terpakai. Pilih alamat pertama yang tersedia. Jika tidak, gunakan :code:`allocateNewFloatingIp` untuk mengalokasikan floating IP ke proyek Anda dari kolam alamat default.
tr_tr: Kullanılmayan adresleri kontrol etmek için :code:`getFloatingIps` kullanın. Kullanılabilir ilk adresi seçin. Aksi halde, öntanımlı adres havuzundan projenize bir değişken IP ayırmak için :code:`allocateNewFloatingIp` kullanın.

source: Use Block Storage for the Fractal database server
de: Verwenden Sie Blockspeicher für den Fractal-Datenbankserver
id: Gunakan Block Storage untuk server database Fractal
tr_tr: Fraktal veritabanı sunucusu için Blok Depolama kullanın

source: Use Object Storage instead of a database
de: Verwenden Sie Objektspeicher anstelle einer Datenbank
id: Gunakan Object Storage bukan database
tr_tr: Veritabanı yerine Nesne Depolama kullanın

source: Use Object Storage to store fractals
de: Verwenden Sie Objektspeicher, um Fraktale zu speichern
id: Gunakan Object Storage untuk menyimpan fractal
tr_tr: Fraktalları depolamak için Nesne Depolamayı kullanın

source: Use Object and Block storage for file and database persistence.
de: Verwenden Sie Objekt- und Blockspeicher für Datei- und Datenbankpersistenz.
id: Gunakan penyimpanan Object dan Block untuk file dan database persistence.
tr_tr: Dosya ve veritabanı kalıcılığı için Nesne ve Blok depolamayı kullanın.

source: Use Orchestration services to automatically adjust to the environment.
de: Verwenden Sie Orchestrierungsdienste, um sich automatisch an die Umgebung anzupassen.
id: Gunakan layanan Orchestration untuk menyesuaikan diri secara otomatis dengan lingkungan.
tr_tr: Ortama otomatik olarak ayarlanmak için Orkestrasyon servislerini kullanın.

source: Use SSH with the existing SSH keypair to log in to the :code:`app-controller` controller instance.
de: Verwenden Sie SSH mit dem vorhandenen SSH-Schlüsselpaar, um sich an dem :code:`app-controller` Controller-Instanz anzumelden.
id: Gunakan SSH dengan keypair SSH yang ada untuk login ke instance controller :code:`app-controller`:
tr_tr: Mevcut SSH anahtar çiftiyle :code:`app-controller` kontrol sunucusuna giriş için SSH kullanın.

source: Use a for loop to call the :code:`faafo` command-line interface to request a random set of fractals 500 times:
de: Verwenden Sie eine for-Schleife, um den :code:`faafo`-Befehlszeilen-Interface anzurufen, um einen zufälligen Satz von Fraktalen 500 mal anzufordern:
id: Gunakan for loop until memanggil antarmuka command-line :code:`faafo` untuk meminta kumpulan fraktal acak sebanyak 500 kali:
tr_tr: 500 kere rasgele fraktal kümesi isteği göndermek için komut satırı arayüzünden bir döngü kullanarak :code:`faafo` çalıştırın:

source: Use conf.d and etc.d.
de: Verwenden Sie conf.d und etc.d.
id: Menggunakan conf.d and etc.d.
tr_tr: conf.d ve etc.d kullanın.

source: Use environment variables to set your cloud credentials
de: Verwenden Sie Umgebungsvariablen, um Ihre Cloud-Anmeldeinformationen festzulegen
id: Gunakan variabel lingkungan untuk menetapkan kredensial awan Anda
tr_tr: Bulut kimlik bilgilerinizi ayarlamak için ortam değişkenleri kullanın

source: Use network service client to select the first floating IP address pool. Allocate this pool to your project and use it to get a floating IP address.
de: Verwenden Sie den Netzwerkdienstclient, um den ersten Floating-IP-Adresspool auszuwählen. Weisen Sie diesen Pool zu Ihrem Projekt und verwenden Sie ihn, um eine Floating-IP-Adresse zu erhalten.
id: Gunakan klien layanan jaringan untuk memilih kolam floating IP address pertama. Alokasikan kolam ini ke proyek Anda dan gunakan untuk mendapatkan floating IP address.
tr_tr: İlk değişken IP adresi havuzunu seçmek için ağ servis istemcisini kullanın. Bu havuzu projenize ayırın ve bir değişken IP adresi almak için kullanın.

source: Use the :code:`faafo UUID` command to examine some of the fractals.
de: Verwenden Sie den :code:`faafo UUID` Befehl, um einige der Fraktale zu untersuchen.
id: Gunakan perintah :code:`faafo UUID` untuk memeriksa beberapa fraktal.
tr_tr: Fraktalların bazılarını incelemek için :code:`faafo UUID` komutunu kullanın.

source: Use the :code:`faafo create` command to generate fractals.
de: Verwenden Sie den :code:`faafo create` Befehl, um Fraktale zu erzeugen.
id: Gunakan perintah :code:`faafo create` untuk menghasilkan fraktal.
tr_tr: Fraktallar üretmek için :code:`faafo create` komutunu kullanın.

source: Use the :code:`faafo list` command to watch the progress of fractal generation.
de: Verwenden Sie den :code:`faafo list` Befehl, um den Fortschritt der Fraktalgenerierung zu beobachten.
id: Gunakan perintah :code:`faafo list` untuk melihat perkembangan generasi fraktal.
tr_tr: Fraktal üretim sürecini izlemek için :code:`faafo list` komutunu kullanın.

source: Use the `Health Endpoint Monitoring Pattern <https://msdn.microsoft.com/en-us/library/dn589789.aspx>` to implement functional checks within your application that external tools can access through exposed endpoints at regular intervals.
de: Verwenden Sie das `Health Endpoint Monitoring Pattern <https://msdn.microsoft.com/en-us/library/dn589789.aspx>` um funktionale Prüfungen innerhalb Ihrer Anwendung zu implementieren, sodass externe Werkzeuge über exponierte Endpunkte in regelmäßigen Abständen zugreifen können.
id: Gunakan `Health Endpoint Monitoring Pattern <https://msdn.microsoft.com/en-us/library/dn589789.aspx>` untuk menerapkan pemeriksaan fungsional dalam aplikasi Anda sehingga alat eksternal dapat mengakses melalui endpoint yang terpapar secara berkala.
tr_tr: Uygulamanızda harici araçların dışa çık uç noktalardan belirli aralıklarla erişebileceği işlev kontrolleri uygulamak için `Sağlık Uç Nokta İzleme Örüntüsünü <https://msdn.microsoft.com/en-us/library/dn589789.aspx>` kullanın.

source: Use the image, flavor, key pair, and userdata to create an instance. After you request the instance, wait for it to build.
de: Verwenden Sie das Abbild, die Variante, das Schlüsselpaar und die Userdata, um eine Instanz zu erstellen. Nachdem Sie die Instanz angefordert haben, warten Sie, bis sie gebaut wird.
id: Gunakan image, flavor, key pair, dan userdata untuk membuat sebuah instance. Setelah Anda meminta instance, tunggulah untuk membangunnya.
tr_tr: Sunucuyu oluşturmak için imajı, niteliği, anahtar çiftini ve kullanıcı verisini kullanın. Sunucu isteği yaptıktan sonra inşa edilmesini bekleyin.

source: Use the stack ID to get more information about the stack:
de: Verwenden Sie die Stack-ID, um mehr Informationen über den Stapel zu erhalten:
id: Gunakan stack ID untuk mendapatkan informasi lebih lanjut tentang stack:
tr_tr: Yığınla ilgili daha fazla bilgi almak için yığın kimliğini kullanın:

source: Use this guide to install the 'openstack' command-line client: https://docs.openstack.org/cli-reference/common/cli_install_openstack_command_line_clients.html#install-the-clients
de: Verwenden Sie diese Anleitung, um den Befehlszeilenclient 'openstack' zu installieren: https://docs.openstack.org/cli-reference/common/cli_install_openstack_command_line_clients.html#install-the-clients
id: Gunakan panduan ini untuk menginstal klien command-line 'openstack': https://docs.openstack.org/cli-reference/common/cli_install_openstack_command_line_clients.html#install-the-clients
tr_tr: 'Openstack' komut satırı istemcisini kurmak için bu kılavuzu kullanın: https://docs.openstack.org/cli-reference/common/cli_install_openstack_command_line_clients.html#install-the-clients

source: Use this guide to set up the necessary variables for your cloud in an 'openrc' file: https://docs.openstack.org/cli-reference/common/cli_set_environment_variables_using_openstack_rc.html
de: Verwenden Sie diese Anleitung, um die notwendigen Variablen für Ihre Cloud in einer 'openrc' Datei einzurichten: https://docs.openstack.org/cli-reference/common/cli_set_environment_variables_using_openstack_rc.html
id: Gunakan panduan ini untuk menyiapkan variabel yang diperlukan untuk awan Anda di file 'openrc': https://docs.openstack.org/cli-reference/common/cli_set_environment_variables_using_openstack_rc.html
tr_tr: Bulutunuz için gerekli değişkenleri bir 'openrc' dosyasında ayarlamak için bu kılavuzu kullanın: https://docs.openstack.org/cli-reference/common/cli_set_environment_variables_using_openstack_rc.html

source: Use your credentials above to specify the cloud provider name, username, password, project_name and region_name in the file :file:`~/.config/openstack/clouds.yml`.
de: Verwenden Sie Ihre Anmeldeinformationen oben, um den Namen des Cloud-Providers, den Benutzernamen, das Kennwort, den Projektnamen und den Regionalnamen in der Datei anzugeben: file: `~/.config/openstack/clouds.yml`.
id: Gunakan kredensial Anda di atas untuk menentukan nama penyedia awan, nama pengguna, kata sandi, project_name dan region_name dalam file :file:`~/.config/openstack/clouds.yml`.
tr_tr: Bulut sağlayıcı ismini, kullanıcı ismini, parolayı, proje ismini ve bölge ismini :file:`~/.config/openstack/clouds.yml` dosyasında belirtmek için yukardaki kimlik bilgilerinizi kullanın.
