Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: If you do use a public cloud `known by shade <http://git.openstack.org/cgit/openstack/os-client-config/tree/os_client_config/vendors>`_, you can avoid specifying :code:`auth_url:` and instead specify :code:`profile: $PROVIDER_NAME` in the clouds.yml file.
de: Wenn Sie eine öffentliche Cloud benutzen, die durch shade bekannt ist <http://git.openstack.org/cgit/openstack/os-client-config/tree/os_client_config/vendors> `_, können Sie das Spezifizieren :code:`auth_url:` vermeiden und stattdessen angeben:code:`profile: $PROVIDER_NAME` in der clouds.yml-Datei.
tr_tr: `shade tarafından bilinen <http://git.openstack.org/cgit/openstack/os-client-config/tree/os_client_config/vendors>`_ bir açık bulut kullanıyorsanız, :code:`auth_url:` belirtmek yerine clouds.yml dosyasında :code:`profile: $PROVIDER_NAME` belirtebilirsiniz.

source: If you had a load balancer, you could distribute this load between the two different API services. You have several options. The :doc:`networking` section shows you one option.
de: Wenn Sie einen Load Balancer hätten, können Sie diese Last zwischen den beiden verschiedenen API-Diensten verteilen. Sie haben mehrere Möglichkeiten. Der :doc:`networking`-Bereich zeigt Ihnen eine Option.
id: Jika Anda memiliki penyeimbang beban, Anda dapat mendistribusikan beban ini di antara dua layanan API yang berbeda. Anda memiliki beberapa pilihan. Bagian :doc:`networking` menunjukkan satu pilihan.
tr_tr: Bir yük dengeleyiciniz vardıysa, bu yükü iki farklı API servisi arasında dağıtabilirdiniz. Birçok seçeneğiniz vardır. :doc:`networking` kısmı seçeneklerden birini gösterir.

source: If you have no free floating IPs that have been allocated for your project, first select a network which offer allocation of floating IPs. In this example we use network which is called :code:`public`.
de: Wenn Sie keine frei Floating-IPs haben, die für Ihr Projekt vergeben wurden, wählen Sie zunächst ein Netzwerk aus, das die Zuweisung von Floating-IPs anbietet. In diesem Beispiel verwenden wir das Netzwerk, das heißt :code:`public`.
id: Jika Anda tidak memiliki floating IP bebas yang telah dialokasikan untuk proyek Anda, pertama pilih jaringan yang menawarkan alokasi floating IP. Dalam contoh ini kita menggunakan jaringan yang disebut :code:`public`.
tr_tr: Projeniz için ayrılmış hiç boş değişken IP'niz yoksa, önce değişken IP'lerin ayrılmasını sunan bir ağ seçin. Bu örnekte :code:`public` olarak adlandırılan ağı kullanıyoruz.

source: If you have no free floating IPs that have been previously allocated for your project, first select a floating IP pool offered by your provider. In this example, we have selected the first one and assume that it has available IP addresses.
de: Wenn Sie keine frei Floating-IPs haben, die zuvor für Ihr Projekt reserviert wurden, wählen Sie zunächst einen Floating IP Pool, der von Ihrem Provider angeboten wird. In diesem Beispiel haben wir das erste ausgewählt und sind davon ausgegangen, dass es über IP-Adressen verfügt.
id: Jika Anda tidak memiliki floating IP bebas yang telah dialokasikan sebelumnya untuk proyek Anda, pertama pilih kolam floating IP yang ditawarkan oleh provider Anda. Dalam contoh ini, kami telah memilih yang pertama dan menganggapnya memiliki alamat IP yang tersedia.
tr_tr: Önceden projenize ayrılmış boşta değişken IP'leriniz yoksa, önce sağlayıcınız tarafından sunulan bir değişken IP havuzu seçin. Bu örnekte ilkini seçtik ve kullanılabilir IP adresleri olduğunu varsaydık.

source: If you have no free floating IPs that have been previously allocated for your project, then select a floating IP pool offered by your provider. In this example, we have selected the first one and assume that it has available IP addresses.
de: Wenn Sie keine frei Floating-IPs haben, die zuvor für Ihr Projekt reserviert wurden, wählen Sie einen Floating IP Pool, der von Ihrem Provider angeboten wird. In diesem Beispiel haben wir das erste ausgewählt und davon ausgegangen, dass es über IP-Adressen verfügt.
id: Jika Anda tidak memiliki floating IP bebas yang telah dialokasikan sebelumnya untuk proyek Anda, pilih kolam floating IP yang ditawarkan oleh provider Anda. Dalam contoh ini, kami telah memilih yang pertama dan menganggapnya memiliki alamat IP yang tersedia.
tr_tr: Önceden projenize ayrılmış boşta değişken IP'leriniz yoksa, önce sağlayıcınız tarafından sunulan bir değişken IP havuzu seçin. Bu örnekte ilkini seçtik ve kullanılabilir IP adresleri olduğunu varsaydık.

source: If you list existing instances:
de: Wenn Sie vorhandene Instanzen auflisten:
id: Jika Anda mendaftar instance yang ada:
tr_tr: Mevcut sunucuları listelerseniz:

source: If you list the instances again, the instance disappears.
de: Wenn Sie die Instanzen erneut auflisten, verschwindet die Instanz.
id: Jika Anda mendaftar instance lagi, instance menghilang.
tr_tr: Sunucuları tekrar listelerseniz, sunucu kaybolacaktır.

source: If you receive the :code:`libcloud.common.types.InvalidCredsError: 'Invalid credentials with the provider'` exception when you run one of these API calls, double-check your credentials.
de: Wenn Sie den :code: `libcloud.common.types.InvalidCredsError: 'Ungültige Anmeldeinformationen mit der Provider-Ausnahme erhalten, wenn Sie eines dieser API-Aufrufe ausführen, überprüfen Sie Ihre Anmeldeinformationen.
id: Jika Anda menerima pengecualian :code:`libcloud.common.types.InvalidCredsError: 'Invalid credentials with the provider'` saat menjalankan salah satu panggilan API ini, periksa kembali kredensial Anda.
tr_tr: Bu API çağrılarından birini çalıştırırken :code:`libcloud.common.types.InvalidCredsError: 'Sağlayıcıyla geçersiz kimlik bilgileri'` istisnasını alırsanız, kimlik bilgilerinizi tekrar kontrol edin.

source: If you receive the exception :code:`openstack.exceptions.HttpException: HttpException: 401 Client Error: Unauthorized,` while trying to run one of the following API calls please double-check your credentials.
de: Wenn Sie die Ausnahme erhalten :code: `openstack.exceptions.HttpException: HttpException: 401 Client-Fehler: Unbefugte` beim Versuch, einen der folgenden API-Aufrufe auszuführen, bitte überprüfen Sie Ihre Anmeldeinformationen.
id: Jika Anda menerima pengecualian :code:`openstack.exceptions.HttpException: HttpException: 401 Client Error: Unauthorized,` saat mencoba menjalankan salah satu panggilan API berikut, periksa kembali kredensial Anda.
tr_tr: Aşağıdaki API çağrılarından birini çalıştırmaya çalışırken :code:`openstack.exceptions.HttpException: HttpException: 401 İstemci Hatası: Yetkilendirilmemiş,` istisnasını alırsanız lütfen kimlik bilgilerinizi tekrar kontrol edin.

source: If you see an IOError, you may need to change ``~/.ssh/`` to ``/home/{USERNAME}/.ssh/``, using an absolute path.
de: Wenn Sie einen IOError sehen, müssen Sie ``~/.ssh/`` zu ``/home/{USERNAME}/.ssh/`` ändern, indem Sie einen absoluten Pfad verwenden.
id: Jika Anda melihat IOError, Anda mungkin perlu mengubahnya ``~/.ssh/`` ke ``/home/{USERNAME}/.ssh/``, menggunakan jalur absolut.
tr_tr: Bir IOError görürseniz, ``~/.ssh/`` konumunu ``/home/{USERNAME}/.ssh/`` şeklinde mutlak yolla değiştirmeniz gerekebilir.

source: If you think about how you traditionally make what you store durable, you quickly conclude that keeping multiple copies of your objects on separate systems is a good way strategy. However, keeping track of those multiple copies is difficult, and building that into an app requires complicated logic.
de: Wenn Sie darüber nachdenken, was Sie traditionell machen, um sie haltbar zu speichern, merken Sie schnell, dass das Halten mehrerer Kopien Ihrer Objekte auf getrennten Systemen eine gute Wegstrategie ist. Allerdings ist die Verfolgung dieser Mehrfachkopien schwierig, und das Erstellen einer in eine App erfordert komplizierte Logik.
id: Jika Anda memikirkan bagaimana Anda secara tradisional membuat apa yang Anda simpan dengan tahan lama, Anda dapat dengan cepat menyimpulkan bahwa menyimpan banyak salinan objek Anda pada sistem yang terpisah adalah strategi strategi yang bagus. Namun, mencatat banyak salinan itu sulit dilakukan, dan membangunnya ke dalam sebuah aplikasi membutuhkan logika yang rumit.
tr_tr: Geleneksel olarak kaydettiğiniz bir şeyi nasıl dayanılı yaptığınızı düşünürseniz, nesnelerinizin çoklu kopyalarını farklı sistemlerde tutmanın iyi bir strateji olduğu sonucuna varabilirsiniz. Ancak, bu çoklu kopyaları takip etmek zordur, ve bunu bir uygulamada inşa etmek karmaşık bir mantık gerektirir.

source: If you work with large objects, use the :code:`RegionScopedBlobStoreContext` class family instead of the ones used so far.
de: Wenn Sie mit großen Objekten arbeiten, verwenden Sie die :code: `RegionScopedBlobStoreContext` Klassefamilie anstelle der bisher verwendeten.
id: Jika Anda bekerja dengan objek besar, gunakan keluarga kelas :code:`RegionScopedBlobStoreContext` dan bukan yang digunakan sejauh ini.
tr_tr: Büyük nesnelerle çalışıyorsanız, şimdiye kadarkiler yerine :code:`RegionScopedBlobStoreContext` sınıf ailesini kullanın.

source: If you work with large objects, use the :code:`ex_multipart_upload_object` call instead of the simpler :code:`upload_object` call. The call splits the large object into chunks and creates a manifest so that the chunks can be recombined on download. Change the :code:`chunk_size` parameter, in bytes, to a value that your cloud can accept.
de: Wenn Sie mit großen Objekten arbeiten, verwenden Sie den :code: `ex_multipart_upload_object` anstelle des einfacheren :code:` upload_object` call. Der Aufruf spaltet das große Objekt in Chunks und schafft ein Manifest, so dass die Chunks beim Download rekombiniert werden können. Ändern Sie den :code: `chunk_size` Parameter, in Bytes, auf einen Wert, den Ihre Cloud akzeptieren kann.
id: Jika Anda bekerja dengan objek besar, gunakan panggilan :code:`ex_multipart_upload_object` daripada panggilan lebih sederhana :code:`upload_object`. Panggilan membagi objek besar menjadi potongan dan menciptakan manifes sehingga potongan dapat digabungkan kembali pada unduhan. Ubah parameter :code:`chunk_size` , dalam satuan byte, ke nilai yang bisa diterima awan Anda.
tr_tr: Büyük nesnelerle çalışıyorsanız, daha basit olan :code:`upload_object` çağrısı yerine :code:`ex_multipart_upload_object` çağrısını kullanın. Çağrı büyük nesneyi parçalara böler ve bir bildiri oluşturarak indirme zamanında parçaların tekrar birleştirilebilmesini sağlar. :code.`chunk_size` parametresini bulutunuzun kabul edeceği bir değere bayt olarak ayarlayın.

source: If your provider does not support regions, try a blank string ('') for the `region_name`.
de: Wenn Ihr Provider keine Regionen unterstützt, versuchen Sie einen leeren String ('') für den 'region_name`.
id: Jika penyedia Anda tidak mendukung region (daerah), cobalah string kosong ('') untuk `region_name`.
tr_tr: Sağlayıcınız bölgeleri desteklemiyorsa, `region_name` için boş bir karakter dizisi ('') deneyin.

source: In a new Terminal window, SSH into the 'api' API instance. Use the key pair name that you passed in as a parameter.
de: In einem neuen Terminal-Fenster, SSH in die 'API-API-Instanz'. Verwenden Sie den Schlüsselpaarnamen, den Sie als Parameter übergeben haben.
id: Di jendela Terminal yang baru, SSH masuk ke instance API 'api'. Gunakan nama pasangan kunci yang Anda disampaikan sebagai parameter.
tr_tr: Yeni bir Terminal penceresinde, 'api' API sunucusuna SSH çekin. Parametre olarak verdiğiniz anahtar çifti ismini kullanın.

source: In addition to configuring backups, review your policies about what you back up and how long to retain each backed up item.
de: Zusätzlich zur Konfiguration von Backups, überprüfen Sie Ihre Richtlinien über das, was Sie sichern und wie lange, um jedes gesicherte Element zu behalten.
id: Selain mengonfigurasi cadang, tinjaulah kebijakan Anda tentang apa yang Anda cadangkan dan berapa lama untuk menyimpan setiap item dicadangkan.
tr_tr: Yapılandırma yedeklerine ek olarak, neleri yedeklediğinizle ve yedeklenen her ögeyi ne kadar tutacağınızla ilgili ilkelerinizi gözden geçirin.

source: In addition to this kind of monitoring, you should consider availability monitoring. Although your application might not care about a failed worker, it should care about a failed database server.
de: Zusätzlich zu dieser Art der Überwachung sollten Sie die Verfügbarkeitsüberwachung berücksichtigen. Obwohl Ihre Anwendung sich nicht um einen gescheiterten Worker kümmern sollte, sollte sie es bei einen fehlgeschlagenen Datenbankserver tun.
id: Selain pemantauan semacam ini, Anda harus mempertimbangkan pemantauan ketersediaan. Meskipun aplikasi Anda mungkin tidak peduli dengan pekerja yang gagal, hal itu harus peduli dengan server database yang gagal.
tr_tr: Bu tür izlemeye ek olarak, kullanılırlık izlemesini de düşünmelisiniz. Uygulamanız başarısız olan bir işçiyle ilgilenmiyor olsa bile, başarısız bir veritabanı sunucusunu göz önüne almalıdır.

source: In cloud programming, it is very different. Rather than large, expensive servers, you have virtual machines that are disposable; if something goes wrong, you shut the server down and spin up a new one. There is still operations staff, but rather than nursing individual servers back to health, their job is to monitor the health of the overall system.
de: Bei der Cloud-Programmierung ist es ganz anders. Anstatt große, teure Server, haben Sie virtuelle Maschinen, die Einweg sind; Wenn etwas schief geht, fahren Sie den Server herunter und erzeugen einen neuen. Es gibt immer noch Betriebs-Mitarbeiter, aber anstatt einzelne Server zu pflegen und zu betreuen, ist es ihre Aufgabe, die Gesundheit des Gesamtsystems zu überwachen.
id: Dalam pemrograman awan, sangat berbeda. Daripada server besar dan mahal, Anda memiliki mesin virtual yang bisa dipakai; Jika ada yang tidak beres, Anda mematikan server dan memutar yang baru. Masih ada staf operasi, tapi bukannya mengelola server individual kembali ke kesehatan, tugas mereka adalah memantau kesehatan keseluruhan sistem.
tr_tr: Bulut programlamada, çok daha farklıdır. Büyük, pahalı sunucular yerine, atılabilir sanal sunucularınız vardır; bir şeyler ters giderse, sunucuyu kapatır ve yeni bir tanesini açarsınız. Yine işletici çalışanlar olur, ama tek tek sunucuları kurtarmaya çalışmak yerine, işleri genel sistem sağlığını izlemektir.

source: In cloud programming, there is a well-known analogy known as "cattle vs pets". If you have not heard it before, it goes like this:
de: In der Cloud-Programmierung gibt es eine bekannte Analogie, die als 'Vieh vs Haustiere' bekannt ist. Wenn Sie es noch nicht gehört haben, geht es so:
id: Dalam pemrograman awan, ada analogi terkenal yang dikenal sebagai "cattle vs pets". Jika Anda belum pernah mendengarnya, itu seperti ini:
tr_tr: Bulut programlamada "sığırlara karşı evcil hayvanlar" olarak bilinen bir benzeşim vardır. Daha önce duymadıysanız şu şekilde bir şey:

source: In earlier sections, the Fractal application used an installation script into which the metadata API passed parameters to bootstrap the cluster. `Etcd <https://github.com/coreos/etcd>`_ is "a distributed, consistent key-value store for shared configuration and service discovery" that you can use to store configurations. You can write updated versions of the Fractal worker component to connect to Etcd or use `Confd <https://github.com/kelseyhightower/confd>`_ to poll for changes from Etcd and write changes to a configuration file on the local file system, which the Fractal worker can use for configuration.
de: In früheren Abschnitten verwendete die Fractal-Anwendung ein Installationsskript, in das die Metadaten-API übergeben wurde, um den Cluster zu booten. `etcd <https://github.com/coreos/etcd> `_ ist' ein verteilter, konsistenter Key-Value-Store für gemeinsame Konfiguration und Service Discovery ', den Sie verwenden können, um Konfigurationen zu speichern. Sie können aktualisierte Versionen der Fractal Worker-Komponente schreiben, um eine Verbindung zu etcd herzustellen oder `confd <https://github.com/kelseyhightower/confd> `_, um für Änderungen von etcd abzufragen und Änderungen an einer Konfigurationsdatei auf dem lokalen Dateisystem zu schreiben, die der Fractal-Arbeiter zur Konfiguration verwenden kann.
id: Pada bagian sebelumnya, aplikasi Fractal menggunakan skrip instalasi dimana metadata API melewati parameter untuk melakukan bootstrap cluster. `Etcd <https://github.com/coreos/etcd>` _ adalah "a distributed, consistent key-value store for shared configuration and service discovery" yang dapat Anda gunakan untuk menyimpan konfigurasi. Anda dapat menulis versi terbaru komponen Fractal worker untuk terhubung ke Etcd atau menggunakan `Confd <https://github.com/kelseyhightower/confd>` _ untuk membuat jajak pendapat atas perubahan dari Etcd dan tulis perubahan pada file konfigurasi pada sistem file lokal, yang dapat digunakan oleh Fractal worker untuk konfigurasi.
tr_tr: Önceki kısımlarda, Fraktal uygulama metaveri API'sinin kümeyi önyüklemek için parametreler geçirdiği bir kurulum betiği kullandı. `Etcd <https://github.com/coreos/etcd>`_ yapılandırmaları saklayabileceğiniz "paylaşımlı yapılandırma ve servis keşfi için dağıtık, tutarlı anahtar-değer deposudur". Fraktal işçi bileşeninin güncel sürümlerini yazarak Etcd'ye bağlanmasını veya `Confd <https://github.com/kelseyhightower/confd>`_ kullanarak değişiklikleri Etcd'den çekmesini ve yerel dosya sistemindeki bir dosyaya yazmasını sağlayabilirisiniz.

source: In openstacksdk parameter :code:`ex_userdata` is called :code:`user_data` and parameter :code:`ex_keyname` is called :code:`key_name`.
de: Im openstacksdk-Parameter :code:`ex_userdata` heißt :code:`user_data` und Parameter :code:`ex_keyname` heißt :code:`key_name`.
id: Dalam parameter openstacksdk :code:`ex_userdata` is called :code:`user_data` dan parameter :code:`ex_keyname` disebut :code:`key_name`.
tr_tr: Openstacksdk'da :code:`ex_userdata` parametresi :code:`user_data` olarak, :code:`ex_keyname` ise :code:`key_name` olarak adlandırılır.

source: In previous chapters, all nodes that comprise the fractal application were attached to the same network.
de: In früheren Kapiteln wurden alle Knoten, die die Fraktalanwendung enthalten, an das gleiche Netzwerk angeschlossen.
id: Pada bab sebelumnya, semua node yang terdiri dari aplikasi fraktal dilekatkan pada jaringan yang sama.
tr_tr: Önceki bölümlerde, fraktal uygulamayı oluşturan tüm düğümler aynı ağa bağlıydı.

source: In previous sections, you used your SDK to programmatically interact with OpenStack. In this section, you use the 'heat' command-line client to access the Orchestration API directly through template files.
de: In früheren Abschnitten haben Sie mit Ihrem SDK programmgesteuert mit OpenStack interagiert. In diesem Abschnitt verwenden Sie den 'heat' Befehlszeilenclient, um über die Vorlagendateien direkt auf die Orchestrierungs-API zuzugreifen.
id: Di bagian sebelumnya, Anda menggunakan SDK untuk berinteraksi secara pemrograman dengan OpenStack. Pada bagian ini, Anda menggunakan klien command-line 'heat' untuk mengakses Orchestration API secara langsung melalui file template.
tr_tr: Önceki kısımlarda, programlı şekilde OpenStack ile etkileşmek için SDK'nızı kullandınız. Bu kısımda Orkestrasyon API'sine doğrudan şablon dosyaları aracılığıyla erişmek için 'heat' komut satırı istemcisini kullanırsınız.

source: In the Terminal window where you run ceilometer, run :code:`ceilometer_sample_query` to see the samples.
de: Im Terminalfenster, wo Sie den Ceilometer laufen haben, führen Sie :code: `ceilometer_sample_query` aus, um die Samples zu sehen.
id: Di jendela Terminal tempat Anda menjalankan ceilometer, jalankan :code:`ceilometer_sample_query` untuk melihat sampelnya.
tr_tr: Örnekleri görmek için, terminal penceresinde ceilometer'i çalıştırdığınız yerde :code:`ceilometer_sample_query` çalıştırın.

source: In the following example, set :code:`pub_key_file` to the location of your public SSH key file.
de: Im folgenden Beispiel setzen Sie :code:`pub_key_file` an den Speicherort Ihrer öffentlichen SSH-Schlüsseldatei.
id: Pada contoh berikut, mengatur :code:`pub_key_file` ke lokasi file kunci SSH publik Anda.
tr_tr: Aşağıdaki örnekte, :code:`pub_key_file`'yi açık SSH anahtarı dosyanızın konumuna ayarlayın.

source: In the outputs section of the stack, you can run these web API calls:
de: Im Ausgabebereich des Stacks können Sie diese Web-API-Aufrufe ausführen:
id: Di bagian keluaran stack, Anda dapat menjalankan panggilan API web ini:
tr_tr: Yığının çıktılar kısmında, şu web API çağrılarını çalıştırabilirsiniz:

source: In the previous steps, you split out several services and expanded capacity. To see the new features of the Fractals application, SSH to one of the app instances and create a few fractals.
de: In den vorherigen Schritten haben Sie mehrere Dienste aufgeteilt und Kapazitäten erweitert. Um die neuen Features der Fractals-Anwendung zu sehen, verbinden Sie sich mit SSH zu einer der App-Instanzen und erstellen Sie ein paar Fraktale.
id: Pada langkah sebelumnya, Anda membagi beberapa layanan dan kapasitas yang diperluas. Untuk melihat fitur baru aplikasi Fractal, SSH ke salah satu instance aplikasi dan membuat beberapa fraktal.
tr_tr: Önceki adımlarda, çeşitli servisleri ayırdınız ve kapasiteyi genişlettiniz. Fraktal uygulamasının yeni özelliklerini görmek için, uygulama sunucularından birine SSH çekin ve yeni fraktallar oluşturun.

source: In theory, you could use a simple script to monitor the load on your workers and API services and trigger the creation of instances, which you already know how to do. Congratulations! You are ready to create scalable cloud applications.
de: In der Theorie können Sie ein einfaches Skript verwenden, um die Belastung Ihrer Worker und API-Dienste zu überwachen und die Erstellung von Instanzen auszulösen, die Sie bereits kennen. Glückwunsch! Sie sind bereit, skalierbare Cloud-Anwendungen zu erstellen.
id: Secara teori, Anda bisa menggunakan skrip sederhana untuk memantau beban pada pekerja dan layanan API Anda dan memicu terciptanya instance, yang sudah Anda ketahui bagaimana melakukannya. Selamat! Anda siap membuat aplikasi cloud scalable.
tr_tr: Teorik olarak, basit bir betik kullanarak işçileriniz ve API servisleriniz üzerindeki yükü izleyerek sunucuların oluşturulmasını tetikleyebilirdiniz, ki bunu yapmayı zaten biliyorsunuz. Tebrikler! Ölçeklenebilir bulut uygulamaları oluşturmaya hazırsınız.

source: In this case, we are presenting a shell script as the `userdata <https://cloudinit.readthedocs.org/en/latest/topics/format.html#user-data-script>`_. When :code:`create_node` creates the instance, :code:`cloud-init` executes the shell script in the :code:`userdata` variable.
de: In diesem Fall präsentieren wir ein Shell-Skript als `userdata <https://cloudinit.readthedocs.org/en/latest/topics/format.html#user-data-script> `_. Wenn :code:`create_node` die Instanz erstellt, wird :code:`cloud-init` als Shell-Skript in der Variable :code:`userdata` ausgeführt.
id: Dalam hal ini, kami menyajikan sebuah skrip shell sebagai `userdata <https://cloudinit.readthedocs.org/en/latest/topics/format.html#user-data-script>`_. Ketika :code:`create_node` Menciptakan instance, :code:`cloud-init` Mengeksekusi skrip shell di variable :code:`userdata`.
tr_tr: Bu durumda, `userdata <https://cloudinit.readthedocs.org/en/latest/topics/format.html#user-data-script>`_ olarak bir kabuk betiğini sunuyoruz. :code:`create_node` sunucuyu oluşturduğunda, :code:`cloud-init` :code:`userdata` değişkenindeki kabuk betiğini çalıştırır.
