Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: Message queues are used to facilitate communication between the Fractal application services. The Fractal application uses a `work queue <https://www.rabbitmq.com/tutorials/tutorial-two-python.html>`_ (or task queue) to distribute tasks to the worker services.
de: Message-Warteschlangen werden verwendet, um die Kommunikation zwischen den Fractal-Anwendungsdiensten zu erleichtern. Die Fractal-Anwendung verwendet eine 'Warteschlange' <https://www.rabbitmq.com/tutorials/tutorial-two-python.html> `_ (oder Task-Warteschlange), um Aufgaben an die Worker-Services zu verteilen.
id: Pesan antrian digunakan untuk memudahkan komunikasi antara layanan aplikasi Fraktal. Aplikasi Fraktal menggunakan `work queue <https://www.rabbitmq.com/tutorials/tutorial-two-python.html>`_ (atau task queue) untuk mendistribusikan task (tugas) ke layanan pekerja.
tr_tr: İleti kuyrukları Fraktal uygulama servisleri arasındaki iletişimi kolaylaştırmak için kullanılır. Fraktal uygulaması görevleri işçi servislere dağıtmak için bir `iş kuyruğu <https://www.rabbitmq.com/tutorials/tutorial-two-python.html>`_ (veya görev kuyruğu) kullanır.

source: Message queues work in a way similar to a queue (or a line, for those of us on the other side of the ocean) in a bank being served by multiple clerks. The message queue in our application provides a feed of work requests that can be taken one-at-a-time by worker services, whether there is a single worker service or hundreds of them.
de: Message-Warteschlangen arbeiten ähnlich wie eine Warteschlange (oder eine Reihe, für diejenigen von uns auf der anderen Seite des Ozeans) in einer Bank, die von mehreren Angestellten bedient wird. Die Meldungswarteschlange in unserer Anwendung bietet einen Feed von Arbeitsanfragen, die von den Arbeitnehmerdiensten ein-zu-Zeit genommen werden können, ob es einen einzelnen Workerservice oder Hunderte von ihnen gibt.
id: Pesan antrian bekerja dengan cara yang mirip dengan antrean (atau berbaris, bagi kita di sisi lain lautan) di bank yang dilayani oleh beberapa pegawai. Antrian pesan dalam aplikasi kami memberikan umpan permintaan kerja yang dapat dilakukan satu per satu oleh pekerja, apakah ada satu layanan pekerja ataupun ratusan di antaranya.
tr_tr: İleti kuyrukları birçok yazmanın çalıştığı bir banka kuyruğuyla (veya okyanusun diğer tarafında olan bizler için sırasıyla) aynı şekilde çalışır. Uygulamamızdaki ileti kuyruğu işçi servislerce her seferde bir tane alınabilen iş isteği beslemesi sağlar, bir tane işçi olsa da yüzlerce işçi olsa da bir şey değişmez.

source: Modularity and micro-services
de: Modularität und Mikro-Dienste
id: Modularitas dan micro-services
tr_tr: Modülerlik ve mikro servisler

source: Monitoring
de: Überwachung
id: Mengamati
tr_tr: İzleme

source: Monitoring is essential for 'scalable' cloud applications. You must know how many requests are coming in and the impact that these requests have on various services. You must have enough information to determine whether to start another worker or API service as you did in :doc:`/scaling_out`.
de: Die Überwachung ist für 'skalierbare' Cloud-Anwendungen unerlässlich. Sie müssen wissen, wie viele Anfragen kommen und die Auswirkungen, die diese Anfragen auf verschiedene Dienste haben. Sie müssen genügend Informationen haben, um festzustellen, ob ein anderer Worker oder ein API-Dienst wie folgt ausgegeben werden soll: doc: `/scaling_out`.
id: Pemantauan sangat penting untuk aplikasi awan 'scalable'. Anda harus tahu berapa banyak permintaan yang masuk dan dampak dari permintaan ini terhadap berbagai layanan. Anda harus memiliki cukup informasi untuk menentukan apakah akan memulai layanan pekerja (worker) atau API lain seperti yang Anda lakukan di :doc:`/scaling_out`.
tr_tr: 'Ölçeklenebilir' bulut uygulamaları için izleme esastır. Kaç tane isteğin geldiğini ve bu isteklerin çeşitli servisler üstünde nasıl etki edeceğini bilmek zorundasınız. :doc:`/scaling_out` kısmında yaptığınız gibi başka bir işçi veya API servisi başlatıp başlatmamak için karar vermek için yeterli bilgiye sahip olmalısınız.

source: Most cloud providers make a public network accessible to you. We will attach a router to this public network to grant Internet access to our instances. After also attaching this router to our internal networks, we will allocate floating IPs from the public network for instances which need to be accessed from the Internet.
de: Die meisten Cloud-Provider machen ein öffentliches Netzwerk für Sie zugänglich. Wir werden einen Router an dieses öffentliche Netz anschließen, um den Internet-Zugang zu unseren Instanzen zu gewähren. Nachdem wir diesen Router auch an unsere internen Netzwerke angehängt haben, werden wir aus dem öffentlichen Netz Floating-IPs aus dem öffentlichen Netz zuordnen, für die aus dem Internet zugegriffen werden muss.
id: Sebagian besar penyedia layanan cloud membuat jaringan publik dapat diakses oleh Anda. Kami akan memasang router ke jaringan publik ini untuk memberikan akses Internet ke instance kami. Setelah memasang router ini ke jaringan internal kami, kami akan mengalokasikan IP floating dari jaringan publik untuk instance yang perlu diakses dari Internet.
tr_tr: Çoğu bulut sağlayıcı size erişebileceğiniz bir açık ağ yapar. Bu açık ağa bir yönlendirici ekleyerek sunucularımıza internet erişimi sağlayacağız. Bu yönlendiriciyi iç ağlarımıza da ekledikten sonra internet erişimine ihtiyaç duyan sunucularımız için açık ağdan değişken IP'ler ayıracağız.

source: Most cloud providers provision all network objects that are required to boot an instance. To determine whether these objects were created for you, access the Network Topology section of the OpenStack dashboard.
de: Die meisten Cloud-Provider stellen alle Netzwerkobjekte bereit, die zum Booten einer Instanz erforderlich sind. Um festzustellen, ob diese Objekte für Sie erstellt wurden, rufen Sie den Abschnitt 'Netzwerk-Topologie' des OpenStack-Dashboards auf.
id: Sebagian besar penyedia layanan awan menyediakan semua objek jaringan yang diperlukan untuk melakukan booting sebuah instance. Untuk menentukan apakah objek ini dibuat untuk Anda, akses bagian Network Topology pada dasbor OpenStack.
tr_tr: Çoğu bulut sağlayıcı bir sunucunun önyüklenmesi için gerekli tüm ağ nesnelerini hazırlar. Bu nesnelerin oluşturulup oluşturulmadığını belirlemek için OpenStack kontrol panosundaki Ağ Topolojisi kısmına erişin.

source: Most instances require access to the Internet. The instances in your Fractals app are no exception! Add routers to pass traffic between the various networks that you use.
de: Die meisten Instanzen benötigen Zugang zum Internet. Die Instanzen in Ihrer Fractals App sind keine Ausnahme! Fügen Sie Router hinzu, um den Datenverkehr zwischen den verschiedenen Netzwerken, die Sie verwenden, zu übergeben.
id: Sebagian besar instance memerlukan akses ke Internet. Instance di aplikasi Fraktal Anda tidak terkecuali! Tambahkan router untuk melewati lalu lintas antara berbagai jaringan yang Anda gunakan.
tr_tr: Çoğu sunucu internete erişim gerektirir. Fraktallar uygulamanızdaki sunucular da buna dahildir! Kullandığınız çeşitli ağlar arasında trafik geçişi için yönlendiriciler ekleyin.

source: Multiple clouds
de: Mehrere Clouds
tr_tr: Çoklu bulutlar

source: Network access. By default, OpenStack filters all traffic. You must create a security group and apply it to your instance. The security group allows HTTP and SSH access. We will go into more detail in :doc:`/introduction`.
de: Netzwerkzugang. Standardmäßig filtert OpenStack den gesamten Traffic. Sie müssen eine Sicherheitsgruppe erstellen und diese auf Ihre Instanz anwenden. Die Sicherheitsgruppe ermöglicht HTTP- und SSH-Zugriff. Wir werden ausführlicher in :doc:`/introduction`.
id: Akses jaringan. Secara default, OpenStack menyaring semua lalu lintas. Anda harus membuat grup keamanan dan menerapkannya pada instance Anda. Grup keamanan mengizinkan akses HTTP dan SSH. Kami akan membahas lebih rinci :doc:`/introduction`.
tr_tr: Ağ erişimi. Öntanımlı olarak, OpenStack tüm trafiği süzer. Bir güvenlik grubu oluşturmalı ve bunu sunucunuza uygulamalısınız. Güvenlik grubu HTTP ve SSH erişimine izin verir. :doc:`/introduction` da ayrıntıya gireceğiz.

source: Networking
de: Vernetzung
id: Jaringan
tr_tr: Ağ

source: Networking segmentation
de: Vernetzungsegmentierung
id: Segmentasi jaringan
tr_tr: Ağ dilimlendirme

source: Next steps
de: Nächste Schritte
id: Langkah selanjutnya
tr_tr: Sonraki adımlar

source: Next, back up all existing fractals from the database to the swift container. A simple loop takes care of that:
de: Als nächstes unterstützen Sie alle vorhandenen Fraktale aus der Datenbank in den swift Container. Eine einfache Schleife kümmert sich darum:
id: Selanjutnya, cadangkan semua fraktal yang ada dari database ke swift container. Sebuah loop sederhana menangani hal itu:
tr_tr: Ardından, mevcut tüm fraktalları veritabanından swift kapsayıcısına yedekleyin. Bunu yapmak için basit bir döngü yeterlidir:

source: Next, create a network and subnet for the API servers.
de: Als nächstes erstellen Sie ein Netzwerk und Subnetz für die API-Server.
id: Selanjutnya, buat jaringan dan subnet untuk server API.
tr_tr: Ardından, API sunucuları için bir ağ ve alt ağ oluşturun.

source: Next, create a network and subnet for the workers.
de: Als nächstes erstellen Sie ein Netzwerk und Subnetz für die Worker.
id: Selanjutnya, buat jaringan dan subnet untuk para pekerja.
tr_tr: Ardından işçiler için bir ağ ve alt ağ oluşturun.

source: Next, create additional floating IPs. Specify the fixed IP addresses they should point to and the ports that they should use:
de: Als nächstes erstellen Sie zusätzliche Floating-IPs. Geben Sie die festen IP-Adressen an, auf die sie verweisen sollen, und die Ports, die sie verwenden sollten:
id: Selanjutnya, buat floating IP tambahan. Tentukan alamat IP tetap yang harus mereka tunjuk dan port yang harus mereka gunakan:
tr_tr: Ardından, ek değişken IP'ler oluşturun. Göstermeleri gereken sabit IP adreslerini ve kullanmaları gereken bağlantı noktalarını belirtin:

source: Next, start a second instance, which will be the worker instance:
de: Als nächstes starten Sie eine zweite Instanz, die die Worker-Instanz sein wird:
id: Selanjutnya, mulai instance kedua, yang akan menjadi instance pekerja:
tr_tr: Ardından işçi sunucusu olacak ikinci bir sunucuyu başlatın:

source: Next, tell the script which flavor you want to use:
de: Als nächstes sagen Sie dem Skript, welche Variante Sie verwenden möchten:
id: Selanjutnya, beritahu script yang flavor ingin Anda gunakan:
tr_tr: Ardından betiğe kullanmak istediğiniz niteliği söyleyin:

source: Note that the worker instance is part of an :code:`OS::Heat::AutoScalingGroup`.
de: Beachten Sie, dass die Worker-Instanz Teil eines :code:`OS::Heat::AutoScalingGroup` ist.
id: Perhatikan bahwa instance pekerja adalah bagian dari :code:`OS::Heat::AutoScalingGroup`.
tr_tr: İşçi sunucunun bir :code:`OS::Heat::AutoScalingGroup` parçası olduğuna dikkat edin.

source: Note that this time, when you create a security group, you include a rule that applies to only instances that are part of the worker group.
de: Beachten Sie, dass dieses Mal, wenn Sie eine Sicherheitsgruppe erstellen, eine Regel enthält, die nur für Instanzen gilt, die Teil der Worker-Gruppe sind.
id: Perhatikan bahwa saat ini, saat Anda membuat grup keamanan, Anda menyertakan aturan yang hanya berlaku untuk instance yang merupakan bagian dari grup pekerja.
tr_tr: Bu sefer bir güvenlik grubu oluştururken yalnızca işçi grubunun parçası olan sunuculara uygulanan bir kural dahil ettiğinize dikkat edin.

source: Note that we will be showing the commands in a more idiomatic Java way: as methods on a class.
de: Beachten Sie, dass wir die Befehle in einer idiomatischeren Java-Weise darstellen werden: als Methoden für eine Klasse.
id: Perhatikan bahwa kita akan menunjukkan perintah dengan Java way: yang lebih idiomatik: sebagai metode di kelas.
tr_tr: Komutları Java ifade tarzına uygun yolla gösterdiğimize dikkat edin; bir sınıf üzerindeki yöntemler olarak.

source: Notice that you have added this instance to the worker_group, so it can access the controller.
de: Beachten Sie, dass Sie diese Instanz der worker_group hinzugefügt haben, damit sie auf den Controller zugreifen kann.
id: Perhatikan bahwa Anda telah menambahkan instance ini ke worker_group, sehingga bisa mengakses controller.
tr_tr: Kontrolcüye erişebilmesi için bu sunucuyu işçi grubuna eklediğinize dikkat edin.

source: Now call the Fractal application's command line interface (:code:`faafo`) to request a few new fractals. The following command requests a few fractals with random parameters:
de: Rufen Sie nun die Befehlszeilenschnittstelle der Fractal-Anwendung an (:code:`faafo`), um ein paar neue Fraktale anzufordern. Der folgende Befehl fordert einige Fraktale mit zufälligen Parametern an:
id: Sekarang panggil antarmuka command line aplikasi Fraktal (:code:`faafo`) untuk meminta beberapa fraktal baru. Perintah berikut meminta beberapa fraktal dengan parameter acak:
tr_tr: Şimdi Fraktal uygulamasının komut satırı arayüzünü (:code:`faafo`) kullanarak birkaç yeni fraktal isteyin. Aşağıdaki komut rasgele parametrelerle birkaç fraktal ister:

source: Now create a virtual IP that will be used to direct traffic between the various members of the pool:
de: Erstellen Sie nun eine virtuelle IP, die für den direkten Verkehr zwischen den verschiedenen Mitgliedern des Pools verwendet wird:
id: Sekarang buat IP virtual yang akan digunakan untuk mengarahkan lalu lintas antar berbagai anggota pool:
tr_tr: Şimdi havuzun çeşitli üyeleri arasında trafik yönlendirmek için kullanılacak bir sanal IP oluşturun:

source: Now if you make a request for a new fractal, you connect to the controller instance, :code:`app-controller`, but the work will actually be performed by a separate worker instance - :code:`app-worker-1`.
de: Nun, wenn Sie eine Anfrage für ein neues Fraktal machen, verbinden Sie sich mit der Controller-Instanz :code:`App-Controller`, aber die Arbeit wird tatsächlich von einer separaten Worker-Instanz durchgeführt - :code:` app-worker-1` .
id: Sekarang jika Anda membuat permintaan untuk fraktal baru, Anda terhubung ke instance pengontrol, :code:`app-controller`, tapi pekerjaan sebenarnya akan dilakukan oleh instance pekerja yang terpisah - :code:`app-worker-1`.
tr_tr: Şimdi bir fraktal isteğinde bulunursanız, :code:`app-controller` kontrol sunucusuna bağlanırsınız, ama asıl iş ayrı bir :code:`app-worker-1` işçi sunucusunda yapılacaktır.

source: Now log into the controller instance, :code:`app-controller`, also with SSH, using the previously added SSH key pair "demokey".
de: Melden Sie sich jetzt bei der Controller-Instanz an :code:`app-controller`, auch mit SSH, mit dem zuvor hinzugefügten SSH-Schlüsselpaar' demokey ' an .
id: Sekarang masuk ke instance controller, :code:`app-controller`, juga dengan SSH, gunakan pasangan kunci SSH yang sebelumnya ditambahkan"demokey ".
tr_tr: Şimdi daha önceden eklenmiş "demokey" SSH anahtar çiftini kullanarak :code:`app-controller` kontrol sunucusuna giriş yapın.

source: Now prepare the empty block device.
de: Jetzt das leere Blockgerät vorbereiten.
id: Sekarang siapkan perangkat blok kosong.
tr_tr: Şimdi boş blok aygıtı hazırlayın.

source: Now request an address from this network to be allocated to your project.
de: Fordern Sie nun eine Adresse aus diesem Netzwerk an, die Ihrem Projekt zugeordnet werden soll.
id: Sekarang minta alamat dari jaringan ini untuk dialokasikan ke proyek Anda.
tr_tr: Şimdi bu ağdan projenize ayırmak üzere bir adres isteyin.

source: Now request that an address from this pool be allocated to your project.
de: Bitte fordern Sie an, dass eine Adresse aus diesem Pool Ihrem Projekt zugewiesen wird.
id: Sekarang minta agar alamat dari kolam ini dialokasikan untuk proyek Anda.
tr_tr: Şimdi bu havuzdan bir adresin projenize ayrılmasını isteyin.

source: Now that you have an unused floating IP address allocated to your project, attach it to an instance.
de: Nun, da Sie eine unbenutzte Floating-IP-Adresse für Ihr Projekt zugeordnet haben, fügen Sie es an eine Instanz.
id: Sekarang Anda memiliki alamat floating IP yang tidak terpakai yang dialokasikan untuk proyek Anda, kaitkan ke sebuah instance.
tr_tr: Artık projenize ayrılmış kullanılmayan bir değişken IP adresi olduğuna göre, sunucuya ekleyebilirsiniz.

source: Now that you have got the networks created, go ahead and create two Floating IPs, for web servers. Ensure that you replace 'public' with the name of the public/external network offered by your cloud provider.
de: Jetzt haben Sie die Netzwerke erstellt, gehen Sie vor und erstellen Sie zwei Floating IPs, für Web-Server. Stellen Sie sicher, dass Sie 'public' durch den Namen des öffentlichen/externen Netzwerks ersetzen, das von Ihrem Cloud-Provider angeboten wird.
id: Sekarang setelah Anda mendapatkan jaringan yang dibuat, lanjutkan dan buat dua Floating IP, untuk server web. Pastikan Anda mengganti 'public' dengan nama jaringan public/external yang ditawarkan oleh penyedia awan Anda.
tr_tr: Artık ağları oluşturduğunuza göre, devam edin ve web sunucuları için iki değişken IP oluşturun. 'public' kısmını bulut sağlayıcınız tarafından sağlanan açık/harici ağ ismiyle değiştirdiğinizden emin olun.

source: Now that you have prepared the networking infrastructure, you can go ahead and boot an instance on it. Ensure you use appropriate flavor and image values for your cloud - see :doc:`getting_started` if you have not already.
de: Nun, da Sie die Netzwerk-Infrastruktur vorbereitet haben, können Sie voran gehen und eine Instanz auf ihr booten. Vergewissern Sie sich, dass Sie geeignete Varianten- und Abbildwerte für Ihre Cloud verwenden - siehe :doc:`get_started`, wenn Sie noch nicht dort waren.
id: Sekarang setelah Anda mempersiapkan infrastruktur jaringan, Anda bisa terus maju dan melakukan booting sebuah instance di dalamnya. Pastikan Anda menggunakan nilai flavor dan image yang sesuai untuk awan Anda - lihat :doc: `getting_started` jika Anda belum melakukannya.
tr_tr: Artık ağ altyapısını hazırladığınıza göre, devam edip üzerinde bir sunucu önyükleyebilirsiniz. Bulutunuz için uygun nitelik ve imaj değerlerini kullandığınızdan emin olun - hazır değilseniz bkz :doc:`getting_started`.

source: Now that you know how to create and delete instances, you can deploy the sample application. The instance that you create for the application is similar to the first instance that you created, but this time, we introduce a few extra concepts.
de: Nun, da Sie wissen, wie Sie Instanzen erstellen und löschen, können Sie die Beispielanwendung bereitstellen. Die Instanz, die Sie für die Anwendung erstellen, ähnelt der ersten Instanz, die Sie erstellt haben, aber dieses Mal stellen wir Ihnen einige zusätzliche Konzepte vor.
id: Sekarang setelah Anda tahu cara membuat dan menghapus instance, Anda dapat menerapkan contoh aplikasi tersebut. Instance yang Anda buat untuk aplikasi ini mirip dengan instance pertama yang Anda buat, tapi kali ini, kami memperkenalkan beberapa konsep tambahan.
tr_tr: Artık sunucuları nasıl oluşturup sileceğinizi bildiğinize göre, aynı uygulamayı kurabilirsiniz. Uygulama için oluşturduğunuz sunucu oluşturduğunuz ilk sunucuya benzerdir ama bu sefer bir kaç ek kavramı devreye sokacağız.

source: Now you can SSH into the instance:
de: Jetzt können Sie mit SSH in die Instanz:
id: Sekarang Anda bisa SSH ke instance:
tr_tr: Şimdi sunucuya SSH yapabilirsiniz:

source: Now, attach your router to the worker, API, and web server subnets.
de: Jetzt fügen Sie Ihren Router an die Worker-, API- und Web-Server-Subnetze an.
id: Sekarang, pasang router Anda ke subnet pekerja, API, dan web server.
tr_tr: Şimdi yönlendiricinizi işçi, API ve web sunucu alt ağlarına ekleyin.

source: Now, create a health monitor that will ensure that members of the load balancer pool are active and able to respond to requests. If a member in the pool dies or is unresponsive, the member is removed from the pool so that client requests are routed to another active member.
de: Erstellen Sie nun einen Gesundheitsmonitor, der sicherstellt, dass Mitglieder des Load Balancer Pools aktiv sind und auf Anfragen antworten können. Wenn ein Mitglied im Pool stirbt oder nicht reagiert, wird das Mitglied aus dem Pool entfernt, so dass Client-Anfragen an ein anderes aktives Mitglied weitergeleitet werden.
id: Sekarang, buatlah monitor kesehatan yang akan memastikan bahwa anggota load balancer pool aktif dan mampu merespons permintaan. Jika anggota di pool mati atau tidak responsif, anggota tersebut dikeluarkan dari pool sehingga permintaan klien diarahkan ke anggota aktif lainnya.
tr_tr: Şimdi yük dengeleme havuzu üyelerinin etkin ve isteklere cevap verebilir durumda olduklarından emin olmak için sağlık izleyici oluşturun. Havuzun bir üyesi ölürse veya cevap vermemeye başlarsa, üye havuzdan çıkarılarak istemci isteklerinin etkin üyelere yönlendirilmesi sağlanır.

source: Now, create a network and subnet for the web servers.
de: Erstellen Sie nun ein Netzwerk und ein Subnetz für die Webserver.
id: Sekarang, buat jaringan dan subnet untuk server web.
tr_tr: Şimdi, web sunucuları için bir ağ ve alt ağ oluşturun.

source: Now, look at the big picture.
de: Jetzt schauen Sie sich das große Bild an.
id: Sekarang, lihatlah gambaran besarnya.
tr_tr: Şimdi büyük resme bakın.

source: Now, no more objects are available in the :code:`fractals` container.
de: Jetzt sind keine Objekte mehr im :code: `fractals` container.
id: Sekarang, tidak ada lagi benda yang tersedia di container :code:`fractals``.
tr_tr: Artık :code:`fraktallar` kapsayıcısında kullanılabilir nesne yoktur.

source: Now, wait until all the fractals are generated and the instances have idled for some time.
de: Warten Sie jetzt, bis alle Fraktale erzeugt sind und die Instanzen für einige Zeit im Leerlauf sind.
id: Sekarang, tunggu sampai semua fractal dihasilkan dan instance telah hilang selama beberapa waktu.
tr_tr: Şimdi tüm fraktalların üretilmesini ve sunucuların bir süre boşta kalmasını bekleyin.

source: Now, you can boot and configure the instance.
de: Jetzt können Sie die Instanz booten und konfigurieren.
id: Sekarang, Anda bisa boot dan mengkonfigurasi instance.
tr_tr: Artık sunucuyu önyükleyip yapılandırabilirsiniz.

source: Now, you can launch the instance.
de: Jetzt können Sie die Instanz starten.
id: Sekarang, Anda bisa meluncurkan instance.
tr_tr: Şimdi sunucuyu başlatabilirsiniz.

source: Obtain the following information from your cloud provider:
de: Erhalten Sie die folgenden Informationen von Ihrem Cloud-Anbieter:
id: Dapatkan informasi berikut dari penyedia awan Anda:
tr_tr: Aşağıdaki bilgiyi bulut sağlayıcınızdan alın:

source: Of course there is also a web interface which offers a more human friendly way of accessing the API to view the created fractal images, and a simple command line interface.
de: Natürlich gibt es auch eine Web-Schnittstelle, die eine menschlichere Art und Weise des Zugriffs auf die API bietet, um die erzeugten Fraktalbilder und eine einfache Befehlszeilenschnittstelle anzuzeigen.
id: Tentu saja ada juga antarmuka web yang menawarkan cara yang lebih ramah untuk mengakses API untuk melihat image fraktal yang dibuat, dan antarmuka command line yang sederhana.
tr_tr: Tabi oluşturulan fraktal imajları görüntülemek için API'ye erişmek için daha insan canlısı bir web arayüzü de bulunur, bir de basit komut satırı arayüzü vardır.
