Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: In this network layout, we assume that the OpenStack cloud in which you have been building your application has a public network and tenant router that was previously created by your cloud provider or by yourself, following the instructions in the appendix.
de: In diesem Netzwerklayout gehen wir davon aus, dass die OpenStack-Cloud, in der Sie Ihre Applikation aufgebaut haben, einen öffentlichen Netzwerk- und Tenant-Router hat, der zuvor von Ihrem Cloud-Provider oder von Ihnen selbst erstellt wurde, und zwar nach den Anweisungen im Anhang.
id: Dalam tata letak jaringan ini, kami berasumsi bahwa awan OpenStack tempat Anda membangun aplikasi Anda memiliki jaringan publik dan tenant router (router penyewa) yang sebelumnya dibuat oleh penyedia awan Anda atau oleh Anda sendiri, mengikuti petunjuk di lampiran.
tr_tr: Bu ağ düzeninde, uygulamanızı içinde inşa ettiğiniz OpenStack bulutunun ekteki yönergeleri takip edecek şekilde bulut sağlayıcınız veya sizin tarafınızdan daha önceden oluşturulan bir açık ağı ve kiracı yönlendiricisi bulunduğunu varsayıyoruz.

source: In this template, the alarms use metadata that is attached to each worker instance. The metadata is in the :code:`metering.stack=stack_id` format.
de: In dieser Vorlage verwenden die Alarme Metadaten, die an jede Worker-Instanz angehängt sind. Die Metadaten befinden sich im :code:`metering.stack = stack_id` Format.
id: Dalam template ini, alarm menggunakan metadata yang dilampirkan pada setiap instance pekerja. Metadata ada di format :code:`metering.stack=stack_id`.
tr_tr: Bu şablonda, uyarılar her bir işçi sunucuya eklenmiş metaveriyi kullanır. Metaveri :code:`metering.stack=stack_id` biçimindedir.

source: In this tutorial, we have downloaded the latest version of our application from source and installed it on a standard image. Our magic installation script also updates the standard image to have the latest dependencies that you need to run the application.
de: In diesem Tutorial haben wir die neueste Version unserer Applikation aus der Quelle heruntergeladen und auf einem Standardabbild installiert. Unser magisches Installationsskript aktualisiert auch das Standardabbild, um die neuesten Abhängigkeiten zu haben, die Sie benötigen, um die Anwendung auszuführen.
id: Dalam tutorial ini, kami telah mendownload versi terbaru dari aplikasi kami dari sumber dan memasangnya pada image standar. Script instalasi magic kami juga memperbarui image standar untuk memiliki dependensi terbaru yang Anda butuhkan untuk menjalankan aplikasi.
tr_tr: Bu öğreticide uygulamamızın son sürümünü kaynaktan indirdik ve standart bir imaj üzerine yükledik. Sihirli kurulum betiğimiz ayrıca standart imajı uygulamanın çalışması için gerekli en son bağımlılıkları içerecek şekilde günceller.

source: In this tutorial, you interact with your OpenStack cloud through the SDK that you chose in "Choose your OpenStack SDK." This guide assumes that you know how to run code snippets in your language of choice.
de: In diesem Tutorial interagieren Sie mit Ihrer OpenStack Cloud durch das SDK, das Sie in 'Wählen Sie Ihr OpenStack SDK' gewählt haben. Diese Anleitung setzt voraus, dass Sie wissen, wie Sie Code-Snippets in Ihrer Sprache der Wahl ausführen können.
id: Dalam tutorial ini, Anda berinteraksi dengan awan OpenStack Anda melalui SDK yang Anda pilih di "Choose your OpenStack SDK." Panduan ini mengasumsikan bahwa Anda tahu cara menjalankan code snippet (cuplikan kode) dalam bahasa pilihan Anda.
tr_tr: Bu öğreticide, OpenStack bulutunuzla "OpenStack SDK'nızı seçin" kısmında seçtiğiniz SDK aracılığıyla etkileşirsiniz. Bu kılavuz seçtiğiniz dilde kod parçaları çalıştırmayı bildiğinizi varsayar.

source: In traditional data centers, network segments are dedicated to specific types of network traffic.
de: In den traditionellen Rechenzentren sind Netzwerksegmente bestimmten Arten von Netzwerkverkehr gewidmet.
id: Di pusat data tradisional, segmen jaringan didedikasikan untuk jenis lalu lintas jaringan tertentu.
tr_tr: Geleneksel veri merkezlerinde, ağ dilimleri belirli türde ağ trafiği için adanmıştır.

source: In your SSH session, confirm that no fractals were generated:
de: In Ihrer SSH-Sitzung bestätigen Sie, dass keine Fraktale erzeugt wurden:
id: Dalam sesi SSH Anda, konfirmasikan bahwa tidak ada fractal yang dihasilkan:
tr_tr: SSH oturumunuzda, fraktalların üretildiğini onaylayın:

source: Initially, the focus is on scaling the workers because they consume the most resources.
de: Zunächst liegt der Schwerpunkt auf der Skalierung der Worker, weil sie die meisten Ressourcen verbrauchen.
id: Awalnya, fokusnya adalah pada penskalaan workers karena mereka mengkonsumsi sumber daya paling banyak.
tr_tr: İlk olarak, en çok kaynağı tükettiklerinden ölçekleme odağı işçiler üzerinedir.

source: Install a service
de: Installiere eines Dienstes
id: Instal layanan
tr_tr: Bir servis kur

source: Install the 'heat' command-line client by following this guide: https://docs.openstack.org/cli-reference/common/cli_install_openstack_command_line_clients.html#install-the-clients
de: Installieren Sie den 'heat' Befehlszeilenclient, indem Sie diesem Handbuch folgen: https://docs.openstack.org/cli-reference/common/cli_install_openstack_command_line_clients.html#install-the-clients
id: Instal klien command-line 'heat' dengan mengikuti panduan ini: https://docs.openstack.org/cli-reference/common/cli_install_openstack_command_line_clients.html#install-the-clients
tr_tr: Şu kılavuzu kullanarak 'heat' komut satırı istemcisini kurun: https://docs.openstack.org/cli-reference/common/cli_install_openstack_command_line_clients.html#install-the-clients

source: Internet connectivity from your cloud instance is required to download the application.
de: Internet-Konnektivität von Ihrer Cloud-Instanz ist erforderlich, um die Anwendung herunterzuladen.
id: Konektivitas internet dari instance awan Anda diperlukan untuk mendownload aplikasi.
tr_tr: Uygulamayı indirmek için bulut sunucunuzdan internet bağlantısı gereklidir.

source: Introduction to Floating IPs
de: Einführung in Floating-IPs
id: Pengantar Floating IP (IP Mengambang)
tr_tr: Değişken IP'lere giriş

source: Introduction to cloud-init
de: Einführung in cloud-init
id: Perkenalan pada cloud-init
tr_tr: Cloud-init'e giriş

source: Introduction to key pairs
de: Einführung in Schlüsselpaare
id: Pengantar key pair (pasangan kunci)
tr_tr: Anahtar çiftlerine giriş

source: Introduction to security groups
de: Einführung in Sicherheitsgruppen
id: Pengantar kelompok keamanan
tr_tr: Güvenlik gruplarına giriş

source: Introduction to tenant networking
de: Einführung in die Tenant-Vernetzung
id: Pengantar jaringan tenant (penyewa)
tr_tr: Kiracı ağlara giriş

source: Introduction to the fractals application architecture
de: Einführung in die Architektur der Fraktale
id: Pengantar arsitektur aplikasi fraktal
tr_tr: Fraktallar uygulama mimarisine giriş

source: It is easy to split out services into multiple instances. We will create a controller instance called :code:`app-controller`, which hosts the API, database, and messaging services. We will also create a worker instance called :code:`app-worker-1`, which just generates fractals.
de: Es ist einfach, Dienste in mehrere Instanzen aufzuteilen. Wir erstellen eine Controller-Instanz namens :code:`app-controller`, die die API-, Datenbank- und Messaging-Dienste hostet. Wir werden auch eine Worker-Instanz namens :code:`app-worker-1` erstellen, die nur Fraktale erzeugt.
id: Mudah untuk membagi layanan menjadi beberapa instance. Kita akan membuat instance controller yang disebut :code:`app-controller`, yang menghosting layanan API, database, dan pesan. Kami juga akan membuat instance pekerja yang disebut :code:`app-worker-1`, yang hanya menghasilkan fraktal.
tr_tr: Servisleri birden çok sunucuya ayırmak kolaydır. API, veritabanı ve ileti servislerini sunan :code:`app-controller` isimli bir kontrol düğümü oluşturacağız. Ayrıca yalnızca fraktalları üreten bir :code:`app-worker-1` işçi sunucusu oluşturacağız.

source: It is not possible to restore deleted objects. Be careful.
de: Es ist nicht möglich, gelöschte Objekte wiederherzustellen. Achtung.
id: Tidak mungkin mengembalikan objek yang dihapus. Hati-hati.
tr_tr: Silinen nesneleri geri yükleme imkansızdır. Dikkatli olun.

source: Jclouds does not currently support OpenStack Orchestration. See this `bug report <https://issues.apache.org/jira/browse/JCLOUDS-693>`_.
de: Jclouds unterstützt derzeit keine OpenStack Orchestration. Siehe diesen Fehlerbericht <https://issues.apache.org/jira/browse/JCLOUDS-693> `_.
id: Jclouds saat ini tidak mendukung OpenStack Orchestration. Lihat ini `bug report <https://issues.apache.org/jira/browse/JCLOUDS-693>`_.
tr_tr: Jclouds henüz OpenStack Orkestrasyon'u desteklemiyor. Şu `hata raporuna <https://issues.apache.org/jira/browse/JCLOUDS-693>`_ göz atın.

source: Just as you back up information on a non-cloud server, you must back up non-reproducible information, such as information on a database server, file server, or in application log files. Just because something is 'in the cloud' does not mean that the underlying hardware or systems cannot fail.
de: So wie Sie Informationen über einen Nicht-Cloud-Server sichern, müssen Sie nicht reproduzierbare Informationen wie Informationen über einen Datenbankserver, einen Dateiserver oder in Anwendungsprotokolldateien sichern. Nur weil etwas in der Cloud ist, bedeutet das nicht, dass die zugrunde liegenden Hardware oder Systeme nicht ausfallen können.
id: Sama seperti Anda membuat cadangan informasi pada server non-cloud, Anda harus mencadangkan informasi yang tidak dapat direproduksi, seperti informasi tentang server database, file server, atau file log aplikasi. Hanya karena ada sesuatu 'in the cloud', itu tidak berarti bahwa perangkat keras atau sistem yang mendasarinya tidak dapat gagal.
tr_tr: Bulut dışı bir sunucuya bilgi yedeklerken, tekrar üretilemez bilgileri yedeklemelisiniz, örneğin veritabanı sunucusundaki bilgi, dosya sunucusu, veya uygulama kayıt dosyaları. Bir şeyin `bulutta` olması altta yatan donanım veya sistemin arızalanamayacağı anlamına gelmez.

source: Language
de: Sprache
id: Bahasa
tr_tr: Dil

source: Large file uploads that use the :code:`openstack-swift` provider are supported in only jclouds V2, currently in beta. Also, the default chunk size is 64 Mb. Consider changing this as homework.
de: Große Datei-Uploads, die den :code: `openstack-swift` Anbieter verwenden, werden nur in jclouds V2 unterstützt, derzeit in beta. Auch die Standard-Chunk-Größe beträgt 64 Mb. Betrachten Sie das Ändern als Hausaufgaben.
id: Upload file besar yang menggunakan :code:`openstack-swift` provider hanya didukung oleh jclouds V2, saat ini dalam versi beta. Juga, ukuran chunk default adalah 64 Mb. Pertimbangkan untuk mengubah ini sebagai pekerjaan rumah.
tr_tr: :code:`openstack-swift` sağlayıcısını kullanan büyük dosya yüklemeleri yalnızca şu an beta olan jclouds V2'de desteklenir. Ayrıca öntanımlı parça boyutu 64 Mb'dir. Bunu değiştirmek ev ödeviniz olsun.

source: Large objects
de: Große Objekte
id: Objek besar
tr_tr: Büyük nesneler

source: Later on, you will use a Block Storage volume to provide persistent storage for the database server for the Fractal application. But first, learn how to create and attach a Block Storage device.
de: Später verwenden Sie ein Blockspeicher-Volume, um einen permanenten Speicher für den Datenbankserver für die Fractal-Anwendung bereitzustellen. Aber zuerst lernen Sie, wie man ein Blockspeichergerät erstellt und anhängt.
id: Nantinya, Anda akan menggunakan volume Block Storage untuk menyediakan penyimpanan persisten ke server database untuk aplikasi Fractal. Tapi pertama, pelajari cara membuat dan mengikat perangkat Block Storage.
tr_tr: İlerde Fraktal uygulama için veritabanı sunucusu için kalıcı depolama sağlamak için Blok Deoplama birimi kullanacaksınız. Ama önce bir Blok Depolama aygıtı oluşturmayı ve eklemeyi öğrenin.

source: Launch an instance
de: Starten Sie eine Instanz
id: Luncurkan sebuah instance
tr_tr: Sunucu Başlat

source: Launch the stack with auto-scaling workers:
de: Starten Sie den Stack mit Auto-Skalierung Worker:
id: Luncurkan stack dengan pekerja auto-scaling:
tr_tr: Yığını otomatik ölçeklenen işçilerle başlatın:

source: Leave your shell open to use it for another instance deployment in this section.
de: Lassen Sie Ihre Shell offen, um sie für eine weitere Instanz-Installation in diesem Abschnitt zu verwenden.
id: Biarkan shell Anda terbuka untuk menggunakannya pengerahan instance lain di bagian ini.
tr_tr: Bu kısımda başka bir sunucu kurulumunda kullanmak için kabuğunuzu açık tutun.

source: Libcloud 0.16 and 0.17 are afflicted with a bug that means authentication to a swift endpoint can fail with `a Python exception <https://issues.apache.org/jira/browse/LIBCLOUD-635>`_. If you encounter this, you can upgrade your libcloud version, or apply a simple `2-line patch <https://github.com/fifieldt/libcloud/commit/ec58868c3344a9bfe7a0166fc31c0548ed22ea87>`_.
de: Libcloud 0,16 und 0,17 sind mit einem Fehler behaftet, der bedeutet, dass die Authentifizierung für einen swift Endpunkt mit einer Python-Ausnahme fehlschlägt <https://issues.apache.org/jira/browse/LIBCLOUD-635> `_. Wenn Sie dies begegnen, können Sie Ihre libcloud-Version aktualisieren oder einen einfachen '2-zeiligen Patch anwenden <https://github.com/fifieldt/libcloud/commit/ec58868c3344a9bfe7a0166fc31c0548ed22ea87> `_.
id: Libcloud 0,16 dan 0,17 menderita bug yang berarti otentikasi ke swift endpoin bisa gagal `a Python exception <https://issues.apache.org/jira/browse/LIBCLOUD-635>`_. Jika Anda menjumpai ini, Anda bisa mengupgrade versi libcloud Anda, atau aplikasikan yang sederhana `2-line patch <https://github.com/fifieldt/libcloud/commit/ec58868c3344a9bfe7a0166fc31c0548ed22ea87>`_.
tr_tr: Libcloud 0.16 ve 0.17 bir swift uç noktasına kimlik doğrulamanın bir `Python istisnasıyla <https://issues.apache.org/jira/browse/LIBCLOUD-635>`_ sonlandığı bir hataya sahiptir. Bununla karşılaşırsanız, libcloud sürümünüzü güncelleyin, veya basit `2 satırlık bir yamayı <https://github.com/fifieldt/libcloud/commit/ec58868c3344a9bfe7a0166fc31c0548ed22ea87>`_ uygulayın.

source: Libcloud does not support the OpenStack Networking API.
de: Libcloud unterstützt die OpenStack Networking API nicht.
id: Libcloud tidak mendukung OpenStack Networking API.
tr_tr: Libcloud OpenStack Ağ API'sini desteklemez.

source: Libcloud uses a different connector for Object Storage to all other OpenStack services, so a conn object from previous sections will not work here and we have to create a new one named :code:`swift`.
de: Libcloud verwendet einen unterschiedlichen Anschluss für Object Storage für alle anderen OpenStack-Dienste, so dass ein Conn-Objekt aus früheren Abschnitten hier nicht funktioniert und wir müssen einen neuen namens :code: `swift` erstellen.
id: Libcloud menggunakan konektor yang berbeda untuk Object Storage ke semua layanan OpenStack lainnya, jadi sebuah objek sambung dari bagian sebelumnya tidak akan bekerja di sini dan kita harus membuat yang baru bernama :code:`swift`.
tr_tr: Libcloud Nesne Depolama iin tüm OpenStack servislerine farklı bağlantı kullanır, yani önceki kısımlardan bir conn nesnesi burada çalışmayacaktır, :code:`swift` isimli yeni bir tane oluşturmalıyız.

source: Like many cloud applications, the Fractals application has a `RESTful API <http://en.wikipedia.org/wiki/Representational_state_transfer>`_. You can connect to it directly and generate fractals, or you can integrate it as a component of a larger application. Any time a standard interface such as an API is available, automated testing becomes much more feasible, increasing software quality.
de: Wie viele Cloud-Anwendungen hat die Fractals-Anwendung eine 'RESTful API' <http://en.wikipedia.org/wiki/Representational_state_transfer> `_. Sie können sich direkt mit ihr verbinden und Fraktale erzeugen, oder Sie können sie als Bestandteil einer größeren Anwendung integrieren. Jedes Mal, wenn eine Standardschnittstelle wie eine API verfügbar ist, wird automatisiertes Testen viel mehr machbar, wodurch die Softwarequalität erhöht wird.
id: Seperti banyak aplikasi cloud, aplikasi Fractals memiliki `RESTful API <http://en.wikipedia.org/wiki/Representational_state_transfer>`_. Anda dapat menghubungkannya secara langsung dan menghasilkan fraktal, atau Anda dapat mengintegrasikannya sebagai komponen aplikasi yang lebih besar. Setiap saat antarmuka standar seperti API tersedia, pengujian otomatis menjadi jauh lebih layak, meningkatkan kualitas perangkat lunak.
tr_tr: Birçok bulut uygulaması gibi, Fraktallar uygulaması da `RESTful API'ye <http://en.wikipedia.org/wiki/Representational_state_transfer>`_ sahiptir. Doğrudan bağlanıp fraktallar oluşturabilirsiniz veya daha büyük bir uygulamanın bileşeni olarak tümleştirebilirsiniz. API gibi standart bir arayüz kullanılabilir olduğunda, otomatik olarak deneme çok daha kolaylaşır, yazılım kalitesi artar.

source: List all available floating IPs for this project and select the first free one. Allocate a new floating IP if none is available.
de: Auflisten aller verfügbaren Floating-IPs für dieses Projekt und wählen Sie die erste freie. Weisen Sie eine neue Floating-IP zu, wenn keine verfügbar ist.
id: Buat daftar semua floating IP yang ada untuk proyek ini dan pilih yang pertama bebas. Alokasikan floating IP baru jika tidak ada yang tersedia.
tr_tr: Bu proje için kullanılabilir tüm değişken IP'leri listeleyin ve boş olan ilkini seçin. Kullanılabilir yoksa yeni bir değişken IP ayırın.

source: List objects in your :code:`fractals` container to see if the upload was successful. Then, download the file to verify that the md5sum is the same:
de: Auflisten von Objekten in Ihrem :code: `Fraktale` Container, um zu sehen, ob der Upload erfolgreich war. Dann laden Sie die Datei herunter, um zu überprüfen, ob das md5sum gleich ist:
id: Daftar objek di kontainer Anda :code:`fractals` untuk melihat apakah upload berhasil dilakukan. Kemudian, download file untuk memverifikasi bahwa md5sum adalah sama:
tr_tr: :code:`fraktallar` kapsayıcınızdaki nesneleri listeleyerek yüklemenin başarılı olduğunu onaylayın. Ardından md5sum değerinin aynı olduğundan emin olmak için dosyayı indirin:

source: Load balancing
de: Lastverteilung
id: Penyeimbang beban (load balancing)
tr_tr: Yük dengeleme

source: Load the API: Create a lot of API service requests
de: Laden Sie die API: Erstellen Sie viele API-Dienstanforderungen
id: Muat API: Buat banyak permintaan layanan API
tr_tr: API'ye yüklenin: Birçok API servis isteği oluşturun

source: Load the worker: Create a lot of tasks to max out the CPU of existing worker instances
de: Laden Sie den Worker: Erstellen Sie eine Menge von Aufgaben, um die CPU der vorhandenen Worker-Instanzen zu maximieren
id: Muatkan pekerja: Buat banyak tugas untuk memaksimalkan CPU dari instance pekerja yang ada
tr_tr: İşçiye yüklenin: Mevcut işçi sunucuların CPU kullanımını tavana taşımak için bir sürü görev oluşturun

source: Log in to the server to run the following steps.
de: Melden Sie sich beim Server an, um die folgenden Schritte auszuführen.
id: Log in ke server untuk menjalankan langkah-langkah berikut.
tr_tr: Aşağıdaki adımları çalıştırmak için sunucuya giriş yapın.

source: Login to the worker instance, :code:`app-worker-1`, with SSH, using the previous added SSH key pair "demokey". Start by getting the IP address of the worker:
de: Melden Sie sich mit SSH bei der Worker-Instanz an :code:`app-worker-1`, unter Verwendung des vorherigen SSH-Schlüsselpaars 'demokey'. Beginnen Sie mit der IP-Adresse des Workers:
id: Masuk ke instance pekerja, :code:`app-worker-1`, dengan SSH, gunakan pasangan kunci SSH yang sebelumnya ditambahkan"demokey ". Mulailah dengan mendapatkan alamat IP pekerja:
tr_tr: Daha önce eklenen "demokey" SSH anahtar çiftini kullanarak SSH ile :code:`app-worker-1` işçi sunucusuna giriş yapın. İşçinin IP adresini alarak başlayın:

source: Login with SSH and use the Fractal app
de: Melden Sie sich mit SSH an und nutzen Sie die Fractal App
id: Login dengan SSH dan gunakan aplikasi Fractal
tr_tr: SSH ile giriş yapın ve Fraktal uygulamasını kullanın

source: Look at which ports are available:
de: Schauen Sie, welche Ports verfügbar sind:
id: Lihatlah port mana yang tersedia:
tr_tr: Hangi bağlantı noktalarının kullanılabilir olduklarına bakın:

source: Make cloud-related architecture decisions such as turning functions into micro-services and modularizing them.
de: Machen Sie Cloud-bezogene Architekturentscheidungen wie das Drehen von Funktionen in Mikro-Services und modularisieren sie.
id: Buat keputusan arsitektur cloud-related seperti mengubah fraction menjadi layanan micro-service dan memodulasinya.
tr_tr: Fonksiyonları mikro servislere döndürme ve modüler hale getirme gibi bulutla ilgili mimari kararları alın.

source: Make it durable
de: Mach es haltbar
tr_tr: Dayanıklı hale getirin

source: Make it possible to add new resources to your application.
de: Machen Sie es möglich, neue Ressourcen zu Ihrer Anwendung hinzuzufügen.
id: Memungkinkan untuk menambahkan sumber daya baru ke aplikasi Anda.
tr_tr: Uygulamanıza yeni kaynaklar eklemeyi mümkün kılmalısınız.

source: Many of the network concepts that are discussed in this section are already present in the diagram above. A tenant router provides routing and external access for the worker nodes, and floating IP addresses are associated with each node in the Fractal application cluster to facilitate external access.
de: Viele der Netzwerkkonzepte, die in diesem Abschnitt besprochen werden, sind bereits im obigen Diagramm vorhanden. Ein Tenant Router bietet Routing und externen Zugriff für die Worker-Knoten, und Floating-IP-Adressen sind mit jedem Knoten im Fractal Application Cluster zugeordnet, um den externen Zugriff zu erleichtern.
id: Banyak konsep jaringan yang dibahas di bagian ini sudah ada pada diagram di atas. Router penyewa menyediakan routing dan akses eksternal untuk node pekerja, dan alamat IP mengambang (floating) dikaitkan dengan setiap node di cluster aplikasi Fractal untuk memudahkan akses eksternal.
tr_tr: Bu kısımda tartışılan birçok ağ kavramı yukarıdaki çizimde zaten mevcuttur. Bir kiracı yönlendiricisi işçi düğümler için yönlendirme ve harici erişim sağlar, ve değişken IP adresleri Fraktal uygulama kümesindeki her bir düğüm ile ilişkilendirilerek harici erişimi gerçekleştirir.

source: Maven will download and install any dependencies required for compilation, then execute the Java compiler. All files in the :code:`java` subdirectory will be compiled.
de: Maven wird alle für die Kompilierung benötigten Abhängigkeiten herunterladen und installieren und dann den Java-Compiler ausführen. Alle Dateien im :code: `java` subdirectory werden kompiliert.
id: Maven akan mendownload dan menginstal dependensi apapun yang diperlukan untuk kompilasi, kemudian jalankan compiler Java. Semua file di subdirektori :code:`java` akan dikompilasi.
tr_tr: Maven derleme için gerekli tüm bağımlılıkları indirir ve kurar, ardından Java derleyicisini çalıştırır. :code:`java` alt dizinindeki tüm dosyalar derleneceketir.

source: Maven will download and install any further dependencies required and then run the chosen class.
de: Maven wird heruntergeladen und installiert weitere erforderliche Abhängigkeiten und startet dann die gewählte Klasse.
id: Maven akan mendownload dan menginstal dependensi lebih lanjut yang diperlukan dan kemudian menjalankan kelas yang dipilih.
tr_tr: Maven gerekli diğer bağımlılıkları da indirir ve kurar ardından seçilen sınıfı çalıştırır.
