Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: Use your selected image and flavor to create an instance.
de: Verwenden Sie Ihr ausgewähltes Abbild und Ihre Variante, um eine Instanz zu erstellen.
id: Gunakan flavor dan image pilihan Anda untuk membuat sebuah instance.
tr_tr: Sunucu oluşturmak için seçtiğiniz imajı ve niteliği kullanın.

source: User data in openstacksdk must be encoded to Base64
de: Userdata in openstacksdk müssen zu Base64 codiert werden
id: Data pengguna di openstacksdk harus dikodekan ke Base64
tr_tr: Openstacksdk'daki kullanıcı verisi Base64 kodlanmalıdır

source: User data in openstacksdk must be encoded to Base64.
de: Benutzerdaten in openstacksdk müssen zu Base64 codiert werden.
id: Data pengguna di openstacksdk harus dikodekan ke Base64.
tr_tr: Openstacksdk'daki kullanıcı verisi Base64 kodlanmış olmalıdır.

source: Userdata. During instance creation, you can provide userdata to OpenStack to configure instances after they boot. The cloud-init service applies the user data to an instance. You must pre-install the cloud-init service on your chosen image. We will go into more detail in :doc:`/introduction`.
de: Userdata. Während der Instanzerstellung können Sie Userdata OpenStack zur Verfügung stellen, um Instanzen nach dem Booten zu konfigurieren. Der Cloud-init-Dienst wendet die Userdata auf eine Instanz an. Sie müssen den Cloud-Init-Service auf Ihrem gewählten Abbild vorinstallieren. Wir werden ausführlicher in :doc:`/introductiong`.
id: Userdata (dara pengguna). Selama pembuatan instance, Anda dapat menyediakan userdata ke OpenStack untuk mengonfigurasi instance setelah booting. Layanan cloud-init menerapkan data pengguna ke sebuah instance. Anda harus melakukan pra-instal layanan cloud-init pada image yang Anda pilih. Kami akan membahas lebih rinci :doc:`/introduction`.
tr_tr: Kullanıcıverisi. Sunucu oluşturma anında, OpenStack'in sunucular önyüklendikten sonra yapılandırabilmesi için kullanıcı verisi sağlayabilirsiniz. Cloud-init servisi kullanıcı verisini sunucuya uygular. Seçtiğiniz imaja cloud-init servisini önceden yüklemelisiniz. :doc:`/introduction` kısmında daha ayrıntıya gireceğiz.

source: Using Pacemaker to look at the API.
de: Mit Pacemaker auf die API schauen.
id: Menggunakan Pacemaker untuk melihat API.
tr_tr: API'ye bakmak için Pacemaker kullanmak.

source: Values
de: Werte
tr_tr: Değerler

source: Verify that the stack was successfully created:
de: Vergewissern Sie sich, dass der Stapel erfolgreich erstellt wurde:
id: Pastikan stack berhasil dibuat:
tr_tr: Yığının başarıyla oluşturulduğunu onaylayın:

source: Verify that we have had an impact
de: Vergewissern Sie sich, dass wir einen Einfluss hatten
id: Verifikasi bahwa kami memiliki dampak
tr_tr: Bir etkimiz olduğunu onaylayın

source: Verify the nova instance was deleted when the stack was removed:
de: Überprüfen Sie, ob die Nova-Instanz gelöscht wurde, als der Stapel entfernt wurde:
id: Verifikasi instance nova telah dihapus saat stack dihapus:
tr_tr: Yığın kaldırıldığında nova sunucusunun silindiğini onaylayın:

source: Wait for it to reach the :code:`CREATE_COMPLETE` status:
de: Warten Sie, bis Sie den Status :code:`CREATE_COMPLETE` erreicht haben:
id: Tunggu sampai mencapai status :code:`CREATE_COMPLETE`:
tr_tr: :code:`CREATE_COMPLETE` durumuna ulaşmasını bekleyin:

source: Watch :code:`top` on the worker instance. Right after calling :code:`faafo` the :code:`faafo-worker` process should start consuming a lot of CPU cycles.
de: Überwachen Sie :code:`top` auf der Worker-Instanz. Nach dem Aufruf :code:`faafo` sollte der Prozess :code:` faafo-worker` beginnen, eine Menge von CPU-Zyklen zu verbrauchen.
id: Perhatikan :code:`top` pada instance pekerja. Tepat setelah menelepon :code:`faafo`, proses :code:`faafo-worker` harus mulai menghabiskan banyak siklus CPU.
tr_tr: İşçi sunucuda :code:`top` çıktısını izleyin. :code.`faafo` çağrılır çağrılmaz :code:`faafo-worker` süreci epey CPU tüketiyor olmalı.

source: We are interested because the Telemetry service supports alarms: an alarm is fired when our average statistic breaches a configured threshold. When the alarm fires, an associated action is performed.
de: Wir sind interessiert, weil der Telemetrie-Service Alarme unterstützt: Ein Alarm wird ausgelöst, wenn unsere durchschnittliche Statistik einen konfigurierten Schwellenwert verletzt. Wenn der Alarm ausgelöst wird, wird eine entsprechende Aktion durchgeführt.
id: Kami tertarik karena layanan Telemetry mendukung alarm: alarm nyala saat statistik rata-rata kami melanggar ambang batas yang dikonfigurasi. Saat alarm menyala, tindakan yang terkait dilakukan.
tr_tr: İlgileniyoruz çünkü Telemetri servisi uyarıları destekliyor: bir uyarı ortalama istatistiğimiz yapılandırılan bir eşiği geçtiğinde tetiklenir. Uyarı tetiklendiğinde ilişkili bir eylem gerçekleştirilir.

source: We assume that you can already access an OpenStack cloud. You must have a project, also known as a tenant, with a minimum quota of six instances. Because the Fractals application runs in Ubuntu, Debian, Fedora-based, and openSUSE-based distributions, you must create instances that use one of these operating systems.
de: Wir gehen davon aus, dass Sie bereits auf eine OpenStack Cloud zugreifen können. Sie müssen ein Projekt haben, auch bekannt als Tenant, mit einem Mindestkontingent von sechs Instanzen. Da die Fractals-Anwendung in Ubuntu-, Debian-, Fedora-basierten und openSUSE-basierten Distributionen ausgeführt wird, müssen Sie Instanzen erstellen, die eines dieser Betriebssysteme verwenden.
id: Kami berasumsi bahwa Anda sudah dapat mengakses awan OpenStack. Anda harus memiliki sebuah proyek, juga dikenal sebagai tenant (penyewa), dengan kuota minimal enam instance. Karena aplikasi Fractals berjalan di distribusi berbasis Ubuntu, Debian, Fedora, dan openSUSE, Anda harus membuat instance yang menggunakan salah satu dari sistem operasi ini.
tr_tr: Zaten bir OpenStack bulutuna erişiminiz olduğunu varsayıyoruz. En az altı sunucu kotasına sahip, kiracı olarak da bilinen, bir projeye sahip olmalısınız. Fraktallar uygulaması Ubuntu, Debian, Fedora-tabanlı, ve openSUSE tabanlı dağıtımlarda çalıştığından, bu işletim sistemlerinden birini kullanan sunucular oluşturmalısınız.

source: We cover networking in detail in :doc:`/networking`.
de: Wir decken die Vernetzung im Detail ab in :doc:`/networking`.
id: Kami meliput networking secara rinci di :doc:`/networking`.
tr_tr: :doc:`/networking` kısmında ağın ayrıntılarını kapsıyoruz.

source: We explained image and flavor in :doc:`getting_started`, so in the following sections, we will explain the other parameters in detail, including :code:`ex_userdata` (cloud-init) and :code:`ex_keyname` (key pairs).
de: Wir erklärten das Abbild und die Variante in :doc:`get_started`, also in den folgenden Abschnitten werden wir die anderen Parameter im Detail erklären, darunter :code:`ex_userdata` (cloud-init) und :code:`ex_keyname` (Schlüsselpaare ).
id: Kami menjelaskan image and flavor di :doc: `getting_started`, jadi pada bagian berikut, kami akan menjelaskan parameter lainnya secara rinci, termasuk :code:`ex_userdata` (cloud-init) dan :code:`ex_keyname` (key pairs).
tr_tr: İmaj ve niteliği :doc:`getting_started` kısmında açıkladık, ilerleyen kısımlarda, :code:`ex_userdata` (cloud-init) ve :code:`ex_keyname` (anahtar çiftleri) dahil diğer parametreleri daha ayrıntılı olarak açıklayacağız.

source: We have created a Maven POM file to help you get started.
de: Wir haben eine Maven POM Datei erstellt, um Ihnen den Einstieg zu erleichtern.
id: Kami telah membuat file POM Maven untuk membantu Anda memulai.
tr_tr: Başlamanıza yardımcı olmak için Maven POM dosyası hazırladık.

source: We have not quite figured out how to stop using a database, but the general steps are:
de: Wir haben nicht ganz herausgefunden, wie man aufhört, eine Datenbank zu benutzen, aber die allgemeinen Schritte sind:
id: Kami belum tahu bagaimana cara menghentikan penggunaan database, tapi langkah umumnya adalah:
tr_tr: Bir veritabanı kullanmayı nasıl bırakacağımızı tam olarak belirleyemedik, ama genel adımlar şunlar:

source: We have talked about separating functions into different micro-services, and how that enables us to make use of the cloud architecture. Now let us see that in action.
de: Wir haben über die Trennung von Funktionen in verschiedene Mikro-Dienste gesprochen und wie das uns ermöglicht, die Cloud-Architektur zu nutzen. Nun lassen Sie uns das in Aktion sehen.
id: Kami telah berbicara tentang memisahkan fungsi menjadi layanan mikro yang berbeda, dan bagaimana hal itu memungkinkan kami memanfaatkan arsitektur awan. Sekarang mari kita lihat itu beraksi.
tr_tr: Fonksiyonları farklı mikro servislere ayırmayı, ve bunun bizi bulut mimarisini kullanmakta nasıl etkin yaptığını konuştuk. Şimdi bunu eyleme dökelim.

source: What you need
de: Was Sie brauchen
id: Apa yang kau butuhkan
tr_tr: İhtiyacınız olan

source: What you will learn
de: Was Sie lernen werden
id: Apa yang akan kamu pelajari
tr_tr: Öğrenecekleriniz

source: When an SSH public key is provided during instance creation, cloud-init installs this key on a user account. (The user name varies between cloud images.) See the `Obtaining Images <https://docs.openstack.org/image-guide/obtain-images.html>`_ section of the image guide for guidance about which user name you should use when SSHing. If you still have problems logging in, ask your cloud provider to confirm the user name.
de: Wenn während der Instanzerstellung ein SSH-Public-Key zur Verfügung gestellt wird, installiert cloud-init diesen Schlüssel auf einem Benutzerkonto. (Der Benutzername variiert zwischen Cloud-Abbildern.) Siehe 'Erhalten von Abbildern <https://docs.openstack.org/image-guide/obtain-images.html> `_ Abschnitt der Abbildanleitung zur Anleitung, welche Benutzernamen Sie verwenden sollten, wenn SSHen. Wenn Sie noch Probleme beim Anmelden haben, fragen Sie Ihren Cloud-Anbieter, um den Benutzernamen zu bestätigen.
id: Bila kunci publik SSH diberikan selama pembuatan instance, awan init memasang kunci ini di akun pengguna. (Nama pengguna bervariasi di antara image awan.) Lihat `Obtaining Images <https://docs.openstack.org/image-guide/obtain-images.html>`_ bagian dari panduan image untuk pedoman tentang nama pengguna yang harus Anda gunakan saat SSHing. Jika Anda masih mengalami masalah saat log in, mintalah provider awan untuk mengkonfirmasi nama pengguna.
tr_tr: Sunucu oluşturma sırasında bir SSH açık anahtarı sağlandığında, cloud-init bu anahtarı kullanıcı hesabına yükler. (Kullanıcı adı bulut imajlarına göre değişiklik gösterir.) SSH çekerken hangi kullanıcı adını kullanacağınızla ilgili yön gösterme için imaj kılavuzundaki `İmajları almak <https://docs.openstack.org/image-guide/obtain-images.html>`_ kısmına göz atın. Yine de girişte sorun yaşıyorsanız, bulut sağlayıcınıza kullanıcı adınızı kontrol ettirin.

source: When the instance boots, the `ex_userdata` variable value instructs the instance to deploy the Fractals application.
de: Wenn die Instanz startet, weist die Variable 'ex_userdata' die Instanz an, die Fractals-Anwendung bereitzustellen.
id: Ketika instance boot, nilai variabel `ex_userdata` menginstruksikan instance untuk menerapkan aplikasi Fractals.
tr_tr: Sunucu önyüklendiğinde, `ex_userdata` değişken değeri sunucuya Fraktal uygulamasını kurmasını söyler.

source: When you create an instance for the application, you want to give it a bit more information than you supplied to the bare instance that you just created and deleted. We will go into more detail in later sections, but for now, simply create the following resources so that you can feed them to the instance:
de: Wenn Sie eine Instanz für die Anwendung erstellen, möchten Sie es ein bisschen mehr Informationen geben als Sie an die bloße Instanz geliefert haben, die Sie gerade erstellt und gelöscht haben. Wir werden in späteren Abschnitten näher eingehen, aber jetzt schaffen wir einfach die folgenden Ressourcen, damit Sie sie der Instanz zuführen können:
id: Saat Anda membuat sebuah instance untuk aplikasi ini, Anda ingin memberikan sedikit informasi lebih banyak daripada yang Anda berikan pada instance kosong yang baru saja Anda buat dan hapus. Kami akan membahas lebih terperinci di bagian selanjutnya, tapi untuk saat ini, cukup buat sumber daya berikut sehingga Anda bisa memberi mereka instance:
tr_tr: Uygulama için bir sunucu oluşturduğunuzda, az önce oluşturduğunuz ve sildiğiniz boş sunucudan biraz daha fazla bilgi vermek istersiniz. İlerleyen kısımlarda daha fazla ayrıntıya gireceğiz, ama şimdilik sunucuyu beslemek için sadece basitçe aşağıdaki kaynakları oluşturun:

source: When you deal with pets, you name and care for them. If they get sick, you nurse them back to health, which can be difficult and very time consuming. When you deal with cattle, you attach a numbered tag to their ear. If they get sick, you put them down and move on.
de: Wenn Sie mit Haustieren umgehen, benennen und pflegen Sie sie. Wenn sie krank werden, pflegt man sie wieder gesund, was schwierig und sehr zeitraubend sein kann. Wenn Sie mit Vieh umgehen, fügen Sie ein nummeriertes Etikett ans Ohr. Wenn sie krank werden, machen Sie sie weg und ziehen weiter.
id: Bila Anda berurusan dengan hewan peliharaan, Anda menamai dan merawat mereka. Jika mereka sakit, Anda merawat mereka kembali ke kesehatan, yang bisa menyulitkan dan sangat menyita waktu. Saat Anda berurusan dengan ternak, Anda memasang label bernomor di telinga mereka. Jika mereka sakit, Anda menurunkannya dan melanjutkan perjalanan.
tr_tr: Evcil hayvanlarla ilgilendiğinizde, onları isimlendirir ve iyi bakarsınız. Hastalanırlarsa, iyileşene kadar bakıcılık yaparsınız ki bu oldukça zor ve zaman alıcı bir iş olabilir. Sığırlarla uğraşırken kulaklarına bir numara etiketi takarsınız. Hastalanırlarsa bir kenara ayırır hayatınıza devam edersiniz.

source: While this stack starts a single instance that builds and runs the Fractal application as an all-in-one installation, you can make very complicated templates that impact dozens of instances or that add and remove instances on demand. Continue to the next section to learn more.
de: Während dieser Stapel eine einzelne Instanz startet, die die Fractal-Anwendung als All-in-One-Installation aufbaut und ausführt, können Sie sehr komplizierte Vorlagen erstellen, die Dutzende von Instanzen beeinflussen oder Instanzen auf Anfrage hinzufügen und entfernen. Fahren Sie mit dem nächsten Abschnitt fort, um mehr zu erfahren.
id: Sementara stack ini memulai satu instance yang membangun dan menjalankan aplikasi Fractal sebagai instalasi all-in-one, Anda dapat membuat template yang sangat rumit yang mempengaruhi lusinan instance atau menambahkan dan menghapus instance sesuai permintaan. Lanjutkan ke bagian selanjutnya untuk mempelajari lebih lanjut.
tr_tr: Bu yığın tek bir sunucu başlatsa ve Fraktal uygulamasını hepsi bir arada bir kurulum olarak çalıştırsa da, düzinelerce sunucuyu etkileyen veya isteğe göre sunucu ekleyip çıkaran daha karmaşık şablonlar yapabilirsiniz. Daha fazlasını öğrenmek için sonraki kısma devam edin.

source: Who should read this guide
de: Wer sollte diesen Leitfaden lesen
id: Siapa yang harus membaca panduan ini?
tr_tr: Bu kılavuzu okuması gerekenler

source: With multiple workers producing fractals as fast as they can, the system must be able to receive the requests for fractals as quickly as possible. If our application becomes popular, many thousands of users might connect to our API to generate fractals.
de: Mit mehreren Workern, die Fraktale erzegen so schnell wie sie können, muss das System in der Lage sein, die Anfragen für Fraktale so schnell wie möglich zu erhalten. Wenn unsere Anwendung populär wird, können viele Tausende von Benutzern eine Verbindung zu unserer API herstellen, um Fraktale zu erzeugen.
id: Dengan beberapa pekerja yang memproduksi fraktal secepat mungkin, sistem harus dapat menerima permintaan fraktal secepat mungkin. Jika aplikasi kita menjadi populer, ribuan pengguna mungkin terhubung ke API untuk menghasilkan fraktal.
tr_tr: Ellerinde geldiğince fraktal üreten birden çok işçiyle, sistem fraktallar için istekleri olabildiğince çabuk alabiliyor olmalıdır. Uygulamamız popülerleşirse, binlerce kullanıcı fraktal üretmek için API'mize bağlanabilir.

source: With the OpenStack Networking API, the workflow for creating a network topology that separates the public-facing Fractals app API from the worker back end is as follows:
de: Mit der OpenStack Networking API ist der Workflow zur Erstellung einer Netzwerktopologie, die die öffentlich zugängliche Fractals App API vom Worker Back End trennt, wie folgt:
id: Dengan OpenStack Networking API, workflow (jalur kerja) untuk membuat topologi jaringan yang memisahkan API aplikasi Fractals yang dihadapi publik (public-facing) dari worker back end adalah sebagai berikut:
tr_tr: OpenStack Ağ API'si ile, dışarıya dönük Fraktal uygulama API'sini işçi arka uçtan ayıran bir ağ topolojisi oluşturmak için olan iş akışı şu şekildedir:

source: With the Orchestration API, the Fractal application can create an auto-scaling group for all parts of the application, to dynamically provision more compute resources during periods of heavy utilization, and also terminate compute instances to scale down, as demand decreases.
de: Mit der Orchestrierungs-API kann die Fractal-Anwendung eine Auto-Skalierungsgruppe für alle Teile der Anwendung erstellen, um dynamisch mehr Rechenressourcen in Zeiten schwerer Auslastung bereitzustellen und auch Compute-Instanzen zu verkleinern, wenn die Nachfrage sinkt.
id: Dengan Orchestration API, aplikasi Fractal dapat membuat grup skala otomatis untuk semua bagian aplikasi, untuk secara dinamis menyediakan sumber daya yang lebih banyak selama periode penggunaan yang berat, dan juga menghentikan komputasi instance untuk diturunkan, karena permintaan menurun.
tr_tr: Orkestrasyon API'si ile, Fraktal uygulaması yük yoğunluğunun olduğu aralıklarda dinamik olarak daha fazla hesaplama kaynağı hazırlamak için uygulamanın tüm kısımları için otomatik ölçekleme grubu oluşturabilir, ve yük azaldıkça ölçeği küçültmek için hesaplama sunucularını sonlandırabilir.

source: With the addition of the load balancer, the Fractal app's networking topology now reflects the modular nature of the application itself.
de: Mit der Ergänzung des Load Balancers spiegelt die Netzwerktopologie der Fractal App die modulare Art der Applikation selbst wider.
id: Dengan penambahan penyeimbang beban, topologi jaringan aplikasi Fractal sekarang mencerminkan sifat modular dari aplikasi itu sendiri.
tr_tr: Yük dengeleyicinin eklenmesiyle Fraktal uygulamasının ağ topolojisi artık uygulamanın modüler doğasını yansıtır durumda.

source: Work with stacks: Advanced
de: Arbeit mit Stapeln: Fortgeschrittene
id: Bekerja dengan stacks: Tingkat lanjut
tr_tr: Yığınlarla çalışın: Gelişmiş

source: Work with stacks: Basics
de: Arbeit mit Stapeln: Grundlagen
id: Bekerja dengan stacks: Basics
tr_tr: Yığınlarla çalışın: Temeller

source: Work with the CLI
de: Arbeit mit der CLI
id: Bekerja dengan CLI
tr_tr: CLI ile çalışmak

source: Work with the OpenStack Database service
de: Arbeiten Sie mit dem OpenStack Datenbankdienst
id: Bekerja dengan layanan OpenStack Database
tr_tr: OpenStack Veritabanı servisi ile çalışın

source: Wow! If you have made it through this section, you know more than the authors of this guide know about working with OpenStack clouds.
de: Beeindruckend! Wenn Sie es durch diesen Abschnitt geschaff haben, wissen Sie mehr als die Autoren dieses Leitfadens über die Arbeit mit OpenStack-Clouds wissen.
id: Wow! Jika Anda berhasil melewati bagian ini, Anda tahu lebih banyak daripada yang penulis panduan ini ketahui tentang bekerja dengan awan OpenStack.
tr_tr: Wow! Bu kısmı geçtiyseniz, OpenStack bulutlarıyla çalışmakla ilgili bu kılavuzun yazarlarından daha çok şey biliyorsunuz.

source: Writing your first OpenStack application
de: Schreiben Sie Ihre erste OpenStack Anwendung
id: Menulis aplikasi OpenStack pertama Anda
tr_tr: İlk OpenStack uygulamanızı yazmak

source: You also need a security group to permit access to the database server (for MySQL, port 3306) from the network:
de: Sie benötigen auch eine Sicherheitsgruppe, um den Zugriff auf den Datenbankserver (für MySQL, Port 3306) aus dem Netzwerk zu ermöglichen:
id: Anda juga memerlukan grup keamanan untuk mengizinkan akses ke server database (untuk MySQL, port 3306) dari jaringan:
tr_tr: Ağdan veritabanı sunucusuna erişim izni için (MySQL için, bağlantı noktası 3306) bir de güvenlik grubuna ihtiyacınız var:

source: You are ready to create members for the load balancer pool, which reference the floating IPs:
de: Sie sind bereit, Mitglieder für den Load Balancer Pool zu erstellen, die auf die Floating-IPs verweisen:
id: Anda siap untuk membuat anggota untuk load balancer pool, yang merujuk pada floating IP:
tr_tr: Değişken IP'leri gösteren, yük dengeleme bağlantı noktası için üyeler oluşturmak için hazırsınız:

source: You can aggregate samples and calculate statistics across all instances with the `metering.some_name` metadata that has `some_value` by using a query of the form:
de: Sie können Samples zusammenfassen und Statistiken über alle Instanzen mit den Metadaten 'metering.some_name' berechnen, die `some_value` haben, indem Sie eine Abfrage des Formulars verwenden:
id: Anda dapat menggabungkan sampel dan menghitung statistik di semua instance dengan metadata `metering.some_name` yang memiliki `some_value` dengan menggunakan kueri formulir:
tr_tr: Örnekleri toplayabilir ve tüm sunucular arasındaki istatistikleri şu şekilde bir sorgu kullanarak `some_value` değerine sahip `metering.some_name` metaverisi ile hesaplayabilirsiniz:

source: You can also download the OpenStack RC file from the OpenStack Horizon dashboard. Log in to the dashboard and click :guilabel:`Project->Access & Security->API Access->Download OpenStack RC file`. If you use this method, be aware that the "auth URL" does not include the path. For example, if your :file:`openrc.sh` file shows:
de: Sie können die OpenStack RC-Datei auch aus dem OpenStack Horizon Dashboard herunterladen. Melden Sie sich im Dashboard an und klicken Sie auf :guilabel: `Project-> Access & Security-> API Access-> Download OpenStack RC Datei`. Wenn Sie diese Methode verwenden, beachten Sie, dass die 'auth URL' den Pfad nicht enthält. Zum Beispiel, wenn Ihre: Datei: `openrc.sh` Datei zeigt:
id: Anda juga bisa mendownload file RC OpenStack dari dashboard Horizon OpenStack. Masuk ke dasbor dan klik :guilabel:`Project->Access & Security->API Access->Download OpenStack RC file`. Jika Anda menggunakan metode ini, perhatikan bahwa "URL auth" tidak termasuk jalurnya. Misalnya, jika file :file:`openrc.sh` Anda menunjukkan:
tr_tr: Ayrıca OpenStack RC dosyasını OpenStack Horizon kontrol panosundan indirebilirsiniz. Kontrol panosuna giriş yapın ve :guilabel:`Proje->Erişim & Güvenlik->API Erişimi->OpenStack RC dosyasını indire` tıklayın. Bu yöntemi kullanırsanız "yetkilendirme URL"'sinin yolda bulunmadığını unutmayın. Örneğin :file:`openrc.sh` dosyanız şöyle gösteriyorsa:

source: You can also get information about available flavors:
de: Sie können auch Informationen über verfügbare Varianten erhalten:
id: Anda juga bisa mendapatkan informasi tentang flavor yang tersedia:
tr_tr: Ayrıca kullanılabilir niteliklerle ilgili bilgi alabilirsiniz:
