Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: For information about supported features and how to work with an existing database service installation, see `Database as a Service in OpenStack <http://www.slideshare.net/hastexo/hands-on-trove-database-as-a-service-in-openstack-33588994>`_.
de: Informationen über unterstützte Funktionen und die Arbeit mit einer vorhandenen Datenbankdienstinstallation finden Sie unter `Datenbank als Dienst in OpenStack <http://www.slideshare.net/hastexo/hands-on-trove-database-as-a-service-in-openstack-33588994> `_.
id: Untuk informasi tentang fitur yang didukung dan cara bekerja dengan instalasi layanan database yang ada, lihat `Database as a Service in OpenStack <http://www.slideshare.net/hastexo/hands-on-trove-database-as-a-service-in-openstack-33588994>`_.
tr_tr: Desteklenen özellikler ve mevcut bir veritabanı servisi kurulumuyla nasıl çalışacağınız hakkında bilgi için, `OpenStack'de Servis olarak Veritabanı <http://www.slideshare.net/hastexo/hands-on-trove-database-as-a-service-in-openstack-33588994>`_ kısmına bakınız.

source: For information about these and other calls, see `libcloud documentation <http://ci.apache.org/projects/libcloud/docs/compute/drivers/openstack.html>`_.
de: Informationen zu diesen und anderen Anrufen finden Sie unter `libcloud Dokumentation <http://ci.apache.org/projects/libcloud/docs/compute/drivers/openstack.html> `_.
id: Untuk informasi tentang panggilan ini dan panggilan lainnya, lihat `libcloud documentation <http://ci.apache.org/projects/libcloud/docs/compute/drivers/openstack.html>`_.
tr_tr: Bu ve diğer çağrılar hakkında bilgi için, `libcloud belgelendirmesine <http://ci.apache.org/projects/libcloud/docs/compute/drivers/openstack.html>`_ göz atın.

source: For more information about hybrid clouds, see the `Hybrid Cloud chapter <https://docs.openstack.org/arch-design/hybrid.html>`_ in the Architecture Design Guide.
de: Weitere Informationen über Hybrid Clouds finden Sie im Kapitel 'Hybrid Cloud' <https://docs.openstack.org/arch-design/hybrid.html> `_ im Architektur Design Guide.
id: Untuk informasi lebih lanjut tentang awan hibrid, lihat `Hybrid Cloud chapter <https://docs.openstack.org/arch-design/hybrid.html>`_ di Architecture Design Guide.
tr_tr: Melez bulutlarla ilgili daha fazla bilgi için, Mimari Tasarım Kılavuzundaki `Melez Bulut bölümüne <https://docs.openstack.org/arch-design/hybrid.html>`_ göz atın.

source: For more information about multi-site clouds, see the `Multi-Site chapter <https://docs.openstack.org/arch-design/multi-site.html>`_ in the Architecture Design Guide.
de: Weitere Informationen zu Multi-Site-Clouds finden Sie im Kapitel 'Multi-Site' <https://docs.openstack.org/arch-design/multi-site.html> `_ im Architektur Design Guide.
id: Untuk informasi lebih lanjut tentang awan multi-site, lihat `Multi-Site chapter <https://docs.openstack.org/arch-design/multi-site.html>`_ di Architecture Design Guide.
tr_tr: Çoklu konum bulutlarıyla ilgili daha fazla bilgi için, Mimari Tasarım Kılavuzundaki `Çoklu Konum bölümüne <https://docs.openstack.org/arch-design/multi-site.html>`_ göz atın.

source: For performance reasons, it makes sense to have a network for each tier, so that traffic from one tier does not "crowd out" other types of traffic and cause the application to fail. In addition, having separate networks makes controlling access to parts of the application easier to manage, improving the overall security of the application.
de: Aus Performance-Gründen ist es sinnvoll, ein Netzwerk für jede Stufe zu haben, so dass der Verkehr von einer Stufe nicht 'andere Arten von Verkehr' ausläuft und die Anwendung fehlschlägt. Darüber hinaus, mit separaten Netzwerken ermöglicht die Kontrolle Zugriff auf Teile der Anwendung einfacher zu verwalten, die Verbesserung der Gesamtsicherheit der Anwendung.
id: Untuk alasan kinerja, masuk akal untuk memiliki jaringan untuk setiap tingkat, sehingga lalu lintas dari satu tingkat tidak "mengacaukan" jenis lalu lintas lainnya dan menyebabkan aplikasi gagal. Selain itu, memiliki jaringan yang terpisah membuat akses pengendali ke bagian aplikasi lebih mudah dikelola, meningkatkan keamanan keseluruhan aplikasi.
tr_tr: Başarım sebepleriyle, her aşama için bir ağa sahip olmak mantıklıdır, böylecek bir aşamadaki trafik diğer türde trafiklerde "kalabalık" yaparak uygulamanın başarısız olmasına sebep olmaz. Ek olarak farklı ağlara sahip olmak uygulamanın parçalarına erişimi kontrol etmeyi yönetmesi kolay hale getirir, uygulamanın genel güvenliğini artırır.

source: For this example, we take a floating IP pool from the 'public' network, which is your external network.
de: Für dieses Beispiel nehmen wir einen Floating-IP-Pool aus dem 'öffentlichen' Netzwerk, das ist Ihr externes Netzwerk.
id: Untuk contoh ini, kita mengambil kolam floating IP dari jaringan 'public', yang merupakan jaringan eksternal Anda.
tr_tr: Bu örnek için, harici ağınız olan 'public' ağından bir değişken IP havuzu alıyoruz.

source: Fractals application architecture
de: Fraktale Anwendungsarchitektur
id: Arsitektur aplikasi fraktal
tr_tr: Fraktallar uygulama mimarisi

source: From here, go to :doc:`/scaling_out` to learn how to further scale your application. Or, try one of these steps in the tutorial:
de: Von hier aus gehen Sie zu :doc:`/scaling_out`, um zu erfahren, wie Sie Ihre Anwendung weiter skalieren können. Oder versuchen Sie einen dieser Schritte im Tutorial:
id: Dari sini, buka :doc:`/scaling_out` untuk mempelajari cara meningkatkan skala aplikasi Anda. Atau, cobalah salah satu langkah berikut dalam tutorialnya:
tr_tr: Burdan :doc:`/scaling_out` kısmına giderek uygulamanızı nasıl ölçekleyeceğinizi öğrenin. Veya öğreticideki şu adımlardan birini deneyin:

source: Generate load
de: Last erzeugen
id: Membangkitkan muatan
tr_tr: Yük üretin

source: Get more information about the stack:
de: Erfahren Sie mehr über den Stack:
id: Dapatkan informasi lebih lanjut tentang stack:
tr_tr: Yığınla ilgili daha fazla bilgi al:

source: Getting started
de: Anfangen
id: Mulai
tr_tr: Başlangıç

source: Go ahead and create two instances.
de: Machen Sie weiter und erstellen Sie zwei Instanzen.
id: Silakan membuat dua instance.
tr_tr: Devam edin ve iki sunucu oluşturun.

source: Go ahead and delete the existing instances and security groups that you created in previous sections. Remember, when instances in the cloud are no longer working, remove them and re-create something new.
de: Gehen Sie vor und löschen Sie die vorhandenen Instanzen und Sicherheitsgruppen, die Sie in früheren Abschnitten erstellt haben. Denken Sie daran, wenn Instanzen in der Cloud nicht mehr arbeiten, entfernen Sie sie und erstellen Sie etwas neu.
id: Lanjutkan dan hapus instance dan kelompok keamanan yang ada yang Anda buat di bagian sebelumnya. Ingat, saat kejadian di awan tidak lagi berfungsi, lepaskan mereka dan ciptakan kembali sesuatu yang baru.
tr_tr: Önceki kısımlarda oluşturduğunuz mevcut sunucuları ve güvenlik gruplarını silin. Unutmayın, buluttaki sunucular çalışmayı bıraktıklarında onları kaldırmalı ve yeni bir şeyi tekrar oluşturmalısınız.

source: Go ahead and test the fault tolerance. Start deleting workers and API instances. As long as you have one of each, your application is fine. However, be aware of one weak point. The database contains the fractals and fractal metadata. If you lose that instance, the application stops. Future sections will explain how to address this weak point.
de: Machen Sie weiter und testen Sie die Fehlertoleranz. Starten Sie das Löschen von Workern und API-Instanzen. Solange Sie eines von beiden haben, ist Ihre Anwendung in Ordnung. Achten Sie jedoch auf einen Schwachpunkt. Die Datenbank enthält die Fraktale und Fraktal-Metadaten. Wenn Sie diese Instanz verlieren, ist die Anwendung beendet. Zukünftige Abschnitte werden erklären, wie man diesen Schwachpunkt ansprechen kann.
id: Silakan menguji toleransi kesalahan. Mulai menghapus pekerja dan instance API. Selama Anda memilikinya, aplikasi Anda baik-baik saja. Namun, perhatikan satu titik lemah. Database berisi fraktal dan metadata fraktal. Jika Anda kehilangan instance itu, aplikasi akan berhenti. Bagian selanjutnya akan menjelaskan bagaimana mengatasi titik lemah ini.
tr_tr: Şimdi devam edip hata dayanıklılığını deneyin. İşçileri ve API sunucularını silmeye başlayın. İkisinden de birer tane olduğu sürece, uygulamanız çalışır. Ancak bir zayıf noktayı unutmayın. Veritabanı fraktalları ve fraktal metaverisini içerir. Bu sunucuyu kaybederseniz, uygulama durur. İleri kısımlar bu zayıf noktayı nasıl ele alabileceğinizi açıklar.

source: Go to :doc:`/durability` to learn how to use Object Storage to solve this problem in an elegant way. Or, you can proceed to one of these sections:
de: Gehen Sie zu :doc:`/durability` um zu lernen, wie man Object Storage verwendet, um dieses Problem auf eine elegante Weise zu lösen. Oder Sie können zu einem dieser Abschnitte gehen:
id: Lanjut ke :doc:`/durability` untuk belajar bagaimana menggunakan Object Storage untuk mengatasi masalah ini dengan cara yang elegan. Atau, Anda bisa melanjutkan ke salah satu bagian berikut:
tr_tr: Bu sorunu Nesne Depolamayı kullanarak zarif bir şekilde nasıl çözeceğinizi öğrenmek için :doc:`/durability` kısmına gidin. Veya şu kısımlardan birine devam edin:

source: Going crazy
de: Werde verrückt
tr_tr: Çılgınlaşmak

source: HOT templating language
de: HOT Templating Sprache
tr_tr: HOT şablon dili

source: High availability
de: Hohe Verfügbarkeit
tr_tr: Yüksek kullanılırlık

source: How do you deploy your application? For example, do you pull the latest code from a source control repository? Do you make packaged releases that update infrequently? Do you perform haphazard tests in a development environment and deploy only after major changes?
de: Wie stellen Sie Ihre Anwendung bereit? Zum Beispiel, ziehen Sie den neuesten Code aus einem Quellcode-Repository? Machen Sie gepackte Releases, die sich selten aktualisieren? Führen Sie zufällige Tests in einer Entwicklungsumgebung durch und ersetzen Sie sie nur nach größeren Änderungen ein?
id: Bagaimana Anda menerapankan aplikasi Anda? Misalnya, apakah Anda menarik kode terbaru dari repositori kontrol sumber? Apakah Anda membuat rilis paket yang jarang diperbarui? Apakah Anda melakukan tes serampangan di lingkungan pengembangan dan hanya menggunakan perubahan besar?
tr_tr: Uygulamanızı nasıl kuruyorsunuz? Örneğin son kodu kaynak kontrol deposundan mı çekiyorsunuz? Paketli dağıtımlar yaparak arada bir güncelliyor musunuz? Geliştirme ortamında gelişigüzel denemeler yaparak yalnızca büyük değişikliklerden sonra mı dağıtıyorsunuz?

source: How the Fractals application interacts with OpenStack
de: Wie die Fractals-Anwendung mit OpenStack interagiert
id: Bagaimana aplikasi Fractals berinteraksi dengan OpenStack
tr_tr: Fraktallar uygulamasının OpenStack ile nasıl etkileşimde bulunacağı

source: How you interact with OpenStack
de: Wie Sie mit OpenStack interagieren
id: Bagaimana Anda berinteraksi dengan OpenStack
tr_tr: OpenStack ile nasıl etkileşimde bulunduğunuz

source: If a key pair of the given name is not found then one is generated.
de: Wenn ein Schlüsselpaar des gegebenen Namens nicht gefunden wird, wird ein solches erzeugt.
id: Jika pasangan kunci dari nama yang diberikan tidak ditemukan maka satu dihasilkan.
tr_tr: Verilen isimde bir anahtar çifti bulunmazsa bir tane üretilir.

source: If an application is meant to automatically scale up and down to meet demand, it is not feasible have any manual steps in the process of deploying any component of the application. Automation also decreases the time to recovery for your application in the event of component failures, increasing fault tolerance and resilience.
de: Wenn eine Anwendung dazu gedacht ist, automatisch zu skalieren, um die Nachfrage zu erfüllen, ist es nicht möglich, manuelle Schritte in den Prozess der Bereitstellung einer Komponente anzuwenden. Automatisierung verringert auch die Zeit für die Wiederherstellung für Ihre Anwendung bei Komponentenausfällen, erhöht die Fehlertoleranz und die Widerstandsfähigkeit.
id: Jika sebuah aplikasi dimaksudkan untuk secara otomatis naik turun untuk memenuhi permintaan, maka tidak mungkin ada langkah manual dalam proses penggelaran komponen aplikasi apapun. Otomasi juga mengurangi waktu untuk pemulihan aplikasi Anda jika terjadi kegagalan komponen, meningkatkan toleransi dan ketahanan kesalahan.
tr_tr: Bir uygulama talebi karşılamak için otomatik olarak yukarı aşağı ölçeklenebilir olacaksa, uygulamanın herhangi bir bileşenini kurmada elle yapılması gereken çok fazla işin olması uygulanabilir değildir. Otomatikleştirme ayrıca bileşen arızalarında kurtarma sürelerini azaltır, hata dayanıklılığını ve esnekliği artırır.

source: If either alarm reports the :code:`insufficient data` state, the default sampling period of the stack is probably too low for your cloud; ask your support team for assistance. You can set the period through the :code:`period` parameter of the stack to match your clouds requirements.
de: Wenn entweder Alarm :code:'unzureichender Daten'-Zustand ist, ist die Standard-Sampling-Periode des Stapels wahrscheinlich zu niedrig für Ihre Cloud; fragen Sie Ihr Support-Team um Hilfe. Sie können die Periode durch den :code:`period`-Parameter des Stacks einstellen, um Ihren Cloud-Anforderungen gerecht zu werden.
id: Jika salah satu alarm melaporkan status :code:`insufficient data`, periode sampling default stack mungkin terlalu rendah untuk awan Anda; Mintalah bantuan tim pendukung Anda. Anda dapat mengatur periode melalui parameter :code:`period` stack agar sesuai dengan persyaratan awan Anda.
tr_tr: Herhangi bir uyarı :code:`yetersiz veri` durumu bildirirse, yığının öntanımlı örnekleme aralığı muhtemelen bulutunuz için çok düşüktür; destek ekibinize yardım için başvurun. Aralığı bulutunuzun gereksinimleriyle eşleşmesi için :code:`period` parametresi aracılığıyla ayarlayabilirsiniz.

source: If one application instance is compromised, all instances with the same image and configuration will likely suffer the same vulnerability. The safest path is to use configuration management to rebuild all instances.
de: Wenn eine Anwendungsinstanz kompromittiert wird, werden alle Instanzen mit demselben Abbild und der Konfiguration wahrscheinlich dieselbe Sicherheitsanfälligkeit erleiden. Der sicherste Weg ist, das Konfigurationsmanagement zu verwenden, um alle Instanzen neu zu erstellen.
id: Jika satu instance aplikasi dikompromikan, semua instance dengan image dan konfigurasi yang sama kemungkinan akan mengalami kerentanan yang sama. Jalan yang paling aman adalah menggunakan manajemen konfigurasi untuk membangun kembali semua instance.
tr_tr: Bir uygulama sunucusu ele geçirilmişse, aynı imaj ve yapılandırmaya sahip tüm sunucuların aynı saldırıyla karşılaşması muhtemeldir. En güvenli yol yapılandırma yönetimiyle tüm sunucuları yeniden inşa etmektir.

source: If one is assigned, users can use this address to access the instance on some OpenStack clouds.
de: Wenn einer zugeordnet ist, können Benutzer diese Adresse verwenden, um auf die Instanz bei einigen OpenStack-Clouds zuzugreifen.
id: Jika IP private diberikan, pengguna dapat menggunakan alamat ini untuk mengakses instance pada beberapa awan OpenStack.
tr_tr: Eğer atanmışsa, kullanıcılar bazı OpenStack bulutlarında sunucuya erişmek için bu adresi kullanabilirler.

source: If one is assigned, users can use this address to access the instance.
de: Wenn einer zugeordnet ist, können Benutzer diese Adresse verwenden, um auf die Instanz zuzugreifen.
id: Jika IP publik diberikan, pengguna dapat menggunakan alamat ini untuk mengakses instance tersebut.
tr_tr: Eğer atanmışsa, kullanıcılar sunucuya erişmek için bu adresi kullanabilirler.

source: If the image that you want is not available in your cloud, you can usually upload one depending on the policy settings of your cloud. For information about how to upload images, see `obtaining images <https://docs.openstack.org/image-guide/obtain-images.html>`_.
de: Wenn das Abbild, das Sie wünschen, in Ihrer Cloud nicht verfügbar ist, können Sie in der Regel einen von den Richtlinieneinstellungen Ihrer Cloud hochladen. Informationen zum Hochladen von Abbildern finden Sie unter 'Abbilder abrufen' <https://docs.openstack.org/image-guide/obtain-images.html> `_.
id: Jika image yang Anda inginkan tidak tersedia di awan Anda, biasanya Anda dapat mengunggahnya berdasarkan setelan kebijakan awan Anda. Untuk informasi tentang cara mengunggah image, lihat `obtaining images <https://docs.openstack.org/image-guide/obtain-images.html>`_.
tr_tr: İstediğiniz imaj bulutunuzda değilse, genellikle bulutunuzun ilke ayarlarına göre bir tane yükleyebilirsiniz. İmaj yüklemeyle ilgili bilgi için `imajları elde etmeye <https://docs.openstack.org/image-guide/obtain-images.html>`_ göz atın.

source: If you are an advanced user, think about how you might remove the database from the architecture and replace it with Object Storage metadata, and then contribute these steps to :doc:`craziness`.
de: Wenn Sie ein fortgeschrittener Benutzer sind, denken Sie darüber nach, wie Sie die Datenbank aus der Architektur entfernen und sie mit Object Storage Metadaten ersetzen können, und tragen Sie diese Schritte dann zu: doc: `craziness`.
id: Jika Anda adalah pengguna tingkat lanjut, pikirkan bagaimana Anda bisa menghapus database dari arsitektur dan menggantinya dengan metadata Object Storag, dan kemudian berkontribusi langkah-langkah ini ke :doc:`craziness`.
tr_tr: Gelişmiş bir kullanıcı isenize, veritabanını mimariden ayırarak Nesne Depolama metaverisi ile nasıl değiştirebileceğinizi düşünün ve bu adımları :doc:`craziness` belgesine yazın.

source: If you are familiar with OpenStack but have not created a cloud application in general or an OpenStack application in particular, this section teaches you how to program with OpenStack components.
de: Wenn Sie mit OpenStack vertraut sind, aber keine Cloud-Anwendung im Allgemeinen oder eine OpenStack-Anwendung erstellt haben, informiert Sie dieser Abschnitt darüber, wie Sie mit OpenStack-Komponenten programmieren können.
id: Jika Anda sudah familiar dengan OpenStack namun belum membuat aplikasi cloud secara umum atau aplikasi OpenStack pada khususnya, bagian ini mengajarkan Anda bagaimana memprogram dengan komponen OpenStack.
tr_tr: OpenStack'e aşina iseniz ama bir bulut uygulaması veya OpenStack uygulaması oluşturmadıysanız, bu kısım OpenStack bileşenleriyle nasıl programlama yapacağınızı öğretir.

source: If you check the load on the :code:`app-controller` API service instance, you see that the instance is not doing well. On your single CPU flavor instance, a load average greater than 1 means that the server is at capacity.
de: Wenn Sie die Belastung auf dem :code:`app-controller` API Service Instanz überprüfen, sehen Sie, dass die Instanz nicht gut läuft. Bei Ihrer einzelnen CPU-Varianten-Instanz bedeutet ein Last-Durchschnitt größer als 1, dass der Server an Kapazität ist.
id: Jika Anda memeriksa beban pada instance layanan API :code:`app-controller` , Anda melihat instance tidak berjalan dengan baik. Pada instance flavor CPU tunggal Anda, rata-rata beban lebih besar dari 1 berarti server berkapasitas.
tr_tr: :code:`app-controller` API servis sunucusundaki yükü kontrol ederseniz, sunucunun pek iyi çalışmadığını görürsünüz. Tek işlemcili niteliğe sahip sunucunuzda, 1'den büyük bir ortalama yük sunucunun kapasitesinde çalıştığı anlamına gelir.

source: If you check the load on the worker, you can see that the instance is not doing well. On the single CPU flavor instance, a load average greater than 1 means that the server is at capacity.
de: Wenn Sie die Belastung des Workers überprüfen, können Sie sehen, dass die Instanz nicht gut läuft. Bei der einzelnen CPU-Varianten-Instanz bedeutet ein Last-Durchschnitt größer als 1, dass der Server an der Kapazitätsgrenze ist.
id: Jika Anda memeriksa muatan pekerja, Anda bisa melihat instance tidak berjalan dengan baik. Pada instance flavor CPU tunggal, rata-rata muatan lebih besar dari 1 berarti server berada pada kapasitas.
tr_tr: İşçi üzerindeki yükü kontrol ederseniz, sunucunun pek iyi gitmediğini görebilirsiniz. Tek CPU nitelikli sunucuda, 1'den büyük bir yük ortalaması sunucunun kapasitesinde olduğu anlamına gelir.

source: If you deploy your application on a regular basis, you can resolve outages and make security updates without manual intervention. If an outage occurs, you can provision more resources in another region. If you must patch security holes, you can provision additional compute nodes that are built with the updated software. Then, you can terminate vulnerable nodes and automatically fail-over traffic to the new instances.
de: Wenn Sie Ihre Anwendung regelmäßig bereitstellen, können Sie Ausfälle lösen und Sicherheitsupdates ohne manuelle Eingriffe erstellen. Wenn ein Ausfall auftritt, können Sie mehr Ressourcen in einer anderen Region bereitstellen. Wenn Sie Sicherheitslücken beheben müssen, können Sie zusätzliche Compute-Knoten bereitstellen, die mit der aktualisierten Software erstellt wurden. Anschließend können Sie anfällige Knoten beenden und den neuen Instanzen automatisch versagen.
id: Jika Anda menerapkan aplikasi secara teratur, Anda dapat mengatasi pemadaman listrik dan melakukan pembaruan keamanan tanpa intervensi manual. Jika terjadi pemadaman, Anda dapat menyediakan lebih banyak sumber daya di wilayah lain. Jika Anda harus menambal lubang keamanan, Anda dapat menyediakan node komputasi tambahan yang dibangun dengan perangkat lunak yang diperbarui. Kemudian, Anda dapat menghentikan nodus yang rentan dan lalu lintas gagal (fail-over) ke instance baru secara otomatis.
tr_tr: Düzenli olarak uygulamanızı kuruyorsanız, elle araya girmeden kesintileri çözebilir ve güvenlik güncellemelerini yapabilirsiniz. Bir kesinti olursa, başka bir bölgeden daha fazla kaynak hazırlayabilirsiniz. Güvenlik yamaları yapmanız gerekirse, güncel yazılıma sahip şekilde inşa edilmiş ek hesaplama düğümleri hazırlayabilirsiniz. Ardından saldırıya açık düğümleri sonlandırır ve trafiği yeni sunuculara otomatik olarak aktarırsınız.

source: If you do not have a working application, follow the steps in :doc:`introduction` to create one.
de: Wenn Sie keine Arbeitsanwendung haben, folgen Sie den Schritten in :doc:`introduction', um eine zu erstellen.
id: Jika Anda tidak memiliki aplikasi yang bekerja, ikuti langkah-langkah di :doc:`introduction` untuk membuatnya.
tr_tr: Çalışan bir uygulamanız yoksa, bir tane oluşturmak için :doc:`introduction` kısmındaki adımları takip edin.

source: If you do not know Maven then the `Maven home site <https://maven.apache.org/what-is-maven.html>`_ is a good place to learn more.
de: Wenn Sie nicht wissen was Maven ist, dann ist die `Maven home site <https://maven.apache.org/what-is-maven.html> `_ ein guter Ort, um mehr zu lernen.
id: Jika Anda tidak tahu Maven maka `Maven home site <https://maven.apache.org/what-is-maven.html>`_ adalah tempat yang baik untuk belajar lebih banyak.
tr_tr: Maven bilmiyorsanız daha fazlasını öğrenmek için `Maven sitesi <https://maven.apache.org/what-is-maven.html>`_ iyi bir yerdir.

source: If you do not use floating IP addresses, substitute another IP address, as appropriate.
de: Wenn Sie keine Floating-IP-Adressen verwenden, ersetzen Sie gegebenenfalls eine andere IP-Adresse.
id: Jika Anda tidak menggunakan alamat IP mengambang, ganti alamat IP lain, jika sesuai.
tr_tr: Değişken IP adresleri kullanmazsanız, uygun şekilde başka bir IP adresiyle değiştirin.
