Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: You can also use the OpenStack API to create snapshots of running instances and persistent volumes. For more information, see your SDK documentation.
de: Sie können auch die OpenStack-API verwenden, um Snapshots von laufenden Instanzen und persistenten Volumes zu erstellen. Weitere Informationen finden Sie in Ihrer SDK-Dokumentation.
id: Anda juga dapat menggunakan API OpenStack untuk membuat snapshot dari instance yang berjalan dan volume yang ada. Untuk informasi lebih lanjut, lihat dokumentasi SDK Anda.
tr_tr: OpenStack API'yi kullanarak çalışan sunucuların ya da kalıcı birimlerin anlık görüntülerini de oluşturabilirsiniz. Daha fazla bilgi için SDK belgelendirmenize göz atın.

source: You can complete advanced tasks such as uploading an object with metadata, as shown in following example. For more information, see the documentation for your SDK.
de: Sie können erweiterte Aufgaben wie das Hochladen eines Objekts mit Metadaten abschließen, wie im folgenden Beispiel gezeigt. Weitere Informationen finden Sie in der Dokumentation zu Ihrem SDK.
id: Anda dapat menyelesaikan tugas lanjutan seperti mengunggah objek dengan metadata, seperti ditunjukkan pada contoh berikut. Untuk informasi lebih lanjut, lihat dokumentasi untuk SDK Anda.
tr_tr: Aşağıdaki örnekte gösterildiği gibi metaveriyle birlikte bir nesne yükleme gibi karmaşık görevleri tamamlayabilirsiniz. Daha fazla bilgi için SDK'nız için belgelendirmeye göz atın.

source: You can detach the volume and reattach it elsewhere, or use the following steps to delete the volume.
de: Sie können das Volume ablösen und an anderer Stelle wieder anbringen, oder verwenden Sie die folgenden Schritte, um das Volume zu löschen.
id: Anda dapat melepaskan volume dan memasangnya kembali di tempat lain, atau gunakan langkah-langkah berikut untuk menghapus volume.
tr_tr: Birimi ayırabilir ve başka bir yere ekleyebilirsiniz, veya birimi silmek için şu adımları kullanabilirsiniz.

source: You can list available security groups with:
de: Sie können verfügbare Sicherheitsgruppen mit:
id: Anda dapat mencantumkan kelompok keamanan yang tersedia dengan:
tr_tr: Kullanılabilir güvenlik gruplarını şu şekilde listeleyebilirsiniz:

source: You can then attach it to the instance:
de: Sie können sie dann an die Instanz anschließen:
id: Anda kemudian bisa lekatkan ke instance:
tr_tr: Ardından sunucuya ekleyebilirsiniz:

source: You create stacks from templates, which contain resources. Resources are an abstraction in the HOT (Heat Orchestration Template) template language, which enables you to define different cloud resources by setting the :code:`type` attribute.
de: Sie erstellen Stacks aus Vorlagen, die Ressourcen enthalten. Ressourcen sind eine Abstraktion in der Schablonensprache von HOT (Heat Orchestration Template), mit der Sie verschiedene Cloud-Ressourcen definieren können, indem Sie das Attribut :code:`type` setzen.
id: Anda membuat tumpukan dari template, yang berisi sumber daya. Sumber daya adalah abstraksi dalam bahasa template HOT (Heat Orchestration Template), yang memungkinkan Anda menentukan sumber daya awan yang berbeda dengan menetapkan atribut :kode: `type`.
tr_tr: Yığınları kaynaklar içeren şablonlardan oluşturursunuz. Kaynaklar HOT (Heat Orkestrasyon Şablonu) şablon dilinde soyutlamalardır, ve :code:`type` özniteliğini ayarlayarak farklı bulut kaynakları tanımlamanızı sağlarlar.

source: You might have to run the :command:`openstack stack list` command a few times before the stack creation is complete.
de: Möglicherweise müssen Sie :command: 'openstack stack list' ein paar Mal ausführen, bevor die Stapelerstellung abgeschlossen ist.
id: Anda mungkin harus menjalankan perintah :command:`openstack stack list` beberapa kali sebelum pembuatan stack selesai.
tr_tr: Yığın oluşturma tamamlanmadan önce :command:`openstack stack list` komutunu bir kaç kere çalıştırmanız gerekebilir.

source: You might want to use multiple clouds, such as a private cloud inside your organization and a public cloud. This section attempts to do exactly that.
de: Vielleicht möchten Sie mehrere Clouds verwenden, z. B. eine private Cloud in Ihrer Organisation und eine öffentliche Cloud. Dieser Abschnitt versucht genau das zu tun.
id: Anda mungkin ingin menggunakan beberapa awan, seperti awan pribadi di dalam organisasi Anda dan awan publik. Bagian ini mencoba melakukan hal itu.
tr_tr: Birden fazla bulut kullanmak isteyebilirsiniz, örneğin kurum içinde özel bir bulut ve açık ayrı bir bulut. Bu kısım tam olarak bunu yapmaya çalışır.

source: You must pass in objects and not object names to the delete commands.
de: Sie müssen Objekte und nicht Objektnamen an die Löschbefehle übergeben.
id: Anda harus melewati objek dan bukan nama objek ke perintah hapus.
tr_tr: Silme komutlarına nesne isimlerini değil nesneleri vermelisiniz.

source: You need a server for the dedicated database. Use the image, flavor, and keypair that you used in :doc:`/getting_started` to launch an :code:`app-database` instance.
de: Sie benötigen einen Server für die dedizierte Datenbank. Verwenden Sie das Abbild, die Variante und das Schlüsselpaar, das Sie verwendet haben :doc: `/ getting_started`, um einen :code:` app-database` Instanz zu starten.
id: Anda memerlukan server untuk database dedicated. Gunakan image, flavor, dan keypair yang Anda gunakan di :doc:`/getting_started` untuk meluncurkan sebuah instance :code:`app-database`.
tr_tr: Adanmış veritabanı için bir sunucuya ihtiyacınız var. :doc:`/getting_started` belgesinde kullandığınız imajı, niteliği ve anahtar çiftini kullanarak bir :code:`app-database` sunucusu başlatın.

source: You pass in these configuration settings as parameters:
de: Sie übergeben diese Konfigurationseinstellungen als Parameter:
id: Anda melewati pengaturan konfigurasi ini sebagai parameter:
tr_tr: Şu yapılandırma ayalarını parametreler olarak geçirirsiniz:

source: You should be able to see them in the member list:
de: Sie sollten sie in der Mitgliederliste sehen können:
id: Anda harus bisa melihatnya di daftar anggota:
tr_tr: Üye listesinde görüyor olmalısınız:

source: You should be fairly confident about starting instances and distributing services from an application among these instances.
de: Sie sollten sich ziemlich sicher über das Starten von Instanzen und die Verteilung von Diensten aus einer Anwendung unter diesen Instanzen sein.
id: Anda harus cukup percaya diri untuk memulai instance dan mendistribusikan layanan dari aplikasi di antara instances ini.
tr_tr: Sunucular başlatma ve bu sunucular arasındaki bir uygulamadan servisleri dağıtma konusunda kendinize güveniyor olmalısınız.

source: You should now be able to see this container appear in a listing of all containers in your account:
de: Sie sollten nun in der Lage sein, diesen Container in einer Auflistung aller Container in Ihrem Konto sehen:
id: Anda sekarang dapat melihat penampung ini muncul dalam daftar semua kontainer di akun Anda:
tr_tr: Artık bu kapsayıcıyı hesabınızdaki kapsayıcıların listesinde görebiliyor olmalısınız:

source: You should now be fairly confident working with Block Storage volumes. For information about other calls, see the volume documentation for your SDK. Or, try one of these tutorial steps:
de: Sie sollten jetzt ziemlich sicher sein, mit Block Storage Volumes zu arbeiten. Weitere Informationen zu anderen Anrufen finden Sie in der Datenträgerdokumentation für Ihr SDK. Oder versuchen Sie eines dieser Tutorial Schritte:
id: Anda sekarang harus cukup yakin bekerja dengan volume Block Storage. Untuk informasi tentang panggilan lainnya, lihat dokumentasi volume untuk SDK Anda. Atau, cobalah salah satu langkah tutorial berikut:
tr_tr: Artık Blok Depolama birimleriyle yeterli özgüvenle çalışabiliyor olmalısınız. Diğer çağrılarla ilgili bilgi için, SDK'nız için birim belgelendirmesine göz atın. Veya şu öğretici adımlardan birini deneyin:

source: You should now be fairly confident working with Object Storage. You can find more information about the Object Storage SDK calls at:
de: Sie sollten jetzt ziemlich sicher sein, mit Object Storage zu arbeiten. Weitere Informationen zu den Object Storage SDK-Anrufen finden Sie unter:
id: Anda sekarang harus cukup yakin bekerja dengan Object Storage. Anda dapat menemukan lebih banyak informasi tentang Object Storage SDK di:
tr_tr: Artık Nesne Depolamayla çalışırken kendinizden emin olmalısınız. Nesne Depolama SDK çağrılarıyla ilgili daha fazla bilgi için:

source: You should now be fairly confident working with the Network API. To see calls that we did not cover, see the volume documentation of your SDK, or try one of these tutorial steps:
de: Sie sollten jetzt ziemlich sicher sein, mit der Netzwerk-API zu arbeiten. Um Aufrufe zu sehen, die wir nicht abgedeckt haben, sehen Sie die Datenträgerdokumentation Ihres SDK oder versuchen Sie einen dieser Tutorial Schritte:
id: Anda sekarang harus cukup yakin bekerja dengan Network API. Untuk melihat panggilan yang tidak kami cover, lihat dokumentasi volume SDK Anda, atau coba salah satu langkah tutorial berikut:
tr_tr: Artık Ağ API'si ile çalışırken kendinizden emin olmalısınız. Kapsamadığımız çağrıları görmek için SDK'nızın birim belgelendirmesine göz atın veya şu öğretici adımlardan birini deneyin:

source: You should now be fairly confident working with the Orchestration service. To see the calls that we did not cover and more, see the volume documentation of your SDK. Or, try one of these steps in the tutorial:
de: Sie sollten jetzt ziemlich sicher sein, mit dem Orchestrationsdienst zu arbeiten. Um die Anrufe zu sehen, die wir nicht abgedeckt haben und mehr, sehen Sie die Datendokumentation Ihres SDK. Oder versuchen Sie einen dieser Schritte im Tutorial:
id: Anda sekarang harus cukup yakin bekerja dengan layanan Orchestration. Untuk melihat panggilan yang tidak kami tutup dan banyak lagi, lihat dokumentasi volume SDK Anda. Atau, coba salah satu langkah berikut dalam tutorial:
tr_tr: Artık Orkestrasyon servisiyle oldukça rahat şekilde çalışabiliyor olmalısınız. Burda kapsamadığımız çağrıları ve daha fazlasını görmek için SDK'nızın birim belgelendirmesine göz atın. Veya öğreticideki şu adımlardan birini deneyin:

source: You should now have a basic understanding of the architecture of cloud-based applications. In addition, you have had practice starting new instances, automatically configuring them at boot, and even modularizing an application so that you may use multiple instances to run it. These are the basic steps for requesting and using compute resources in order to run your application on an OpenStack cloud.
de: Sie sollten nun ein grundlegendes Verständnis der Architektur von Cloud-basierten Anwendungen haben. Darüber hinaus haben Sie Praxis, neue Instanzen zu starten, automatisch konfigurieren sie beim Booten, und sogar modularisieren eine Anwendung, so dass Sie mehrere Instanzen verwenden können, um sie auszuführen. Dies sind die grundlegenden Schritte zum Anfordern und Verwenden von Compute-Ressourcen, um Ihre Anwendung auf einer OpenStack-Cloud auszuführen.
id: Anda sekarang harus memiliki pemahaman dasar tentang arsitektur aplikasi berbasis cloud. Selain itu, Anda sudah berlatih memulai instance baru, secara otomatis mengonfigurasikannya saat boot, dan bahkan memodulasi sebuah aplikasi sehingga Anda dapat menggunakan beberapa instance untuk menjalankannya. Ini adalah langkah dasar untuk meminta dan menggunakan sumber daya untuk menjalankan aplikasi Anda di awan OpenStack.
tr_tr: Artık bulut tabanlı uygulamaların mimarisiyle ilgili temel şeyleri anlamış olmalısınız. Ek olarak yeni sunucular başlatmak, önyüklemede otomatik olarak yapılandırma ve hatta çalıştırmak için birden çok sunucu kullanabilmek için uygulamayı modülerleştirmeyle ilgili pratik de yaptınız. Bunlar uygulamanızı OpenStack bulutunda çalıştırabilmeniz için hesaplama kaynaklarını isteme ve kullanmanın temel adımlarıdır.

source: You should see output like this:
de: Die Ausgabe sollte wie folgt aussehen:
id: Anda harus melihat output seperti ini:
tr_tr: Şuna benzer çıktı görmelisiniz:

source: You should see output something like this:
de: Sie sollten so etwas wie folgt sehen:
id: Anda harus melihat output seperti ini:
tr_tr: Şuna benzer bir çıktı görmelisiniz:

source: You should see output something like:
de: Sie sollten so etwas sehen:
id: Anda harus melihat output seperti:
tr_tr: Şuna benzer bir çıktı görmelisiniz:

source: You should see output such as:
de: Sie sollten Ausgaben sehen wie:
id: Anda harus melihat output seperti:
tr_tr: Şuna benzer bir çıktı görmelisiniz:

source: You will progressively ramp up to use up six instances, so make sure that your cloud account has the appropriate quota.
de: Sie werden fortschreitend hochfahren, um sechs Instanzen zu verwenden, also stellen Sie sicher, dass Ihr Cloud-Konto die entsprechende Quote hat.
id: Anda akan semakin banyak menggunakan sampai enam instance, jadi pastikan akun awan Anda memiliki kuota yang sesuai.
tr_tr: Yavaş yavaş altı sunucu kullanmaya geçeceksiniz, bu yüzden bulut hesabınızın bu kadar kotası olduğundan emin olun.

source: Your SDK might call an instance a 'node' or 'server'.
de: Ihr SDK könnte eine Instanz einen 'Knoten' oder 'Server' aufrufen.
id: SDK Anda mungkin memanggil instance 'node' atau 'server'.
tr_tr: SDK'nız sunucuya 'düğüm' ya da 'makine' diyebilir.

source: Your images and flavors will be different, of course.
de: Ihre Abbilder und Varianten werden natürlich anders sein.
id: Flavor dan image Anda akan berbeda, tentu saja.
tr_tr: Tabi imaj ve nitelikleriniz farklı olacaktır.

source: Your ssh key name
de: Ihr ssh Schlüssel Name
id: Nama kunci ssh Anda
tr_tr: Ssh anahtar adınız

source: `Micro-services <http://en.wikipedia.org/wiki/Microservices>`_ are an important design pattern that helps achieve application modularity. Separating logical application functions into independent services simplifies maintenance and re-use. Decoupling components also makes it easier to selectively scale individual components, as required. Further, application modularity is a required feature of applications that scale out well and are fault tolerant.
de: `Mikro-Dienste <http://en.wikipedia.org/wiki/Microservices>`_ sind ein wichtiges Design-Muster, das hilft, die Modularität der Anwendung zu erreichen. Die Trennung von logischen Applikationsfunktionen in unabhängige Dienste vereinfacht die Wartung und Wiederverwendung. Entkopplungskomponenten erleichtern auch die selektive Skalierung einzelner Komponenten nach Bedarf. Weiterhin ist die Anwendungsmodularität ein notwendiges Merkmal von Anwendungen, die gut skalieren und fehlertolerant sind.
id: `Micro-services <http://en.wikipedia.org/wiki/Microservices>`_ adalah pola desain penting yang membantu mencapai modularitas aplikasi. Memisahkan fungsi aplikasi logis menjadi layanan independen menyederhanakan perawatan dan penggunaan ulang. Komponen Decoupling juga mempermudah komponen skala individu secara selektif, sesuai kebutuhan. Selanjutnya, modularitas aplikasi adalah fitur aplikasi yang dibutuhkan yang dapat diukur dengan baik dan fault tolerant.
tr_tr: `Mikro servisler <http://en.wikipedia.org/wiki/Microservices>`_ uygulama modülerliğini elde etmede yardımcı olan önemli tasarım kalıplarıdır. Mantıksal uygulamaları bağımsız servislere ayırmak bakımı ve tekrar kullanımı basitleştirir. Bileşimleri koparma bağımsız bileşenleri gerektiği gibi ayrı ayrı ölçeklendirmeyi kolaylaştırır. Dahası iyi ölçeklenir ve hataya dayanıklı uygulamalar için uygulama modülerliği gerekli bir özelliktir.

source: `OpenStack Cloud SDK for Microsoft .NET 1.4.0.1 or later installed <https://www.nuget.org/packages/openstack.net>`_.
de: `OpenStack Cloud SDK für Microsoft .NET 1.4.0.1 oder höher installiert <https://www.nuget.org/packages/openstack.net> `_.
tr_tr: `Microsoft .NET 1.4.0.1 ve üstü için kurulu OpenStack Bulut SDK'sı <https://www.nuget.org/packages/openstack.net>`_.

source: `OpenStack Object Storage <https://www.openstack.org/software/openstack-storage/>`_ (code-named swift) is open-source software that enables you to create redundant, scalable data storage by using clusters of standardized servers to store petabytes of accessible data. It is a long-term storage system for large amounts of static data that you can retrieve, leverage, and update. Unlike more traditional storage systems that you access through a file system, you access Object Storage through an API.
de: `OpenStack Objektspeicher <https://www.openstack.org/software/openstack-storage/> `` (code-named swift) ist Open-Source-Software, mit der Sie redundante, skalierbare Datenspeicherung erstellen können, indem Sie Cluster von standardisierten Servern verwenden, um Petabyte zugängliche Daten zu speichern. Es ist ein langfristiges Speichersystem für große Mengen an statischen Daten, die Sie abrufen, nutzen und aktualisieren können. Im Gegensatz zu herkömmlichen Speichersystemen, die Sie über ein Dateisystem aufrufen, greifen Sie über eine API auf Objektspeicher zu.
id: `OpenStack Object Storage <https://www.openstack.org/software/openstack-storage/>`_ (code-named swift) adalah perangkat lunak open-source yang memungkinkan Anda membuat penyimpanan data yang berlebihan dan terukur dengan menggunakan kumpulan server standar untuk menyimpan petabyte data yang dapat diakses. Ini adalah sistem penyimpanan jangka panjang untuk sejumlah besar data statis yang dapat Anda ambil, leverage, dan perbarui. Tidak seperti sistem penyimpanan tradisional lainnya yang Anda akses melalui sistem file, Anda mengakses Object Storage melalui API.
tr_tr: `OpenStack Nesne Depolama <https://www.openstack.org/software/openstack-storage/>`_ (kod adı swift) petabaytlarca erişlebilir veriyi depolamak için standart sunucuların kümesini kullanarak yedekli, ölçeklenebilir veri deposu oluşturmanızı sağlayan açık kaynak bir yazılımdır. Büyük miktarlarda statik veriyi alabileceğiniz, kullanabileceğiniz ve güncelleyebileceğiniz uzun dönem depolama sistemidir. Bir dosya sistemi üzerinden eriştiğiniz daha geleneksel depolama sistemlerinin aksine Nesne Depolamaya API üzerinden erişirsiniz.

source: `Phoenix Servers <http://martinfowler.com/bliki/PhoenixServer.html>`_, named for the mythical bird that is consumed by fire and rises from the ashes to live again, make it easy to start over with new instances.
de: `Phoenix-Servern <http://martinfowler.com/bliki/PhoenixServer.html> `_, benannt nach dem mythischen Vogel, der vom Feuer verbrannt wird und von der Asche aufsteigt, um wieder zu leben, macht es leicht, mit neuen Instanzen zu starten.
id: `Phoenix Servers <http://martinfowler.com/bliki/PhoenixServer.html>`_, dinamakan untuk burung mitos yang dimakan oleh api dan bangkit dari abu untuk hidup kembali, memudahkan untuk memulai kembali dengan kejadian baru.
tr_tr: Ateş tarafından tüketilen ve küllerinden yeniden doğan efsanevi kuşun ardından isimlendirilen `Phoenix Sunucuları <http://martinfowler.com/bliki/PhoenixServer.html>`_ yeni sunucularla tekrar başlamayı kolaylaştırır.

source: `a recent version of gophercloud installed <https://godoc.org/github.com/gophercloud/gophercloud>`_
de: 'eine neue Version von gophercloud installiert <https://godoc.org/github.com/gophercloud/gophercloud> `_
tr_tr: `gophercloud'un yeni bir sürümü kurulmuş <https://godoc.org/github.com/gophercloud/gophercloud>`_

source: `a recent version of php-opencloud installed <http://docs.php-opencloud.com/en/latest/>`_.
de: `eine aktuelle Version von php-opencloud installiert <http://docs.php-opencloud.com/en/latest/> `_.
tr_tr: `php-opencloud'un yeni bir sürümü kurulmuş <http://docs.php-opencloud.com/en/latest/>`_.

source: `a recent version of shade library installed <https://docs.openstack.org/infra/shade/installation.html>`_.
de: `eine aktuelle Version der shade-Bibliothek installiert <https://docs.openstack.org/infra/shade/installation.html> `_.

source: `cloud-init <https://cloudinit.readthedocs.org/en/latest/>`_ is a tool that performs instance configuration tasks during the boot of a cloud instance, and comes installed on most cloud images. :code:`ex_userdata`, which was passed to :code:`create_node`, is the configuration data passed to cloud-init.
de: `cloud-init <https://cloudinit.readthedocs.org/en/latest/> `_ ist ein Tool, das Instanz-Konfigurationsaufgaben während des Bootens einer Cloud-Instanz ausführt und auf den meisten Cloud-Abbildern installiert wird. :code:`ex_userdata`, der an :code:`create_node` übergeben wurde, sind die an cloud-init übergebenen Konfigurationsdaten.
id: `cloud-init <https://cloudinit.readthedocs.org/en/latest/>`_ adalah alat yang melakukan tugas konfigurasi instance saat boot instance awan, dan dipasang pada sebagian besar image awan. :code:`ex_userdata`, yang dilewatkan ke :code:`create_node`, adalah data konfigurasi yang dilewatkan ke cloud-init.
tr_tr: `cloud-init <https://cloudinit.readthedocs.org/en/latest/>`_ bir bulut sunucusunun önyüklenmesi sırasındaki sunucu yapılandırma görevlerini gerçekleştiren bir araçtır, ve çoğu bulut imajında kurulu olarak gelir. :code:`create_node`'a verilen :code:`ex_userdata` cloud-init'e geçirilen yapılandırma verisidir.

source: `fog 1.19 or higher installed <http://www.fogproject.org/wiki/index.php?title=FOGUserGuide#Installing_FOG>`_ and working with ruby gems 1.9.
de: `fog 1.19 oder höher installiert <http://www.fogproject.org/wiki/index.php?title=FOGUserGuide#Installing_FOG> `_ und die Arbeit mit ruby gems 1.9.
tr_tr: `fog 1.19 veya daha yenisi kurulu <http://www.fogproject.org/wiki/index.php?title=FOGUserGuide#Installing_FOG>`_ ve ruby gems 1.9 ile çalışır durumda.

source: `jClouds 1.8 or higher installed <https://jclouds.apache.org/start/install>`_.
de: `jClouds 1.8 oder höher installiert <https://jclouds.apache.org/start/install> `_.
tr_tr: `jClouds 1.8 veya daha yenisi kurulmuş <https://jclouds.apache.org/start/install>`_.

source: `libcloud 0.15.1 or higher installed <https://libcloud.apache.org/getting-started.html>`_.
de: `libcloud 0.15.1 oder höher installiert <https://libcloud.apache.org/getting-started.html> `_.
tr_tr: `libcloud 0.15.1 veya daha yenisi kurulmuş <https://libcloud.apache.org/getting-started.html>`_.

source: `pkgcloud 1.2 or higher installed <https://github.com/pkgcloud/pkgcloud#getting-started>`_.
de: `pkgcloud 1.2 oder höher installiert <https://github.com/pkgcloud/pkgcloud#getting-started> `_.
tr_tr: `pkgcloud 1.2 veya daha yenisi kurulmuş <https://github.com/pkgcloud/pkgcloud#getting-started>`_.

source: a recent version of `openstacksdk <http://python-openstacksdk.readthedocs.org/en/latest/users/index.html>`_ installed.
de: eine aktuelle Version von `openstacksdk <http://python-openstacksdk.readthedocs.org/en/latest/users/index.html> `_ installiert

source: fog `does support OpenStack Orchestration <https://github.com/fog/fog-openstack/tree/master/lib/fog/openstack/models/orchestration>`_.
de: fog 'unterstützt OpenStack Orchestrierung <https://github.com/fog/fog-openstack/tree/master/lib/fog/openstack/models/orchestration> `_.
tr_tr: fog `OpenStack Orkestrasyon'u desteklemiyor <https://github.com/fog/fog-openstack/tree/master/lib/fog/openstack/models/orchestration>`_.

source: fog `supports <http://www.rubydoc.info/gems/fog/1.8.0/Fog/Network/OpenStack>`_ the OpenStack Networking API, but this section has not yet been completed.
de: fog 'Unterstützung<http://www.rubydoc.info/gems/fog/1.8.0/Fog/Network/OpenStack> `` die OpenStack Networking API, aber dieser Abschnitt ist noch nicht abgeschlossen.
id: fog `supports <http://www.rubydoc.info/gems/fog/1.8.0/Fog/Network/OpenStack>`_ the OpenStack Networking API, namun bagian ini belum selesai.
tr_tr: fog OpenStack Ağ API'sini `destekler <http://www.rubydoc.info/gems/fog/1.8.0/Fog/Network/OpenStack>`_ ama bu kısım henüz tamamlanmadı.
