Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: The Object Storage service manages many of the tasks normally managed by the application owner. The Object Storage service provides a scalable and durable API that you can use for the fractals app, eliminating the need to be aware of the low level details of how objects are stored and replicated, and how to grow the storage pool. Object Storage handles replication for you. It stores multiple copies of each object. You can use the Object Storage API to return an object, on demand.
de: Der Objektspeicherdienst verwaltet viele Aufgaben, die normalerweise vom Anwendungsbesitzer verwaltet werden. Der Object Storage Service bietet eine skalierbare und langlebige API, die Sie für die Fractals App verwenden können, wodurch es keine Notwendigkeit gibt, sich der niederen Details wie Objekte gespeichert und repliziert zu widmen, und wie der Speicherpool wächst. Object Storage behandelt Replikation für Sie. Es speichert mehrere Kopien jedes Objekts. Sie können die Objektspeicher-API verwenden, um ein Objekt auf Anfrage zurückzusenden.
id: Layanan Object Storage mengelola banyak tugas yang biasanya dikelola oleh pemilik aplikasi. Layanan Object Storage menyediakan API terukur dan tahan lama yang dapat Anda gunakan untuk aplikasi fraktal, sehingga perlu diperhatikan rincian tingkat rendah tentang bagaimana objek disimpan dan direplikasi, dan bagaimana cara menumbuhkan storage pool. Object Storage menangani replikasi untuk Anda. Ini menyimpan banyak salinan dari setiap objek. Anda dapat menggunakan Object Storage API untuk mengembalikan objek, berdasarkan permintaan.
tr_tr: Nesne Depolama servisi normalde uygulama sahibi tarafından yönetilen birçok görevi yönetir. Nesne Depolama servisi fraktal uygulaması için kullanabileceğiniz ölçeklenebilir ve dayanıklı bir API sunar, nesnelerin nasıl depolandığı ya da yedeklendiği, depolama havuzunun nasıl büyütüleceği gibi düşük seviye ayrıntıları bilmeniz gerekliliğini ortadan kaldırır. Nesne Depolama sizin için yedeklemeyi halleder. Her nesnenin birden fazla kopyasını deoplar. İstediğiniz anda Nesne Depolama API'sini kullanarak bir nesne döndürebilirsiniz.

source: The OpenStack Networking API provides support for creating loadbalancers, which can be used to scale the Fractal app web service. In the following example, we create two compute instances via the Compute API, then instantiate a load balancer that will use a virtual IP (VIP) for accessing the web service offered by the two compute nodes. The end result will be the following network topology:
de: Die OpenStack Networking API bietet Unterstützung für das Erstellen von Loadbalancern, mit denen der Fractal App Web Service skaliert werden kann. Im folgenden Beispiel erstellen wir zwei Compute-Instanzen über die Compute API und instanziieren dann einen Load Balancer, der eine virtuelle IP (VIP) für den Zugriff auf den von den beiden Compute-Knoten angebotenen Webdienst verwendet. Das Ergebnis ist die folgende Netzwerktopologie:
id: OpenStack Networking API memberikan dukungan untuk membuat loadbalancer, yang dapat digunakan untuk mengukur layanan web aplikasi Fraktal. Pada contoh berikut, kita membuat dua instance komputasi melalui Compute API, lalu instantiate penyeimbang beban yang akan menggunakan virtual IP (VIP) untuk mengakses layanan web yang ditawarkan oleh dua node komputasi. Hasil akhirnya adalah topologi jaringan berikut:
tr_tr: OpenStack Ağ API'si Fraktal uygulama web servisini ölçeklemekte kullanılabilecek yük dengeleyiciler oluşturmayı destekler. Aşağıdaki örnekte, Hesaplama API'si ile iki hesaplama sunucusu oluştururuz, ardından iki hesaplama sunucusu tarafından verilen web servisine erişmek için bir sanal IP (VIP) kullanacak yük dengeleyiciyi ilklendiririz. Sonuçta şu ağ topolojisi elde edilir:

source: The OpenStack Orchestration API uses the stacks, resources, and templates constructs.
de: Die OpenStack Orchestration API verwendet die Stapel-, Ressourcen- und Vorlagenkonstrukte.
id: OpenStack Orchestration API menggunakan tumpukan, sumber daya, dan konstruksi template.
tr_tr: OpenStack Orkestrasyon API'si yığınları, kaynakları ve şablon yapılarını kullanır.

source: The OpenStack SDK does not currently support OpenStack Orchestration.
de: Das OpenStack SDK unterstützt derzeit keine OpenStack Orchestrierung
id: OpenStack SDK saat ini tidak mendukung OpenStack Orchestration.
tr_tr: OpenStack SDK henüz OpenStack Orkestrasyon'u desteklemiyor.

source: The Orchestration service is not deployed by default in every cloud. If these commands do not work, it means the Orchestration API is not available; ask your support team for assistance.
de: Der Orchestrierungsdienst wird in jeder Cloud nicht standardmäßig bereitgestellt. Wenn diese Befehle nicht funktionieren, bedeutet dies, dass die Orchestrierungs-API nicht verfügbar ist. fragen Sie Ihr Support-Team um Hilfe.
id: Layanan Orchestration tidak dikerahkan secara default di setiap awan. Jika perintah ini tidak berhasil, berarti Orchestration API tidak tersedia; mintalah bantuan tim pendukung Anda.
tr_tr: Orkestrasyon servisi her bulutta öntanımlı olarak kurulmaz. Bu komutlar çalışmazsa Orkestrasyon API'si kullanılabilir değil demektir; destek ekibinizden yardım isteyebilirsiniz.

source: The Orchestration service provides a template-based way to describe a cloud application, then coordinates running the needed OpenStack API calls to run cloud applications. The templates enable you to create most OpenStack resource types, such as instances, networking information, volumes, security groups, and even users. It also provides more advanced functionality, such as instance high availability, instance auto-scaling, and nested stacks.
de: Der Orchestrierungsdienst bietet eine Vorlagen-basierte Möglichkeit, eine Cloud-Anwendung zu beschreiben und koordiniert dann die erforderlichen OpenStack-API-Aufrufe, um Cloud-Anwendungen auszuführen. Mit den Vorlagen können Sie die meisten OpenStack-Ressourcentypen wie Instanzen, Netzwerkinformationen, Volumes, Sicherheitsgruppen und sogar Benutzer erstellen. Es bietet auch erweiterte Funktionalität, wie z.B. Hochverfügbarkeit, Instanz Auto-Skalierung und verschachtelte Stacks.
id: Layanan Orchestration menyediakan cara berbasis template untuk mendeskripsikan aplikasi cloud, lalu mengkoordinasikan menjalankan API OpenStack yang dibutuhkan untuk menjalankan aplikasi cloud. Template memungkinkan Anda membuat sebagian besar jenis sumber OpenStack, seperti instance, informasi jaringan, volume, grup keamanan, dan bahkan pengguna. Ini juga menyediakan fungsionalitas yang lebih maju, seperti ketersediaan tinggi instance, instance auto-scaling, dan tumpukan bersarang.
tr_tr: Orkestrasyon servisi bir bulut uygulamasını tanımlamak için şablon tabanlı bir yol sağlar, ardından bulut uygulamalarını çalıştırmak için ihtiyaç duyulan OpenStack API çağrılarının çalıştırılmasını düzenler. Şablonlar sunucular, ağ bilgisi, birimler, güvenlik grupları hatta kullanıcılar gibi çoğu OpenStack kaynak türlerini oluşturmanızı sağlarlar. Ayrıca sunucu yüksek kullanılırlığı, sunucu otomatik ölçekleme, iç içe yığınlar gibi daha gelişmiş işlevselliği de sağlar.

source: The Telemetry service is not deployed by default in every cloud. If the ceilometer commands do not work, this example does not work; ask your support team for assistance.
de: Der Telemetrieservice wird in jeder Cloud nicht standardmäßig bereitgestellt. Wenn die Ceilometer-Befehle nicht funktionieren, funktioniert dieses Beispiel nicht; fragen Sie Ihr Support-Team um Hilfe.
id: Layanan Telemetry tidak digunakan secara default di setiap awan. Jika perintah ceilometer tidak bekerja, contoh ini tidak bekerja; Mintalah bantuan tim pendukung Anda.
tr_tr: Telemetri servisi her bulutta öntanımlı olarak kurulu değildir. Ceilometer komutları çalışmazsa, bu örnek çalışmaz; destek takımınızdan yardım isteyebilirsiniz.

source: The Telemetry service uses meters to measure a given aspect of a resources usage. The meter that we are interested in is the :code:`cpu_util` meter.
de: Der Telemetrie-Service nutzt Meter, um einen bestimmten Aspekt eines Ressourcenverbrauchs zu messen. Der Zähler, an dem wir interessiert sind, ist der :code:`cpu_util` Meter.
id: Layanan Telemetry menggunakan meter untuk mengukur aspek tertentu dari penggunaan sumber daya. Meteran yang kami minati adalah :code:`cpu_util` meter.
tr_tr: Telemetri servisi bir kaynağın kullanım oranını ölçmek için ölçüler kullanır. Bizim ilgilendiğimiz ölçü :code:`cpu_util` ölçüsüdür.

source: The `RabbitMQ getting started tutorial <https://www.rabbitmq.com/getstarted.html>`_ provides a great introduction to message queues.
de: Das 'RabbitMQ Start Tutorial <https://www.rabbitmq.com/getstarted.html> `_ bietet eine gute Einführung in die Nachrichtenwarteschlangen.
id: The `RabbitMQ getting started tutorial <https://www.rabbitmq.com/getstarted.html>`_ memberikan pengenalan yang bagus untuk pesan antrian.
tr_tr: `RabbitMQ ile başlama öğreticisi <https://www.rabbitmq.com/getstarted.html>`_ ileti kuyruklarına çok güzel bir giriş sağlar.

source: The `generated_by` field shows the worker that created the fractal. Because multiple worker instances share the work, fractals are generated more quickly and users might not even notice when a worker fails.
de: Das Feld `generated_by` zeigt den Worker, der das Fraktal erstellt hat. Weil mehrere Workerinstanzen die Arbeit teilen, werden Fraktale schneller erzeugt und Benutzer können nicht einmal bemerken, wenn ein Arbeiter ausfällt.
id: Field `generated_by` menunjukkan pekerja yang menciptakan fraktal. Karena beberapa instance pekerja berbagi pekerjaan, fraktal dihasilkan lebih cepat dan pengguna mungkin tidak menyadarinya saat pekerja gagal.
tr_tr: `generated_by` alanı fraktalı üreten işçiyi gösterir. Birden çok işçi sunucu işi paylaştığından, fraktallar daha hızlı üretilir ve bir işçi başarısız olduğunda kullanıcı bunu anlamayabilir bile.

source: The `hello_faafo <https://git.openstack.org/cgit/openstack/api-site/plain/firstapp/samples/heat/hello_faafo.yaml>`_ Hot template demonstrates how to create a compute instance that builds and runs the Fractal application as an all-in-one installation.
de: Das `hallo_faafo <https://git.openstack.org/cgit/openstack/api-site/plain/firstapp/samples/heat/hello_faafo.yaml> `_ Hot Vorlage veranschaulicht, wie eine Compute-Instanz erstellt wird, die die Fractal-Anwendung als All-in-One-Installation erstellt und ausführt.
tr_tr: `hello_faafo <https://git.openstack.org/cgit/openstack/api-site/plain/firstapp/samples/heat/hello_faafo.yaml>`_ Hot şablonu Fraktal uygulamasını hepsi bir arada bir kurulumla inşa edip çalıştıracak bir hesaplama sunucusunun nasıl oluşturulacağını gösterir.

source: The `outputs` property shows the URL through which you can access the Fractal application. You can SSH into the instance.
de: Die Eigenschaft `output` zeigt die URL an, über die Sie auf die Fractal-Anwendung zugreifen können. Du kannst SSH in die Instanz bringen.
id: Properti `outputs` menunjukkan URL tempat Anda dapat mengakses aplikasi Fractal. Anda bisa SSH ke instance.
tr_tr: `Outputs` özelliği Fraktal uygulamasına erişebileceğiniz URL'yi gösterir. Sunucuya SSH çekebilirsiniz.

source: The actual auth URL is:
de: Die aktuelle Auth-URL lautet:
id: URL auth sebenarnya adalah:
tr_tr: Asıl yetkilendirme URL'si:

source: The alarms have the form:
de: Die Alarme haben die Form:
id: Alarm memiliki bentuk:
tr_tr: Uyarılar şu biçime sahiptir:

source: The application stores the generated fractal images directly in the database used by the API service instance. Storing image files in a database is not good practice. We are doing it here as an example only as an easy way to enable multiple instances to have access to the data. For best practice, we recommend storing objects in Object Storage, which is covered in :doc:`durability`.
de: Die Anwendung speichert die erzeugten Fraktalbilder direkt in der Datenbank, die von der API-Dienstinstanz verwendet wird. Das Speichern von Bilddateien in einer Datenbank ist nicht gut. Wir machen es hier als Beispiel nur als eine einfache Möglichkeit, mehreren Instanzen zu ermöglichen, Zugriff auf die Daten zu haben. Für die bewährte Praxis empfehlen wir die Speicherung von Objekten in Object Storage, die in :doc:`durability` abgedeckt ist.
id: Aplikasi menyimpan image fraktal yang dihasilkan secara langsung di database yang digunakan oleh instance layanan API. Penyimpanan file image dalam database bukanlah praktik yang baik. Kami melakukannya di sini sebagai contoh hanya sebagai cara mudah untuk mengaktifkan beberapa instance agar memiliki akses ke data. Untuk praktik terbaik, kami merekomendasikan menyimpan objek di Object Storage, yang tercakup dalam :doc:`durability`.
tr_tr: Uygulama üretilen fraktal imajlarını doğrudan API servisi sunucusu tarafından kullanılan veritabanında saklar. İmaj dosyalarını bir veritabanında tutmak iyi fikir değildir. Burda yalnızca birden çok sunucunun veriye kolay erişimi olması için örnek olarak kullandık. En iyisi nesneleri :doc:`durability` kısmında kapsandığı gibi Nesne Depolamada tutmaktır.

source: The auto-scaling stack sets up an API instance, a services instance, and an auto-scaling group with a single worker instance. It also sets up ceilometer alarms that add worker instances to the auto-scaling group when it is under load, and removes instances when the group is idling. To do this, the alarms post to URLs.
de: Der Auto-Skalierungsstapel richtet eine API-Instanz, eine Dienstinstanz und eine Auto-Skalierungsgruppe mit einer einzelnen Worker-Instanz ein. Es setzt auch Ceilometer-Alarme ein, die Worker-Instanzen der Auto-Skalierungsgruppe hinzufügen, wenn sie unter Last ist, und entfernt Instanzen, wenn die Gruppe im Leerlauf ist. Um dies zu tun, die Alarme Posten zu URLs.
id: Stack penskalaan otomatis membentuk instance API, instance layanan, dan grup skala otomatis dengan instance pekerja tunggal. Ini juga memasang alarm ceilometer yang menambahkan instance pekerja ke grup skala otomatis saat berada di bawah beban, dan menghapus instance saat grup sedang menganggur. Untuk melakukan ini, pos alarm ke URL.
tr_tr: Otomatik ölçeklenen yığın bir API sunucusu, bir servisler sunucusu, ve tek bir işçiye sahip bir otomatik ölçekleme grubu ayarlar. Ayrıca yük altında olduğunda otomatik ölçekleme grubuna işçi sunucular ekleyen ve grup boştayken sunucuları kaldıran ceilometer uyarıları ayarlar. Bunu yapmak için uyarılar URL'lere istek yapar.

source: The client object accesses the Compute v2.0 service and type v2.1, so that version is in this tutorial.
de: Das Clientobjekt greift auf den Compute v2.0-Dienst und Typ v2.1 zu, sodass diese Version in diesem Tutorial verwendet wird.
id: Objek klien mengakses layanan Compute v2.0 dan ketik v2.1, sehingga versinya ada dalam tutorial ini.
tr_tr: İstemci nesnesi Hesaplama v2.0 servisi ve tür v2.1'e erişir, bu yüzden öğreticide bu sürüm kullanılmıştır.

source: The connection URL for the database (not used here).
de: Die Verbindungs-URL für die Datenbank (hier nicht verwendet).
id: URL koneksi untuk database (tidak digunakan disini).
tr_tr: Veritabanı için bağlantı URL'si (burada kullanılmadı).

source: The endpoint URL of the API service.
de: Die Endpunkt-URL des API-Dienstes.
id: URL endpoint dari layanan API.
tr_tr: API servisinin uç nokta URL'si.

source: The example code uses the awesome `Requests library <http://docs.python-requests.org/en/latest/>`_. Before you try to run the previous script, make sure that it is installed on your system.
de: Der Beispielcode verwendet die wunderbare `Requests library <http://docs.python-requests.org/en/latest/> `_. Bevor Sie versuchen, das vorherige Skript auszuführen, stellen Sie sicher, dass es auf Ihrem System installiert ist.
id: Kode contoh menggunakan yang mengagumkan `Requests library <http://docs.python-requests.org/en/latest/>`_. Sebelum Anda mencoba menjalankan skrip sebelumnya, pastikan itu terinstal di sistem Anda.
tr_tr: Örnek kod harika `Requests kitaplığını <http://docs.python-requests.org/en/latest/>`_ kullanır. Önceki betiği çalıştırmaya çalışmadan önce sisteminize kurulu olduğundan emin olun.

source: The example template depends on the ceilometer project, which is part of the `Telemetry service <https://wiki.openstack.org/wiki/Telemetry>`_.
de: Die Beispielvorlage hängt vom Ceilometer-Projekt ab, das Teil des Telemetrieservice ist <https://wiki.openstack.org/wiki/Telemetry> `_.
id: Contoh template tergantung pada proyek ceilometer, yang merupakan bagian dari `Telemetry service <https://wiki.openstack.org/wiki/Telemetry>`_.
tr_tr: Örnek şablon `Telemetri servisinin <https://wiki.openstack.org/wiki/Telemetry>`_ parçası olan ceilometer projesine bağımlıdır.

source: The first step is to start the controller instance. The instance has the API service, the database, and the messaging service, as you can see from the parameters passed to the installation script.
de: Der erste Schritt ist, die Controller-Instanz zu starten. Die Instanz verfügt über den API-Dienst, die Datenbank und den Messaging-Dienst, wie Sie aus den an das Installationsskript übergebenen Parametern sehen können.
id: Langkah pertama adalah memulai instance controller. Instance memiliki layanan API, database, dan layanan pesan, seperti yang dapat Anda lihat dari parameter yang dikirimkan ke skrip instalasi.
tr_tr: İlk adım kontrol sunucusunu başlatmaktır. Kurulum betiğine geçirilen parametrelerden görebileceğiniz gibi sunucunun API servisi, veritabanı ve ileti servisi bulunur.

source: The flavor
de: Die Variante
id: Flavor
tr_tr: Nitelik

source: The following file contains all of the code from this section of the tutorial. This comprehensive code sample lets you view and run the code as a single file.
de: Die folgende Datei enthält den gesamten Code aus diesem Abschnitt des Tutorials. Mit diesem umfassenden Code-Beispiel können Sie den Code als einzelne Datei anzeigen und ausführen.
id: File berikut berisi semua kode dari bagian tutorial ini. Sampel kode komprehensif ini memungkinkan Anda melihat dan menjalankan kode sebagai satu file.
tr_tr: Aşağıdaki dosya öğreticinin bu kısmındaki tüm kodu içerir. Bu kapsamlı kod örneği kodu tek bir dosya olarak görüntülemenizi ve çalıştırmanızı sağlar.

source: The following file contains all of the code from this section of the tutorial. This comprehensive code sample lets you view and run the code as a single script.
de: Die folgende Datei enthält den gesamten Code aus diesem Abschnitt des Tutorials. Mit diesem umfassenden Code-Beispiel können Sie den Code als einzelnes Skript anzeigen und ausführen.
id: File berikut berisi semua kode dari bagian tutorial ini. Sampel kode komprehensif ini memungkinkan Anda melihat dan menjalankan kode sebagai satu skrip.
tr_tr: Aşağıdaki dosya öğreticinin bu kısmındaki tüm kodu içerir. Bu kapsayıcı kod örneği kodu tek bir betik olarak görüntüleme ve çalıştırma şansı verir.

source: The following instance creation example assumes that you have a single-tenant network. If you receive the 'Exception: 400 Bad Request Multiple possible networks found, use a Network ID to be more specific' error, you have multiple-tenant networks. You must add a `networks` parameter to the call that creates the server. See :doc:`/appendix` for details.
de: Das folgende Beispiel-Erstellungsbeispiel geht davon aus, dass Sie ein Ein-Tenant-Netzwerk haben. Wenn Sie die 'Exception: 400 Bad Request Multiple possible networks found, use a Network ID to be more specific' Fehlermeldung bekommen, haben Sie mehrere Tenant-Netzwerke. Sie müssen dem Aufruf, der den Server erstellt, einen 'Netzwerk' -Parameter hinzufügen. Siehe :doc: `/appendix` für Details.
id: Contoh pembuatan instance berikut mengasumsikan bahwa Anda memiliki jaringan single-tenant. Jika Anda menerima kesalahan'Exception: 400 Bad Request Multiple possible networks found, use a Network ID to be more specific', Anda memiliki beberapa jaringan multiple-tenant. Anda harus menambahkan parameter `networks` ke panggilan yang membuat server. Lihat :doc:`/appendix` untuk rinciannya.
tr_tr: Aşağıdaki sunucu oluşturma örneği tek kiracılı bir ağa sahip olduğunuzu varsayar. 'İstisna: 400 Kötü İstek Birden fazla muhtemel ağ bulundu, daha belirleyici olmak için bir Ağ Kimliği kullanın' hatası alırsanız birden fazla kiracılı ağınız var demektir. Sunucuyu oluşturan çağrıya bir `networks` parametresi eklemeniz gerekir. Ayrıntılar için bkz :doc:`/appendix`.

source: The following operations are destructive and result in data loss.
de: Die folgenden Operationen sind zerstörerisch und führen zu Datenverlust.
id: Operasi berikut merusak dan mengakibatkan kehilangan data.
tr_tr: Aşağıdaki işlemler yıkıcıdır ve veri kaybına yol açarlar.

source: The fractal application we are building contains these types of network traffic:
de: Die Fraktalanwendung, die wir bauen, enthält diese Arten von Netzwerkverkehr:
id: Aplikasi fraktal yang kami bangun berisi jenis lalu lintas jaringan ini:
tr_tr: İnşa ettiğimiz fraktal uygulaması bu türlerde ağ trafiği içerir:

source: The fractals are now available from any of the app-api hosts. To verify, visit http://IP_API_1/fractal/FRACTAL_UUID and http://IP_API_2/fractal/FRACTAL_UUID. You now have multiple redundant web services. If one fails, you can use the others.
de: Die Fraktale sind jetzt bei jedem der app-api-Hosts erhältlich. Um zu überprüfen, besuchen Sie http://IP_API_1/fraktal/FRACTAL_UUID und http://IP_API_2/fraktal/FRACTAL_UUID. Sie haben jetzt mehrere redundante Web-Services. Wenn einer versagt, können Sie die anderen benutzen.
id: Fraktal sekarang tersedia dari host app-api manapun. Untuk memverifikasi, kunjungi http://IP_API_1/fractal/FRACTAL_UUID dan http://IP_API_2/fractal/FRACTAL_UUID. Anda sekarang memiliki banyak layanan web berlebihan. Jika gagal, Anda bisa menggunakan yang lain.
tr_tr: Fraktallar artık app-api sunucularının herhangi birinden kullanılabilirler. Bunu doğrulamak için, http://IP_API_1/fractal/FRACTAL_UUID ve http://IP_API_2/fractal/FRACTAL_UUID adreslerini ziyaret edin. Artık birden fazla yedekli web servisiniz var. Biri başarısız olursa diğerlerini kullanabilirsiniz.

source: The magic revisited
de: Die Magie entzaubert
id: Magic revisited
tr_tr: Sihire yeniden ziyaret

source: The message queue can take a while to notice that worker instances have died.
de: Die Nachrichtenwarteschlange kann eine Weile dauern, um zu bemerken, dass Worker-Instanzen gestorben sind.
id: Antrian pesan bisa memakan waktu lama untuk memperhatikan bahwa instance pekerja telah meninggal.
tr_tr: İleti kuyruğunun işçi sunucuların öldüğünü görmesi biraz daha zaman alabilir.
