Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: This gets an IP address that you can assign to your instance:
de: Dies bekommt eine IP-Adresse, die Sie Ihrer Instanz zuordnen können:
id: Ini mendapatkan alamat IP yang dapat Anda tetapkan untuk instance Anda:
tr_tr: Bu sunucunuza atayabileceğiniz bir IP adresi alır:

source: This guide is for experienced software developers who want to deploy applications to OpenStack clouds.
de: Dieser Leitfaden ist für erfahrene Softwareentwickler, die Anwendungen auf OpenStack-Clouds einsetzen möchten.
id: Panduan ini untuk pengembang perangkat lunak berpengalaman yang ingin mengerahkan aplikasi ke awan OpenStack.
tr_tr: Bu kılavuz OpenStack bulutlarında uygulama kurmak isteyen deneyimli yazılım geliştiricileri içindir.

source: This is a `useful pattern <https://msdn.microsoft.com/en-us/library/dn568101.aspx>`_ for many cloud applications that have long lists of requests coming in and a pool of resources from which to service them. This also means that a worker may crash and the tasks will be processed by other workers.
de: Dies ist ein 'nützliches Muster' <https://msdn.microsoft.com/en-us/library/dn568101.aspx> `_ für viele Cloud-Anwendungen, die lange Listen von Anfragen bekommen und ein Pool von Ressourcen, von denen sie zu bedienen haben. Dies bedeutet auch, dass ein Arbeiter abstürzen kann und die Aufgaben von anderen Workern verarbeitet werden.
id: Ini adalah sebuah `useful pattern <https://msdn.microsoft.com/en-us/library/dn568101.aspx>`_ untuk banyak aplikasi awan yang memiliki daftar panjang permintaan masuk dan kumpulan sumber daya untuk melayani mereka. Ini juga berarti bahwa seorang pekerja mungkin mogok dan tugas akan diproses oleh pekerja lain.
tr_tr: Gelen uzun istek listelerine ve bir kaynak havuzuna sahip çoğu bulut uygulamalarında bu `kullanışlı bir kalıptır <https://msdn.microsoft.com/en-us/library/dn568101.aspx>`_. Bu ayrıca bir işçi bozulduğunda görevlerin diğer işçilerce işleneceği anlamına gelir.

source: This option also uses a bit stream to upload the file, iterating bit by bit over the file and passing those bits to Object Storage as they come. Compared to loading the entire file in memory and then sending it, this method is more efficient, especially for larger files.
de: Diese Option verwendet auch einen Bit-Stream zum Hochladen der Datei, Iteration von Bit für Bit über die Datei und übergeben diese Bits an Object Storage, wie sie kommen. Im Vergleich zum Laden der gesamten Datei im Speicher und dann senden ist diese Methode effizienter, vor allem für größere Dateien.
id: Opsi ini juga menggunakan sedikit aliran untuk meng-upload file, iterasi sedikit demi sedikit di atas file dan melewati bit by bit tersebut ke Object Storage saat mereka datang. Dibandingkan dengan memuat keseluruhan file dalam memori dan kemudian mengirimkannya, metode ini lebih efisien, terutama untuk file yang lebih besar.
tr_tr: Bu seçenek de bit akışı kullanarak dosya yükler, dosya üzerinde bit bit ilerleyerek ve bu bitleri geldikçe Nesne Depolamaya geçirerek. Tüm dosyayı belleğe yükleyip ardından göndermeyle karşılaştırdığınızda bu yöntem daha etkindir, özellikle daha büyük dosyalar için.

source: This process was obviously a very manual one. Figuring out that we needed more workers and then starting new ones required some effort. Ideally the system would do this itself. If you build your application to detect these situations, you can have it automatically request and remove resources, which saves you the effort of doing this work yourself. Instead, the OpenStack Orchestration service can monitor load and start instances, as appropriate. To find out how to set that up, see :doc:`orchestration`.
de: Dieser Vorgang war offensichtlich ein sehr manueller. Herauszufinden, dass wir mehr Worker brauchten und diese dann zu starten, bedarf einiger Anstrengungen. Idealerweise würde das System das selbst tun. Wenn Sie Ihre Anwendung aufbauen, um diese Situationen zu erkennen, können Sie sie automatisch Ressourcen anfordern und entfernen, was Ihnen Mühe macht ist, diese Arbeit selbst zu tun. Stattdessen kann der OpenStack Orchestrierungsdienst die Last überwachen und Instanzen starten. Um herauszufinden, wie man das einrichtet, siehe :doc:`orchestration`.
id: Proses ini jelas sangat manual. Mencari tahu bahwa kami membutuhkan lebih banyak pekerja dan kemudian memulai pekerjaan baru membutuhkan beberapa usaha. Idealnya sistem akan melakukan ini sendiri. Jika Anda membangun aplikasi Anda untuk mendeteksi situasi ini, Anda dapat memilikinya secara otomatis meminta dan menghapus sumber daya, yang menghemat usaha melakukan pekerjaan ini sendiri. Sebagai gantinya, layanan OpenStack Orchestration dapat memantau beban dan menghidupkan instance, jika sesuai. Untuk mengetahui cara mengaturnya, lihat :doc:`orchestration`.
tr_tr: Bu süreç bariz şekilde elle yapılıyordu. Daha fazla işçiye ihtiyacımız olduğunu anlamak ve yenilerini başlatmak biraz uğraştırdı. İdeal olarak sistem bunu kendi yapar. Uygulamanızı bu gibi durumları algılayacak şekilde inşa ederseniz, otomatik olarak kaynakları istemesini ve kaldırmasını sağlayabilirsiniz, bu da bu işi kendi başınıza yaptığınızda çıkan iş yükünü yok eder. Bunun yerine, OpenStack Orkestrasyon servisi yükü izleyerek uygun şekilde sunucuları başlatabilir. Bunun nasıl ayarlanacağını bulmak için, bkz :doc:`orchestration`.

source: This section assumes that your cloud provider has implemented the OpenStack Networking API (neutron). Users of clouds which have implemented legacy networking (nova-network) will have access to networking via the Compute API. Log in to the Horizon dashboard and navigate to :guilabel:`Project->Access & Security->API Access`. If you see a service endpoint for the Network API, your cloud is most likely running the Networking API. If you are still in doubt, ask your cloud provider for more information.
de: In diesem Abschnitt wird davon ausgegangen, dass Ihr Cloud-Provider die OpenStack Networking API (Neutron) implementiert hat. Benutzer von Clouds, die Legacy Networking (nova-network) implementiert haben, haben Zugriff auf die Vernetzung über die Compute API. Melden Sie sich im Horizon-Dashboard an und navigieren Sie zu :guilabel:`Project->Access % Security->API Access`. Wenn Sie einen Service-Endpunkt für die Netzwerk-API sehen, ist Ihre Cloud wahrscheinlich die Netzwerk-API. Wenn Sie noch im Zweifel sind, fragen Sie Ihren Cloud-Anbieter nach weiteren Informationen.
id: Bagian ini mengasumsikan bahwa penyedia awan Anda telah menerapkan OpenStack Networking API (neutron). Pengguna awan yang telah menerapkan jaringan legacy (lawas) (nova-network) akan memiliki akses ke jaringan melalui Compute API. Masuk ke dashboard Horizon dan arahkan ke: guilabel: `Project-> Access & Security-> API Access`. Jika Anda melihat titik akhir layanan untuk API Jaringan, awan Anda kemungkinan besar menjalankan API Jaringan. Jika Anda masih ragu, mintalah informasi tentang penyedia awan Anda.
tr_tr: Bu kısım bulut sağlayıcınızın OpenStack Ağ API'sini (neutron) uyguladığını varsayar. Geleneksel ağı (nova-network) uygulayan bulutların kullanıcıları ağa Hesaplama API'si aracılığıyla erişebileceklerdir. Horizon kontrol panosuna giriş yapın ve :guilabel:`Proje->Erişim & Güvenlik->API Erişimi`ne gidin. Ağ API'si için bir servis uç noktası görürseniz bulutunuz muhtemelen Ağ API'sini çalıştırıyordur. Hala şüpheliyseniz daha fazla bilgi için bulut sağlayıcınızla görüşün.

source: This section continues to illustrate the separation of services onto multiple instances and highlights some of the choices that we have made that facilitate scalability in the application architecture.
de: Dieser Abschnitt veranschaulicht weiterhin die Trennung von Diensten auf mehrere Instanzen und hebt einige der Entscheidungen hervor, die wir gemacht haben, die Skalierbarkeit in der Anwendungsarchitektur erleichtern.
id: Bagian ini terus menggambarkan pemisahan layanan ke beberapa instance dan menyoroti beberapa pilihan yang telah kita buat yang memfasilitasi skalabilitas dalam arsitektur aplikasi.
tr_tr: Bu kısım servislerin birden çok sunucuya ayrımını açıklamaya devam eder ve uygulama mimarisinde ölçeklemeyi kolaylaştıran bazı seçimlerimizi vurgular.

source: This section explores options for expanding the sample application.
de: In diesem Abschnitt werden Optionen für die Erweiterung der Beispielanwendung untersucht.
id: Bagian ini membahas opsi untuk memperluas aplikasi sampel.
tr_tr: Bu kısım örnek uygulamayı genişletmek için seçenekleri araştırır.

source: This section has not yet been completed for the .NET SDK
de: Dieser Abschnitt ist noch nicht für das .NET SDK abgeschlossen
id: Bagian ini belum selesai untuk .NET SDK
tr_tr: Bu kısım .NET SDK için henüz tamamlanmadı

source: This section has not yet been completed for the .NET SDK.
de: Dieser Abschnitt ist noch nicht für das .NET SDK abgeschlossen.
id: Bagian ini belum selesai untuk .NET SDK.
tr_tr: Bu kısım .NET SDK için henüz tamamlanmadı.

source: This section has not yet been completed for the OpenStack SDK.
de: Dieser Abschnitt ist noch nicht für das OpenStack SDK abgeschlossen.
id: Bagian ini belum selesai untuk OpenStack SDK.
tr_tr: Bu kısım OpenStack SDK için henüz tamamlanmadı.

source: This section has not yet been completed for the PHP-OpenCloud SDK.
de: Dieser Abschnitt ist noch nicht für das PHP-OpenCloud SDK abgeschlossen.
id: Bagian ini belum selesai untuk PHP-OpenCloud SDK.
tr_tr: Bu kısım PHP-OpenCloud SDK için henüz tamamlanmadı.

source: This section has not yet been completed for the fog SDK.
de: Dieser Abschnitt ist noch nicht für das Nebel-SDK abgeschlossen.
id: Bagian ini belum selesai untuk fog SDK.
tr_tr: Bu kısım fog SDK için henüz tamamlanmadı.

source: This section has not yet been completed for the pkgcloud SDK.
de: Dieser Abschnitt ist noch nicht für das pkgcloud SDK abgeschlossen.
id: Bagian ini belum selesai untuk pkgcloud SDK.
tr_tr: Bu kısım pkgcloud SDK için henüz tamamlanmadı.

source: This section introduces block storage, also known as volume storage, which provides access to persistent storage devices. You interact with block storage by attaching volumes to running instances just as you might attach a USB drive to a physical server. You can detach volumes from one instance and reattach them to another instance and the data remains intact. The OpenStack Block Storage (cinder) project implements block storage.
de: In diesem Abschnitt wird ein Blockspeicher eingeführt, der auch als Volume-Speicher bezeichnet wird und den Zugriff auf persistente Speichergeräte ermöglicht. Sie interagieren mit Blockspeicher, indem Sie Volumes an laufende Instanzen anhängen, so wie Sie ein USB-Laufwerk an einen physischen Server anschließen können. Sie können Volumes von einer Instanz trennen und sie wieder an eine andere Instanz anschließen und die Daten bleiben intakt. Das OpenStack Block Storage (Cinder)-Projekt implementiert Blockspeicher.
id: Bagian ini memperkenalkan penyimpanan blok, juga dikenal sebagai penyimpanan volume, yang menyediakan akses ke perangkat penyimpanan persisten. Anda berinteraksi dengan penyimpanan blok dengan menyematkan volume untuk menjalankan instance seperti Anda mungkin memasang drive USB ke server fisik. Anda dapat melepaskan volume dari satu instance dan memasangnya kembali ke instance lain dan datanya tetap utuh. Proyek OpenStack Block Storage (cinder) menerapkan penyimpanan blok.
tr_tr: Bu kısım kalıcı depolama aygıtlarına erişim sağlayan, birim depolama olarak da bilinen blok depolamayı tanıtır. Blok depolamayla çalışan sunuculara birimler ekleyerek tıpkı fiziksel bir sunucuya USB aygıt takıyor gibi etkileşirsiniz. Bir sunucudan birimleri ayırabilir ve başka bir sunucuya veriyi koruyacak şekilde tekrar ekleyebilirsiniz. OpenStack Blok Depolama (cinder) projesi blok depolamayı uygular.

source: This section introduces object storage.
de: In diesem Abschnitt wird der Objektspeicher eingeführt.
id: Bagian ini memperkenalkan penyimpanan objek.
tr_tr: Bu kısım nesne deoplamayı tanıtır.

source: This section introduces some operational concepts and tasks to developers who have not written cloud applications before.
de: In diesem Abschnitt werden den Entwicklern, die noch keine Cloud-Anwendungen geschrieben haben, einige operative Konzepte und Aufgaben vorgestellt.
id: Bagian ini memperkenalkan beberapa konsep dan tugas operasional kepada pengembang yang belum pernah menulis aplikasi cloud sebelumnya.
tr_tr: Bu kısım daha önce bulut uygulamaları yazmamış geliştiriciler için bazı işlemsel kavramlar ve görevlere giriş yapar.

source: This section introduces the `HOT templating language <https://docs.openstack.org/heat/latest/template_guide/hot_guide.html>`_, and takes you through some common OpenStack Orchestration calls.
de: In diesem Abschnitt wird die 'HOT Templating Language' vorgestellt <https://docs.openstack.org/heat/latest/template_guide/hot_guide.html> `_, und führt Sie durch einige gemeinsame OpenStack Orchestrierung Anrufe.
id: Bagian ini memperkenalkan `HOT templating language <https://docs.openstack.org/heat/latest/template_guide/hot_guide.html>`_, dan membawa Anda melalui beberapa panggilan OpenStack Orchestration yang umum.

source: This section introduces the application architecture and explains how it was designed to take advantage of cloud features in general and OpenStack in particular. It also describes some commands in the previous section.
de: Dieser Abschnitt stellt die Anwendungsarchitektur vor und erklärt, wie es entworfen wurde, um die Vorteile von Cloud-Features im Allgemeinen und OpenStack insbesondere zu nutzen. Es beschreibt auch einige Befehle im vorherigen Abschnitt.
id: Bagian ini memperkenalkan arsitektur aplikasi dan menjelaskan bagaimana hal itu dirancang untuk memanfaatkan fitur awan secara umum dan OpenStack pada khususnya. Ini juga menjelaskan beberapa perintah di bagian sebelumnya.
tr_tr: Bu kısım uygulama mimarisini tanıtır ve genel olarak bulut özelliklerinden ve özel olarak OpenStack'den faydalanmak için nasıl tasarlandığını açıklar. Ayrıca önceki kısımdaki bazı komutları tanımlar.

source: This section is based on the Neutron LBaaS API version 1.0 https://docs.openstack.org/admin-guide/networking_adv-features.html#basic-load-balancer-as-a-service-operations
de: Dieser Abschnitt basiert auf der Neutron LBaaS API Version 1.0 https://docs.openstack.org/admin-guide/networking_adv-features.html#basic-load-balancer-as-a-service-operations
id: Bagian ini didasarkan pada Neutron LBaaS API version 1.0 https://docs.openstack.org/admin-guide/networking_adv-features.html#basic-load-balancer-as-a-service-operations
tr_tr: Bu kısım Neutron LBaaS API sürüm 1.0 tabanlıdır https://docs.openstack.org/admin-guide/networking_adv-features.html#basic-load-balancer-as-a-service-operations

source: This section is incomplete. Please help us finish it!
de: Dieser Abschnitt ist unvollständig. Bitte helfen Sie uns, ihn zu beenden!
id: Bagian ini tidak lengkap. Tolong bantu kami menyelesaikannya
tr_tr: Bu kısım bitirilmemiş. Lütfen bitirmemizde yardımcı olun!

source: This tutorial shows two applications. The first application is a simple fractal generator that uses mathematical equations to generate beautiful `fractal images <http://en.wikipedia.org/wiki/Fractal>`_. We show you this application in its entirety so that you can compare it to a second, more robust, application.
de: Dieses Tutorial zeigt zwei Anwendungen. Die erste Anwendung ist ein einfacher Fraktalgenerator, der mathematische Gleichungen verwendet, um schöne `Fraktalbilder zu erzeugen <http://en.wikipedia.org/wiki/Fractal> `_. Wir zeigen Ihnen diese Anwendung in ihrer Gesamtheit, damit Sie sie mit einer zweiten, robusteren Anwendung vergleichen können.
id: Tutorial ini menunjukkan dua aplikasi. Aplikasi pertama adalah generator fraktal sederhana yang menggunakan persamaan matematis untuk menghasilkan keindahan `fractal images <http://en.wikipedia.org/wiki/Fractal>`_. Kami menunjukkan aplikasi ini secara keseluruhan sehingga Anda bisa membandingkannya dengan aplikasi kedua yang lebih kuat.
tr_tr: Bu öğretici iki uygulama gösterir. İlk uygulama matematiksel eşitlikler kullanarak güzel `fraktal imajlar <http://en.wikipedia.org/wiki/Fractal>`_ üreten bir fraktal üreticidir. Göstereceğimiz ikinci, daha sağlam uygulamayla karşılaştırabilmeniz için bu uygulamayı tamamıyla gösteriyoruz.

source: Though you might have configured Object Storage to store images, the Fractal application needs a database to track the location of, and parameters that were used to create, images in Object Storage. This database server cannot fail.
de: Obwohl Sie Objektspeicher zum Speichern von Bildern konfiguriert haben, benötigt die Fractal-Anwendung eine Datenbank, um den Speicherort und die Parameter, die zum Erstellen von Bildern in Objektspeicher verwendet wurden, zu verfolgen. Dieser Datenbankserver kann nicht kaputtgehen.
id: Meskipun Anda mungkin telah mengkonfigurasi Object Storage untuk menyimpan image, aplikasi Fractal memerlukan database untuk melacak lokasi, dan parameter yang digunakan untuk membuat, image di Object Storage. Server database ini tidak bisa gagal.
tr_tr: İmajları depolamak için Nesne Depolama yapılandırmış olsanız da, Fraktal uygulaması Nesne Depolamada imaj oluşturmak için kullanılan parametreleri ve konumlarını takip etmek için bir veritabanına ihtiyaç duyar. Bu veritabanı sunucusu başarısız olmamalıdır.

source: To begin to store objects, we must first make a container. Call yours :code:`fractals`:
de: Um Objekte zu speichern, müssen wir zuerst einen Container bauen. Rufen sie auf :code: `fractals`:
id: Untuk mulai menyimpan objek, pertama kita harus membuat kontainer. Teleponmu :code:`fractals`:
tr_tr: Nesneleri depolamaya başlamak için, önce bir kapsayıcı yapmalıyız. :code:`fraktallar` ismini verebilirsiniz:

source: To better understand how the template works, use this guide to install the 'ceilometer' command-line client:
de: Um zu verstehen, wie die Vorlage funktioniert, verwenden Sie diese Anleitung, um den 'ceilometer' Befehlszeilen-Client zu installieren:
id: Untuk lebih memahami bagaimana template bekerja, gunakan panduan ini untuk menginstal 'ceilometer' command-line client:
tr_tr: Şablonun nasıl çalıştığını daha iyi anlamak için, 'ceilometer' komut satırı istemcisini kurmak için bu kılavuzu kullanın:

source: To configure shade using a profile, use your credentials above to specify the cloud provider name, username, password, project name, and region name in the file :file:`~/.config/openstack/clouds.yml`.
de: Um shade mit einem Profil zu konfigurieren, verwenden Sie Ihre Anmeldeinformationen oben, um den Namen des Cloud-Providers, den Benutzernamen, das Kennwort, den Projektnamen und den Namen der Region in der Datei anzugeben: file: `~/.config/openstack/clouds.yml`.
id: Untuk mengkonfigurasi shade (naungan) menggunakan profil, gunakan kredensial Anda di atas untuk menentukan nama provider awan, nama pengguna, kata sandi, nama proyek, dan nama wilayah dalam file :file:`~/.config/openstack/clouds.yml`.
tr_tr: Shade'i bir profil kullanarak yapılandırmak için, :file:`~/.config/openstack/clouds.yml` dosyasında bulut sağlayıcı ismi, kullanıcı adı, parola, proje ismi ve bölge ismini belirtmek için kimlik bilgilerinizi kullanın.

source: To create a floating IP address to use with your instance:
de: So erstellen Sie eine Floating-IP-Adresse, die Sie mit Ihrer Instanz verwenden können:
id: Untuk membuat alamat IP mengambang untuk digunakan dengan instance Anda:
tr_tr: Sunucunuzla kullanmak üzere bir değişken IP adresi oluşturmak için:

source: To delete a container, you must first remove all objects from the container. Otherwise, the delete operation fails:
de: Um einen Container zu löschen, müssen Sie zuerst alle Objekte aus dem Container entfernen. Andernfalls schlägt der Löschvorgang fehl:
id: Untuk menghapus sebuah kontainer, pertama-tama Anda harus menghapus semua objek dari kontainer. Jika tidak, operasi penghapusan akan gagal:
tr_tr: Bir kapsayıcıyı silmek için önce kapsayıcıdan tüm nesneleri çıkarmalısınız. Aksi halde silme işlemi başarısız olur:

source: To detach and delete a volume:
de: Um ein Volume abzulösen und zu löschen:
id: Untuk melepaskan dan menghapus volume:
tr_tr: Bir birimi ayırmak ve silmek için:

source: To determine whether a public IP address is assigned to your instance:
de: Um festzustellen, ob eine öffentliche IP-Adresse Ihrer Instanz zugewiesen ist:
id: Untuk menentukan apakah alamat IP publik diberikan pada instance Anda:
tr_tr: Sunucunuza bir açık IP adresinin atanıp atanmadığını anlamak için:

source: To increase the overall capacity, add three workers:
de: Um die Gesamtkapazität zu erhöhen, fügen Sie drei Worker hinzu:
id: Untuk meningkatkan kapasitas keseluruhan, tambahkan tiga pekerja:
tr_tr: Genel kapasiteyi artırmak için, üç işçi ekleyin:

source: To install the 'trove' command-line client, see `Install the OpenStack command-line clients <https://docs.openstack.org/cli-reference/common/cli_install_openstack_command_line_clients.html#install-the-clients>`_.
de: Um den Befehlszeilenclient 'trove' zu installieren, siehe `Installieren der OpenStack-Befehlszeilenclients <https://docs.openstack.org/cli-reference/common/cli_install_openstack_command_line_clients.html#install-the-clients> `_.
id: Untuk menginstal 'trove' command-line client, lihat `Install the OpenStack command-line clients <https://docs.openstack.org/cli-reference/common/cli_install_openstack_command_line_clients.html#install-the-clients>`_.
tr_tr: 'trove' komut satırı istemcisini kurmak için, `OpenStack komut satırı istemcilerinin kurulumuna <https://docs.openstack.org/cli-reference/common/cli_install_openstack_command_line_clients.html#install-the-clients>`_ göz atın.

source: To install the OpenStack .NET SDK, use the NeGet Package Manager that is included with Visual Studio and Xamarin Studio. You simply add a package named 'openstack.net' and the NeGet Package Manager automatically installs the necessary dependencies.
de: Um das OpenStack .NET SDK zu installieren, verwenden Sie den NeGet Package Manager, der in Visual Studio und Xamarin Studio enthalten ist. Sie fügen einfach ein Paket namens 'openstack.net' hinzu und der NeGet Package Manager installiert automatisch die notwendigen Abhängigkeiten.
id: Untuk menginstal OpenStack .NET SDK, gunakan NeGet Package Manager yang disertakan dengan Visual Studio dan Xamarin Studio. Anda cukup menambahkan sebuah paket bernama 'openstack.net' dan NeGet Package Manager secara otomatis menginstal dependensi yang diperlukan.
tr_tr: OpenStack .NET SDK'yı kurmak için Visual Studio ve Xamarin Studio ile birlikte gelen NeGet Paket Yöneticisini kullanın. Basitçe 'openstack.net' isimli bir paket eklersiniz ve NeGet Paket Yönetici gerekli bağımlılıkları otomatik olarak kurar.

source: To interact with the cloud, you must also have
de: Um mit der Cloud zu interagieren, müssen Sie aber auch haben
id: Untuk berinteraksi dengan awan, Anda juga harus memiliki
tr_tr: Bulutla iletişime geçmek için ayrıca şunlara sahip olmalısınız
