Repository: AsherBond/api-site
Catalog: firstapp/source/locale/*/LC_MESSAGES/firstapp.po
Languages: de, id, tr_tr

source: Anyone with a programming background can easily read the code in this guide. Although this guide focuses on a particular SDK, you can use other languages and toolkits with the OpenStack cloud:
de: Jeder mit einem Programmierhintergrund kann den Code in diesem Handbuch leicht lesen. Obwohl diese Anleitung auf ein bestimmtes SDK fokussiert ist, können Sie mit der OpenStack Cloud andere Sprachen und Toolkits verwenden:
id: Siapapun dengan latar belakang pemrograman dapat dengan mudah membaca kode dalam panduan ini. Meskipun panduan ini berfokus pada SDK tertentu, Anda dapat menggunakan bahasa dan toolkit lain dengan awan OpenStack:
tr_tr: Programlama geçmişine sahip herkes bu kılavuzdaki kodu kolaylıkla okuyabilir. Bu kılavuz belirli bir SDK'ya odaklansa da, diğer dilleri ve araç takımlarını OpenStack bulutuyla kullanabilirsiniz:

source: Appendix
de: Anhang
tr_tr: Ek

source: Application deployment
de: Anwendungsbereitstellung
id: Penerapan aplikasi
tr_tr: Uygulama geliştirme

source: Application developers and operators who use phoenix servers have access to systems that are built from a known baseline, such as a specific operating system version, and to tooling that automatically builds, installs, and configures a system.
de: Anwendungsentwickler und Betreiber, die Phoenix-Server verwenden, haben Zugriff auf Systeme, die aus einer bekannten Baseline aufgebaut werden, wie z. B. einer bestimmten Betriebssystemversion und einem Tool, das ein System automatisch aufbaut, installiert und konfiguriert.
id: Pengembang aplikasi dan operator yang menggunakan server phoenix memiliki akses ke sistem yang dibangun dari dasar yang diketahui, seperti versi sistem operasi tertentu, dan menggunakan alat yang secara otomatis membangun, memasang, dan mengonfigurasi sistem.
tr_tr: Phoenix sunucularını kullanan uygulama geliştiriciler ve işleticiler belirli bir işletim sistemi sürümü, ve bir sistemi otomatik inşa eden, yükleyen ve yapılandıran bir araca sahip bilinen bir tabandan inşa edilen sistemlere erişirler.

source: Architect your application to make use of additional resources.
de: Re-Architekt Ihrer Applikation, um zusätzliche Ressourcen zu nutzen.
id: Arsitek aplikasi Anda untuk memanfaatkan sumber daya tambahan.
tr_tr: Uygulamanızı ek kaynakların kullanımından faydalanacak şekilde tasarlamalısınız.

source: Armed with a security group, image, and flavor size, you can add multiple API services:
de: Bewaffnet mit einer Sicherheitsgruppe, Abbild und Varianten-Größe, können Sie mehrere API-Dienste hinzufügen:
id: Berbekal security group, image, dan flavor size, Anda dapat menambahkan beberapa layanan API:
tr_tr: Bir güvenlik grubu, imaj ve nitelik boyutuyla birden çok API servisi ekleyebilirsiniz:

source: As before, pass in configuration settings as parameters.
de: Wie vorher, passieren Sie die Konfigurationseinstellungen als Parameter.
id: Seperti sebelumnya, masuk dalam pengaturan konfigurasi sebagai parameter.
tr_tr: Önceki gibi, yapılandırma ayarlarını parametreler olarak verin.

source: As in traditional IT, cloud instances are accessed through IP addresses that OpenStack assigns. How this is actually done depends on the networking setup for your cloud. In some cases, you will simply get an Internet rout-able IP address assigned directly to your instance.
de: Wie in der traditionellen IT werden Cloud-Instanzen über IP-Adressen angesprochen, die OpenStack zuweist. Wie dies tatsächlich geschieht, hängt vom Netzwerk-Setup für Ihre Cloud ab. In einigen Fällen erhalten Sie einfach eine Internet-Router-fähige IP-Adresse, die direkt Ihrer Instanz zugewiesen wurde.
id: Seperti dalam TI tradisional, instance awan diakses melalui alamat IP yang diberikan OpenStack. Bagaimana ini sebenarnya dilakukan tergantung pada pengaturan jaringan untuk awan Anda. Dalam beberapa kasus, Anda hanya akan mendapatkan alamat IP rout-able internet yang diberikan langsung ke instance Anda.
tr_tr: Geleneksel IT'de olduğu gibi bulut sunucularına da OpenStack'in atadığı IP adresleri üzerinden erişilir. Bunun nasıl yapılacağı bulutunuzun ağ kurulumuna göre değişir. Bazı durumlarda, sunucunuza doğrudan atanmış internet yönlendirilebilir bir IP adresi alırsınız.

source: As mentioned in :doc:`/introduction`, the generated fractal images are saved on the local file system of the API service instances. Because you have multiple API instances up and running, the fractal images are spread across multiple API services, which causes a number of :code:`IOError: [Errno 2] No such file or directory` exceptions when trying to download a fractal image from an API service instance that does not have the fractal image on its local file system.
de: Wie bereits erwähnt in :doc:`/introduction`, werden die generierten Fraktalbilder auf dem lokalen Dateisystem der API Service Instanzen gespeichert. Da Sie mehrere API-Instanzen auf- und ablaufen lassen, werden die Fraktalbilder über mehrere API-Dienste verteilt, was eine Reihe von :codet: `IOError: [Errno 2] No such file or directory` Fehler beim Versuch, ein Fraktalbild herunterzuladen eine API-Service-Instanz, die nicht das Fraktalbild auf seinem lokalen Dateisystem hat, verursacht.
id: Seperti yang disebutkan di :doc:`/introduction`, image fraktal yang dihasilkan disimpan pada sistem file lokal dari instance layanan API. Karena beberapa instance API Anda aktif dan berjalan, image fraktal tersebar di beberapa layanan API, yang menyebabkan sejumlah pengecualian :code:`IOError: [Errno 2] No such file or directory` saat mencoba mendownload image fraktal dari instance layanan API yang tidak memiliki image fraktal pada sistem file lokalnya.
tr_tr: :doc:`/introduction` kısmında bahsedildiği gibi, üretilen fraktal imajları API servisi sunucularının yerel dosya sistemlerinde kaydedilir. Çalışır birden çok API sunucunuz olduğundan, fraktal imajlar birden çok API servisleri arasında dağılmıştır, bu da yerel dosya sisteminde istenen fraktal imajı barındırmayan API servisi sunucularından fraktal imajı indirmeye çalışırken :code:`IOError: [Errno 2] Böyle bir dosya ya dizin yok` istisnaları almanıza sebep olur.

source: As with classical infrastructure, failures of the underpinning cloud infrastructure (hardware, networks, and software) are unavoidable. When you design for the cloud, it is crucial that your application is designed for an environment where failures can happen at any moment. This may sound like a liability, but it is not; by designing your application with a high degree of fault tolerance, you also make it resilient, and more adaptable, in the face of change.
de: Wie bei der klassischen Infrastruktur sind Ausfälle der zugrunde liegenden Cloud-Infrastruktur (Hardware, Netzwerke und Software) unvermeidbar. Wenn Sie Ihre Cloud entwerfen, ist es entscheidend, dass Ihre Anwendung für eine Umgebung entworfen ist, in der Ausfälle jederzeit passieren können. Das klingt wie eine Drohung, aber es ist nicht; Durch die Gestaltung Ihrer Anwendung mit einem hohen Maß an Fehlertoleranz, machen Sie es auch belastbar und anpassungsfähiger, angesichts der Veränderung.
id: Seperti halnya infrastruktur klasik, kegagalan infrastruktur awan (hardware, jaringan, dan perangkat lunak) yang tidak dapat dihindari tidak dapat dihindari. Saat merancang awan, sangat penting aplikasi Anda dirancang untuk lingkungan tempat terjadi kegagalan setiap saat. Ini mungkin terdengar seperti pertanggungjawaban, tapi tidak demikian; Dengan merancang aplikasi Anda dengan tingkat toleransi kesalahan yang tinggi, Anda juga membuatnya tahan lama, dan lebih mudah beradaptasi, dalam menghadapi perubahan.
tr_tr: Klasik mimaride olduğu gibi, altta yatan bulut mimarisindeki (donanım, ağlar, ve yazılım) arızalar kaçınılmazdır. Bulut için tasarım yaptığınızda, uygulamanızın her an arızalarla karşılaşabilecek şekilde bu ortama göre tasarlanması çok önemlidir. Bu kulağa bir yükümlülük gibi gelse de; uygulamanızı yüksek derecede hata dayanıklılığına sahip şekilde tasarlamak kendini çabuk toparlayan, değişikliklere daha kolay uyum sağlayan hale getirecektir.

source: As you can see from the parameters passed to the installation script, you define this instance as the worker instance. But, you also pass the address of the API instance and the message queue so the worker can pick up requests. The Fractals application installation script accepts several parameters.
de: Wie Sie aus den an das Installationsskript übergebenen Parametern sehen können, definieren Sie diese Instanz als Worker-Instanz. Aber Sie übergeben auch die Adresse der API-Instanz und die Nachrichtenwarteschlange, damit der Worker Anfragen abholen kann. Das Installationsskript der Fractals-Anwendung akzeptiert mehrere Parameter.
id: Seperti yang dapat Anda lihat dari parameter yang dilewatkan ke skrip instalasi, Anda mendefinisikan instance ini sebagai instance pekerja. Tapi, Anda juga menyampaikan alamat instance API dan antrean pesan sehingga pekerja dapat mengambil permintaan. Skrip instalasi aplikasi Fractals menerima beberapa parameter.
tr_tr: Kurulum betiğine geçirilen parametrelerden görebileceğiniz gibi, bu sunucuyu işçi sunucu olarak tanımlarsınız. Bunun yanında API sunucusunun adresini ve işçilerin istekleri alabilmesi için ileti kuyruğunun adresini verirsiniz. Fraktallar uygulama kurulum betiği çeşitli parametreler alır.

source: As you change the topology of your applications, you must update or create security groups. Here, you re-create the required security groups.
de: Wenn Sie die Topologie Ihrer Anwendungen ändern, müssen Sie Sicherheitsgruppen aktualisieren oder erstellen. Hier erstellen Sie die erforderlichen Sicherheitsgruppen neu.
id: Saat Anda mengubah topologi aplikasi Anda, Anda harus memperbarui atau membuat grup keamanan. Di sini, Anda menciptakan kembali kelompok keamanan yang dibutuhkan.
tr_tr: Uygulamalarınızın topolojilerini değiştirdikçe, güvenlik grupları güncellemeli veya oluşturmalısınız. Burda gerekli güvenlik gruplarını tekrar oluşturursunuz.

source: Associate a floating IP for external connectivity
de: Verknüpfen Sie eine Floating-IP für externe Konnektivität
id: Mengaitkan IP terapung untuk konektivitas eksternal
tr_tr: Harici bağlantı için bir değişken IP ilişkilendirin

source: At the end of this section, you make some slight changes to the networking topology by using the OpenStack Networking API to create the 10.0.1.0/24 network to which the worker nodes attach. You use the 10.0.3.0/24 API network to attach the Fractal API servers. Web server instances have their own 10.0.2.0/24 network, which is accessible by fractal aficionados worldwide, by allocating floating IPs from the public network.
de: Am Ende dieses Abschnitts machen Sie einige Änderungen an der Netzwerk-Topologie, indem Sie die OpenStack Networking API verwenden, um das 10.0.1.0/24 Netzwerk zu erstellen, an das die Worker-Knoten angeschlossen sind. Sie verwenden das 10.0.3.0/24 API-Netzwerk, um die Fractal-API-Server anzubringen. Web-Server-Instanzen haben ihr eigenes 10.0.2.0/24 Netzwerk, das von Fraktal-Aficionados weltweit zugänglich ist, indem es Floating-IPs aus dem öffentlichen Netzwerk zuteilt.
id: Pada akhir bagian ini, Anda membuat sedikit perubahan pada topologi jaringan dengan menggunakan OpenStack Networking API untuk membuat jaringan 10.0.1.0/24 tempat (worker node) simpul pekerja mengkaitkan. Anda menggunakan jaringan API 10.0.3.0/24 untuk mengkaitkan server API Fraktal. Instance server web memiliki jaringan 10.0.2.0/24 sendiri, yang dapat diakses oleh aficionados (penggemar) fraktal di seluruh dunia, dengan mengalokasikan IP mengambang (floating) dari jaringan publik.
tr_tr: Bu kısmın sonunda, OpenStack Ağ API'sini işçi düğümlerin eklendiği 10.0.1.0/24 ağını oluşturmak için için kullanarak ağ topolojisine ufak değişiklikler yaparsınız. 10.0.3.0/24 API ağını Fraktal API sunucularını eklemek için kullanırsınız. Web sunucularının kendi 10.0.2.0/24 ağları vardır, bu ağ açık ağdan değişken IP adresleri ayrıldığından dünya çapında fraktal meraklıları tarafından erişilebilirdir.

source: Attach the floating IP address to the instance:
de: Bringen Sie die Floating-IP-Adresse an die Instanz an:
id: Lekatkan floating IP address ke instance:
tr_tr: Değişken IP adresini sunucuya ekleyin:

source: Automation
de: Automatisierung
id: Otomatisasi
tr_tr: Otomatikleştirme

source: Back up the Fractals app images, which are currently stored inside the database, on Object Storage.
de: Sichern Sie die Fractals App-Bilder, die derzeit in der Datenbank gespeichert sind, auf Object Storage.
id: Cadangkan gambar aplikasi Fractals, yang saat ini tersimpan di dalam database, di Object Storage.
tr_tr: Şu an veritabanında tutulan Fraktallar uygulama imajlarını Nesne Depolamaya yedekleyin.

source: Back up the Fractals from the database on the Object Storage
de: Sichern Sie die Fractals aus der Datenbank auf dem Objektspeicher
id: Cadangkan Fractal dari database pada Object Storage
tr_tr: Fraktalları veritabanından Nesne Depolama üzerine yedekleyin

source: Backups
de: Sicherungen
id: Cadangan (backup)
tr_tr: Yedekler

source: Basics
de: Grundlagen
id: Dasar-dasar
tr_tr: Temeller

source: Because all service endpoints use the Identity Service for authentication and authorization, place the following code in the 'void Main()' entry-point function.
de: Da alle Service-Endpunkte den Identity Service zur Authentifizierung und Autorisierung verwenden, platzieren Sie den folgenden Code in die 'void Main ()' Einstiegspunktfunktion.
id: Karena semua titik akhir layanan menggunakan Layanan Identity untuk otentikasi dan otorisasi, letakkan kode berikut di fungsi entry-point 'void Main ()'.
tr_tr: Tüm servis uç noktaları kimlik doğrulama ve yetkilendirme için Kimlik Servisini kullandığından, aşağıdaki kodu 'void Main()' giriş fonksiyonuna yerleştirin.

source: Because the SDKs do not fully support the OpenStack Networking API, this section uses the command-line clients.
de: Da die SDKs die OpenStack Networking API nicht vollständig unterstützen, verwendet dieser Abschnitt die Befehlszeilenclients.
id: Karena SDK tidak sepenuhnya mendukung OpenStack Networking API, bagian ini menggunakan klien command-lin.
tr_tr: SDK'lar OpenStack Ağ API'sini tamamen desteklemediğinden, bu kısım komut satırı istemcilerini kullanır.

source: Because the local file system is ephemeral storage, the fractal images are lost along with the instance when the instance is terminated. Block-based storage, which the :doc:`/block_storage` section discusses, avoids that problem, but like local file systems, it requires administration to ensure that it does not fill up, and immediate attention if disks fail.
de: Da das lokale Dateisystem eine kurzlebige Speicherung ist, gehen die Fraktalbilder zusammen mit der Instanz verloren, wenn die Instanz beendet ist. Block-basierte Speicherung, die der :doc: `/block_storage` Abschnitt diskutiert, vermeidet dieses Problem, aber wie lokale Dateisysteme, erfordert es die Verwaltung, um sicherzustellen, dass es nicht überläuft, und sofortige Aufmerksamkeit, wenn Festplatten kaputtgehen
id: Karena sistem file lokal adalah penyimpanan singkat, image fraktal hilang bersamaan dengan instance saat berakhir. Penyimpanan berbasis blok, dimana bagian :doc:`/block_storage` membahas, menghindari masalah itu, tapi seperti sistem file lokal, memerlukan administrasi untuk memastikan tidak terisi, dan segera diperhatikan jika disk gagal.
tr_tr: Yerel dosya sistemi geçici depolama olduğundan, fraktal imajlar sunucu sonlandırıldığından beraber kaybolurlar. :doc:`/block_storage` kısmında tartışıldığı gibi blok tabanlı depolama bu problemi aşar, ama yerel dosya sistemleri gibi dolmasını engellemek için bir yöneticiye ve diskler arızalanırsa anında müdahaleye ihtiyaç duyarlar.

source: Because the tutorial reuses the :code:`conn` object, make sure that you always have one handy.
de: Weil das Tutorial das :code: `conn` Objekt wiederverwendet, stellen Sie sicher, dass Sie immer eins zur Hand haben.
id: Karena tutorialnya menggunakan kembali obyek :code:`conn`, pastikan selalu ada yang berguna.
tr_tr: Öğretici :code:`conn` nesnesini tekrar kullandığından, hep birini el altında tuttuğunuzdan emin olun.

source: Before proceeding, install the latest version of shade.
de: Bevor Sie fortfahren, installieren Sie die neueste Version von shade.
id: Sebelum melanjutkan, pasang versi terbaru dari shade (naungan).
tr_tr: Devam etmeden önce shade'in son sürümünü kurun.

source: Before you continue, you must do one more thing.
de: Bevor Sie fortfahren, müssen Sie noch etwas machen.
id: Sebelum melanjutkan, Anda harus melakukan satu hal lagi.
tr_tr: Devam etmeden önce bir şey daha yapmalısınız.

source: Before you run this class, confirm that you have configured it for your cloud and the instance running the Fractals application.
de: Bevor Sie diese Klasse ausführen, bestätigen Sie, dass Sie es für Ihre Cloud konfiguriert haben und die Instanz läuft, die die Fractals-Anwendung ausführt.
id: Sebelum menjalankan kelas ini, konfirmasikan bahwa Anda telah mengonfigurasikannya untuk awan Anda dan instance menjalankan aplikasi Fractals.
tr_tr: Bu sınıfı çalıştırmadan önce bulutunuz ve Fraktal uygulamasını çalıştıran sunucu için yapılandırdığınızdan emin olun.

source: Before you run this script, confirm that you have set your authentication information, the flavor ID, and image ID.
de: Bevor Sie dieses Skript ausführen, bestätigen Sie, dass Sie Ihre Authentifizierungsinformationen, die Varianten-ID und die Image-ID festgelegt haben.
id: Sebelum menjalankan skrip ini, konfirmasikan bahwa Anda telah menyetel informasi autentikasi, flavor ID, dan image ID.
tr_tr: Bu betiği çalıştırmadan önce, kimlik doğrulama bilgisini, nitelik ve imaj kimliğini ayarladığınızdan emin olun.

source: Before you scale out your application services, like the API service or the workers, you must add a central database and an :code:`app-services` messaging instance. The database and messaging queue will be used to track the state of fractals and to coordinate the communication between the services.
de: Bevor Sie Ihre Anwendungsdienste ausschalten, wie der API-Dienst oder die Mitarbeiter, müssen Sie eine zentrale Datenbank und einen Code hinzufügen: `app-services` Messaging-Instanz. Die Datenbank- und Messaging-Warteschlange wird verwendet, um den Zustand der Fraktale zu verfolgen und die Kommunikation zwischen den Diensten zu koordinieren.
id: Sebelum Anda mengurangi layanan aplikasi Anda, seperti layanan API atau pekerja, Anda harus menambahkan database pusat dan instance pengiriman :code:`app-services` . Database dan antrian pesan akan digunakan untuk melacak keadaan fraktal dan untuk mengkoordinasikan komunikasi antara layanan.
tr_tr: API servisi veeya işçiler gibi uygulama servislerini dışa ölçeklemeden önce, merkezi bir veritabanı ve bir :code:`app-services` ileti kuyruğu eklemelisiniz. Veritabanı ve ileti kuyruğu fraktalların durumunu takip etmek ve servisler arasında iletişimi düzenlemek için kullanılacaktır.

source: Block Storage
de: Blockieren Sie Speicherplatz
tr_tr: Blok Depolama

source: Boot and configure an instance
de: Starten und konfigurieren Sie eine Instanz
id: Boot dan konfigurasikan sebuah instance
tr_tr: Bir sunucu önyükleyin ve yapılandırın

source: Booting a worker
de: Booten eines Workers
id: Booting pekerja
tr_tr: Bir işçinin önyüklenmesi

source: Bootstrap your network
de: Ihr Netzwerk bootstrappen
tr_tr: Ağ önyüklemesi yapın

source: By default, data in OpenStack instances is stored on 'ephemeral' disks. These disks remain with the instance throughout its lifetime. When you terminate the instance, that storage and all the data stored on it disappears. Ephemeral storage is allocated to a single instance and cannot be moved to another instance.
de: Standardmäßig werden Daten in OpenStack-Instanzen auf 'ephemeral' Festplatten gespeichert. Diese Festplatten bleiben während des ganzen Lebens mit der Instanz. Wenn Sie die Instanz beenden, verschwindet diese Festplatte und alle darin gespeicherten Daten. Der kurzlebige Speicher wird einer einzigen Instanz zugeordnet und kann nicht in eine andere Instanz verschoben werden.
id: Secara default, data dalam instance OpenStack disimpan pada disk 'ephemeral'. Disk ini tetap dengan instance selama masa hidupnya. Bila Anda mengakhiri instance, penyimpanan dan semua data yang tersimpan di dalamnya hilang. Penyimpanan sesaat dialokasikan ke satu instance dan tidak dapat dipindahkan ke instance lain.
tr_tr: Öntanımlı olarak, OpenStack sunucularındaki veri 'geçici' disklerde tutulur. Bu diskler sunucunun yaşam döngüsü boyunca sunucuyla kalır. Sunucuyu sonlandırdığınızda, bu depolama ve üzerindeki veriler kaybolur. Geçici depolama tek bir sunucu için ayrılır ve başka sunuculara taşınamaz.

source: CI/CD means that you always test your application and make frequent deployments to production.
de: CI/CD bedeutet, dass Sie immer Ihre Anwendung testen und häufige Bereitstellungen zur Produktion machen.
id: CI/CD berarti Anda selalu menguji aplikasi Anda dan sering melakukan penyebaran ke produksi.
tr_tr: CI/CD her zaman uygulamanızı test etmeniz ve sık sık üretim ortamına dağıtım yapmanız demektir.

source: Call the :code:`faafo` command-line interface to request the generation of five large fractals.
de: Rufen Sie den :code:`faafo` Befehlszeilenschnittstelle an, um die Erzeugung von fünf großen Fraktalen anzufordern.
id: Panggil antarmuka command-line :code:`faafo` untuk meminta pembangkit lima fraktal besar.
tr_tr: :code:`faafo` komut satırı arayüzünü çağırarak beş büyük fraktal üretimini isteyin.

source: Change the API code, such as "list fractals," to query Object Storage to get the metadata.
de: Ändern Sie den API-Code wie 'list fractals', um Object Storage abzufragen, um die Metadaten zu erhalten.
id: Ubah kode API, seperti "list fractals," untuk query Object Storage untuk mendapatkan metadata.
tr_tr: API kodunu değiştirin, örneğin "fraktalları listeleme"yi metaveriyi almak için Nesne Depolamayı sorgulayacak şekilde değiştirin.

source: Change the Fractal upload code to store metadata with the object in Object Storage.
de: Ändern Sie den Fractal-Upload-Code, um Metadaten mit dem Objekt in Object Storage zu speichern.
id: Ubah kode upload Fractal untuk menyimpan metadata dengan objek di Object Storage.
tr_tr: Fraktal yükleme kodunu değiştirerek metaveriyi nesneyle birlikte Nesne Depolamada saklayacak şekilde değiştirin.

source: Check to see whether the API service process is running like expected. You can find the logs for the API service in the directory :file:`/var/log/supervisor/`.
de: Überprüfen Sie, ob der API-Serviceprozess wie erwartet ausgeführt wird. Sie finden die Protokolle für den API-Dienst im Verzeichnis :file:`/var/log/supervisor/`.
id: Periksa untuk melihat apakah proses layanan API berjalan seperti yang diharapkan. Anda dapat menemukan log untuk layanan API di direktori :file:`/var/log/supervisor/`.
tr_tr: API servis sürecinin beklenen şekilde çalışıp çalışmadığını kontrol edin. API servisi için kayıtları :file:`/var/log/supervisor/` dizininde bulabilirsiniz.
