Repository: AsherBond/api-site
Catalog: api-ref-guides/locale/*.po
Languages: fr, id, zh_cn

source: Preface
fr: Préface
id: Kata pengantar
zh_cn: 前言

source: Use the OpenStack APIs and extensions in your OpenStack cloud.
fr: Utilisez les APIs et extensions OpenStack dans votre cloud OpenStack.
id: Gunakan OpenStack API dan ekstensi di OpenStack cloud Anda.
zh_cn: 在OpenStack云环境中使用OpenStack API和扩展服务。

source: You must install the packages for each API separately. After you authenticate through the <link href="api-ref-identity.html">Identity API</link>, you can use the other APIs and extensions to launch server instances, create images, assign metadata to instances and images, create containers and objects, and complete other actions in your OpenStack cloud. To get started with the APIs, see the <link href="http://docs.openstack.org/api/quick-start/content/">OpenStack API Quick Start</link>.
fr: Vous devez installer les packages de chaque API séparément. Après vous être authentifié par l'intermédiaire de <link href="api-ref-identity.html">l'API de gestion des identités</link>, vous pouvez utiliser les autres APIs et extensions pour démarrer des instances de serveur, créer des images, assigner des métadonnées aux instances et images, créer des conteneurs et des objets, et mener à bien d'autres actions dans votre cloud OpenStack. Pour débuter avec les APIs, reportez-vous à la documentation <link href="http://docs.openstack.org/api/quick-start/content/">API OpenStack: démarrage rapide</link>.

source: OpenStack Block Storage API v1 Reference
fr: Référence de l'API de Stockage par Bloc d'OpenStack v1
id: OpenStack Blok Storage API v1 Referensi
zh_cn: OpenStack对象存储APIv1参考

source: API Reference
fr: Référence de l'API
id: Referensi API
zh_cn: API 参考

source: OpenStack Foundation
fr: Fondation OpenStack
zh_cn: OpenStack基金会

source: OpenStack Block Storage
fr: Stockage par Bloc d'OpenStack
zh_cn: OpenStack块存储

source: Copyright details are filled in by the template.
fr: Les détails sur les droits d'auteurs sont remplis par le modèle.
id: Rincian hak cipta yang diisi oleh template.
zh_cn: 版权信息来自于模板

source: OpenStack Compute API v2 Extensions Reference
fr: Référence des Extensions de l'API de Calcul OpenStack v2

source: OpenStack API Complete Reference
fr: Référence Complète de l'API OpenStack
id: OpenStack API Lengkap Referensi
zh_cn: openstack API 完整参考资料

source: API Complete Reference
fr: Référence Complète de l'API
id: API Lengkap Referensi
zh_cn: OpenStack API完整参考资料。

source: OpenStack Networking (neutron) API v2.0 and Extensions Reference
fr: Référence de l'API de Gestion de Réseau (neutron) OpenStack v2.0 et de ses Extensions

source: Networking (neutron) API Reference
fr: Référence de l'API de Gestion de Réseau (neutron)

source: OpenStack Networking (neutron)
fr: Gestion de Réseau OpenStack (neutron)

source: OpenStack Orchestration API v1 Reference
fr: Référence de l'API d'Orchestration v1 OpenStack
id: OpenStack Orkestrasi API v1 Referensi

source: Orchestration API Reference
fr: Référence de l'API d'Orchestration

source: OpenStack Orchestration
fr: Orchestration OpenStack
id: OpenStack Orkestrasi

source: OpenStack Compute API v2 Reference
fr: Référence de l'API de Calcul v2 OpenStack

source: OpenStack Identity API v3 Reference
fr: Référence de l'API de Gestion des Identités v3 OpenStack

source: Identity API Reference
fr: Référence de l'API de Gestion des Identités

source: OpenStack Identity
fr: Gestion des Identités OpenStack

source: OpenStack Image Service API v2 Reference
fr: Référence du Service de Gestion d'Image v2 OpenStack
id: OpenStack Image Service API v2 Referensi
zh_cn: OpenStack 镜像服务 API v2 参考

source: OpenStack Image Service
fr: Service de Gestion d'Image OpenStack
id: Layanan OpenStack Image
zh_cn: OpenStack镜像服务

source: OpenStack Image Service API v1 Reference
fr: Référence du service de Gestion d'Image v1 OpenStack
id: OpenStack Image Service API v1 Referensi
zh_cn: OpenStack镜像服务API v1参考

source: OpenStack Telemetry API v2 Reference
fr: Référence de l'API de Télémétrie v2 OpenStack
id: OpenStack Telemetri API v2 Referensi
zh_cn: OpenStack计量服务API v2参考

source: Telemetry API Reference
fr: Référence de l'API de Télémétrie

source: OpenStack Telemetry
fr: Télémétrie OpenStack
id: OpenStack Telemetri
zh_cn: OpenStack计量服务

source: OpenStack Database Service API v1.0
fr: API du Service de Base de données v1.0 OpenStack

source: OpenStack Identity API v2.0 Reference
fr: Référence de l'API de Gestion des Identités v2.0 OpenStack

source: OpenStack Block Storage API v2 Reference
fr: Référence de l'API de Stockage par Bloc v2 OpenStack
id: OpenStack Blok Storage API v2 Referensi
zh_cn: OpenStack块存储API v2参考

source: OpenStack Object Storage API v1 Reference
fr: Référence de l'API de Stockage d'Objet v1 OpenStack
id: OpenStack Object Storage API v1 Referensi
zh_cn: OpenStack 对象存储 API v1参考

source: OpenStack Object Storage
fr: Stockage d'Objet OpenStack
zh_cn: OpenStack对象存储

source: translator-credits
fr: Olivier Buisson <olivier@obn.me>, 2012
id: penerjemah-kredit

source: OpenStack Clustering Service
id: Layanan OpenStack Clustering

source: OpenStack Clustering Service API v1 Reference
id: OpenStack Clustering Layanan API v1 Referensi

source: OpenStack Data Processing
id: OpenStack Pengolahan Data
zh_cn: OpenStack大数据处理服务

source: OpenStack Data Processing API v1.1 Reference
id: OpenStack Pengolahan Data API v1.1 Referensi
zh_cn: OpenStack大数据处理API v1.1参考

source: OpenStack Database Service
id: Layanan OpenStack Database
zh_cn: OpenStack数据库服务

source: OpenStack Database Service API v1.0 Reference
id: OpenStack Database Service API v1.0 Referensi
zh_cn: OpenStack数据库服务API v1.0参考

source: OpenStack Shared File Systems API v1 Reference
id: OpenStack Shared File Systems API v1 Referensi
zh_cn: OpenStack共享文件服务API v1参考

source: OpenStack Shared File Systems API v2 Reference
id: OpenStack Shared File Systems API v2 Referensi
zh_cn: OpenStack共享文件系统APIv2参考

source: You must install the packages for each API separately. After you authenticate through the <link xlink:href="api-ref-identity.html">Identity API</link>, you can use the other APIs and extensions to launch server instances, create images, assign metadata to instances and images, create containers and objects, and complete other actions in your OpenStack cloud. To get started with the APIs, see the <link xlink:href="http://developer.openstack.org/api-guide/quick-start/">OpenStack API Guide</link>.
id: Anda harus menginstal paket untuk setiap API secara terpisah. Setelah Anda mengotentikasi melalui <link xlink:href="api-ref-identity.html">Identity API</link>, Anda dapat menggunakan API lain dan ekstensi untuk meluncurkan server instance, membuat image, menetapkan metadata untuk instance and image, membuat wadah dan objek, dan melengkapi lainnya di OpenStack cloud Anda. Untuk memulai dengan API, lihat <link xlink:href="http://developer.openstack.org/api-guide/quick-start/">OpenStack API Guide</link>.
zh_cn: 你必须单独安装每个API的包。当你以“ <link xlink:href="api-ref-identity.html">Identity API</link>”这种形式通过OpenStack服务的认证后，你可以使用其他APIs和扩展服务实例，创建镜像，将数据分配到实例和镜像中，创建容器和对象，以及在你的OpenStack云环境中完成其他操作。获取更多关于APIs的信息，请参考以下链接：<link xlink:href="http://developer.openstack.org/api-guide/quick-start/">OpenStack API Guide</link>。

source: OpenStack Shared File Systems
zh_cn: OpenStack共享文件服务。
