Repository: AsherBond/api-site
Catalog: api-quick-start/source/locale/*.po
Languages: pt_br

source: A command-line tool that lets you send HTTP requests and receive responses. See <xref linkend="Compute_API_Quick_Start"/>.
pt_br: Uma ferramenta para terminal que permite que você mande requisições HTTP e receba as respsotas. Veja <xref linkend="Compute_API_Quick_Start"/>.

source: A token. If you do not provide a token, you must provide a user name and password.
pt_br: Um token. Se você não fornecer um token, precisa fornecer um usuário e senha.

source: Authenticate
pt_br: Autenticar

source: Authentication and API request workflow
pt_br: Fluxo de Autenticação e Requisição da API

source: Bad Request
pt_br: Falha em requisição

source: Before you can issue client commands, you must download and source the <filename>openrc</filename> file to set environment variables.
pt_br: Antes que você possa executar comandos no cliente, você deve baixar e acrescentar/substituir o arquivo <filename>openrc</filename> para definir as variáveis de ambiente.

source: Credentials are usually a combination of your user name and password, and optionally, the name or ID of the tenant in which your cloud runs. Ask your cloud administrator for your user name, password, and tenant so that you can generate authentication tokens. Alternatively, you can supply a token rather than a user name and password.
pt_br: Credenciais são geralmente uma combinação do seu nome de usuário e senha, e opcionalmente o nome ou ID do locatário no qual sua nuvem está em execução ou melhor no provedor da solução de nuvem que você contratou. Pergunte ao seu administrador da nuvem sobre os seus dados como seu nome de usuário, senha, e locatário do serviço de nuvem de modo que você possa gerar um passe (token) de autenticação. Alternativamente você pode fornecer um passe (token) ao invés de um nome de usuário e senha.

source: Description
pt_br: Descrição

source: For example, to install the <placeholder-1/> client, run this command:
pt_br: Por exemplo, para instalar o cliente <placeholder-1/>, execute esse comando:

source: For scripting work, you can use a command-line client like the <systemitem role="client">python-novaclient</systemitem> client. This client enables you to use the Compute API through a command-line interface.
pt_br: Para trabalhar com stripts, você pode usar um cliente de linha de comando como o <systemitem role="client">python-novaclient</systemitem>. Esse cliente permite você usar a Compute API através de uma interface de linha de comando.

source: If the request succeeds, the server returns an authentication token.
pt_br: Se a requisição for bem sucedida, o servidor retorna um token de autenticação.

source: If you do not know your tenant name or ID, you can send an authentication request with an empty tenantName, as follows:
pt_br: Se você não conhece o nome do seu tenant ou ID, você pode enviar uma requisição de autenticação com um tenantName vazio, como segue:

source: Install the clients
pt_br: Instalação do cliente

source: Launch an instance
pt_br: Lançando uma instância

source: OpenStack API Quick Start
pt_br: OpenStack API - Início rápido

source: OpenStack APIs
pt_br: APIs do OpenStack

source: OpenStack Python Software Development Kit (SDK)
pt_br: Kit de desenvolvimento de software Python para OpenStack (SDK)

source: OpenStack command-line clients
pt_br: Cliente de linha de comando do OpenStack

source: PROJECT
pt_br: PROJETO

source: Parameter
pt_br: Parâmetro

source: REST clients
pt_br: Clientes REST

source: Request an authentication token from the Identity endpoint that your cloud administrator gave you. Send a payload of credentials in the request:
pt_br: Solicite um token de autenticação do endpoint de Identidade que o seu administrador de nuvem lhe deu. Envie a carga de credenciais na requisição:

source: Run this command to install or update a client package:
pt_br: Execute esse comando para instalar ou atualizar um pacote do cliente:

source: Send API requests
pt_br: Manda requisição de API

source: The following example shows a successful response:
pt_br: O exemplo que segue mostra uma resposta bem sucedida.

source: The password for the user.
pt_br: A senha para o usuário.

source: The tenant ID. Both the <placeholder-1/> and <placeholder-2/> are optional, but should not be specified together. If both attributes are specified, the server responds with a <placeholder-3/><placeholder-4/>. If you do not know the tenantId, you can send a request with "" for the tenantId and get the ID returned to you in the response.
pt_br: O locatário ID (tenant ID). Ambos o <placeholder-1/>e<placeholder-2/>são opcionais, mas não deveram ser especificados juntos. Se ambos atributos são específicos. o servidor responde com um <placeholder-3/><placeholder-4/>.Se você não sabe o locatárioid (tenantid), você pode enviar uma solicitação ""para o locatarioid (tenantid) e obter o ID devolvido na resposta.

source: The tenant name. Both the <placeholder-1/> and <placeholder-2/> are optional, but should not be specified together. If both attributes are specified, the server responds with a <placeholder-3/><placeholder-4/>.
pt_br: O nome do locatario (tenant). Ambos o <placeholder-1/> e <placeholder-2/> são opcionais, mas não deveram ser especificados juntos. Se ambos atributos são especificados, o servidor responde com um <placeholder-3/> e <placeholder-4/>.

source: The user name. If you do not provide a user name and password, you must provide a token.
pt_br: O nome de usuário. Se você não fornecer um nome de usuário e senha, você precisa fornecer um token.

source: To authenticate access to OpenStack services, you must first issue an authentication request to OpenStack Identity to acquire an authentication token. To request an authentication token, you must supply a payload of credentials in the authentication request.
pt_br: Para autenticar acesso para os serviços OpenStack, você deverá primeiro emitir uma requisição de autenticação para o OpenStack Identity para adquirir um passe (token) de autenticação. Para requisitar um passe (token) de autenticação, você deve fornecer somente os dados que interessam da credencial na requisição da autenticação.

source: To begin sending API requests, use one of the following methods:
pt_br: Para começar a enviar API requests, use um dos seguintes métodos:

source: To launch an instance named <literal>my_instance</literal>, run the <placeholder-1/> command with the image and flavor IDs and the server name, as follows:
pt_br: Para iniciar uma instância de nome <literal>my_instance</literal>, execute o <placeholder-1/> comando com o ID da imagem e do flavor e o nome do servidor, como segue:

source: To launch an instance, note the IDs of your desired image and flavor.
pt_br: Para iniciar uma instancia, observe os IDs da sua imagem desejada e flavor.

source: To launch instances, you must choose a name, an image, and a flavor for your instance.
pt_br: Para disparar uma instância, você precisa escolher um nome, uma imagem e um flavor para sua instância.

source: To list available images, call the Compute API through the <placeholder-1/> client, as follows:
pt_br: Para listar as imagens disponíveis, chame a Compute API através do <placeholder-1/> cliente, conforme segue:

source: To list flavors, run this command:
pt_br: Para listar os flavors, execute este comando:

source: To remove the <placeholder-1/> client, run this command:
pt_br: Para remover o cliente <placeholder-1/>, execute esse comando:

source: To update the <placeholder-1/> client, run this command:
pt_br: Para atualizar o cliente <placeholder-1/>, execute esse comando:

source: To view details for a specified server, use the <placeholder-1/> command. Include the ID of the server:
pt_br: Para ver detalhes de um servidor específico, use o comando <placeholder-1/>. Inclua o ID do servidor:

source: Type
pt_br: Tipo

source: Use the <placeholder-1/> command to view your server:
pt_br: Use o <placeholder-1/> comando para visualizar seu servidor:

source: Use the Compute API to list flavors, as follows:
pt_br: Use o Compute API para listar os flavors, como segue:

source: Use the Compute API to list images, as follows:
pt_br: Use o Compute API para listar imagens, como segue:

source: Use the Compute API to list servers, as follows:
pt_br: Use o Compute API para listar imagens, como segue:

source: When you send API requests, you include the token in the <literal>X-Auth-Token</literal> header. If you access multiple OpenStack services, you must get a token for each service. A token is valid for a limited time before it expires. A token can also become invalid for other reasons. For example, if the roles for a user change, existing tokens for that user are invalid.
pt_br: Quando você envia solicitações para API, você inclui o passe (token) no cabeçalho <literal>X-Auth-Token</literal>. Se você acessa múltiplos serviços OpenStack, você deverá obter uma ficha para cada serviço. Um passe (token) é válido por um tempo limitado antes que expire. Um passe (token) pode também se tornar inválido por outras razões. Por exemplo, se a função para um usuário mudar, o passe (token) existente para aquele usuário será inválido.

source: Where <replaceable>PROJECT</replaceable> is the project name.
pt_br: Onde <replaceable>PROJECT</replaceable> é o nome do projeto.

source: You must install each client separately.
pt_br: Você deve instalar cada cliente separadamente.

source: password (required)
pt_br: senha (obrigatório)

source: tenantName (Optional)
pt_br: tenantName (Opcional)

source: token (Optional)
pt_br: token (Opcional)

source: translator-credits
pt_br: Créditos da tradução

source: username (required)
pt_br: nome de usuário (obrigatório)
